{
  "id": "343771",
  "forum_id": "39",
  "title": "Seeking Boston Players",
  "author": "Jeremy102175",
  "reply_count": 2,
  "view_count": 227,
  "created_date": null,
  "last_reply": "20231211T11:33:21-06:00",
  "posts": [
    {
      "post_id": "2396165",
      "post_title": "Seeking Boston Players",
      "post_author_name": "Jeremy102175",
      "post_content": "I hope this is the appropriate place to list \"wanted cards\".\r\nI'm fairly new to collecting T206 cards and have fallen in love with the set after doing a decent amount of research. My goal is to put together both of the Boston team sets, but unfortunately my budget is definitely on the lower end. I'm looking for both slabbed and raw cards, and don't really care about the condition so long as the colors aren't too faded, and the rarity of the backs isn't of much importance to me since I have no plans of selling. So far the only two I have in my collection are Arellanes and Stahl. If anyone is willing to send me some offers on Boston players I would be grateful. Thanks so much, and although I'm a new member, so far it's been amazing to see posts and discussions by people who truly love collecting these pieces or art and not just looking to flip for a buck.",
      "post_time": "20231211T09:35:53-06:00",
      "timestamp": "1702312553"
    },
    {
      "post_id": "2396193",
      "post_title": "",
      "post_author_name": "Cmvorce",
      "post_content": "Welcome to the boards, Jeremy. It’s a great place to meet really knowledgeable people and acquire amazing cards. I put the Boston AL set set together about two years ago and I’m pretty sure every card came from people on this site. Good luck on your journey - I’m sure you’ll have fun along the way.",
      "post_time": "20231211T11:11:00-06:00",
      "timestamp": "1702318260"
    },
    {
      "post_id": "2396202",
      "post_title": "",
      "post_author_name": "Jeremy102175",
      "post_content": "Thanks! I really appreciate you listing some reputable people you've bought from.",
      "post_time": "20231211T11:33:21-06:00",
      "timestamp": "1702319601"
    }
  ]
}