{
  "id": "218389",
  "forum_id": "39",
  "title": "My Old Mill Want-list (can buy or trade for)",
  "author": "Luke",
  "reply_count": 4,
  "view_count": 476,
  "created_date": null,
  "last_reply": "20160301T23:24:41-06:00",
  "posts": [
    {
      "post_id": "1506422",
      "post_title": "My Old Mill Want-list (can buy or trade for)",
      "post_author_name": "Luke",
      "post_content": "Hey Guys,\r\n\r\nI've assembled a pretty nice stack of Old Mill backs and I'm considering going for the whole sub-set.  These are the ones that I need.  Some of them are quite tough to find, and a few of these are fairly common.  I am happy to pay a premium for the tougher ones (and a small one for the others as well).  I also have a ton of stuff for trade.  \r\n\r\nIf you have anything on this list, please contact me.  I think you might be surprised at what I will trade for some of these.  For instance, if you have a Schmidt throwing or O'Leary portrait with Old Mill back, I'd happily trade you a HOFer in similar or nicer condition.\r\n\r\nFor me trading is the most fun of anything in the hobby, so hopefully there are a couple cards out there that we can work out a deal on.\r\n\r\nPlease PM or email me with any questions or to show me your cards.  Thanks!\r\n\r\n[url]lukealyon@gmail.com[/url]",
      "post_time": "20160220T12:56:01-06:00",
      "timestamp": "1455998161"
    },
    {
      "post_id": "1506984",
      "post_title": "",
      "post_author_name": "ZachS",
      "post_content": "I have a Bell (hands above head) which I think is pretty scarce. There's a scan here: [URL=\"http://www.net54baseball.com/showthread.php?t=178465\"]http://www.net54baseball.com/showthread.php?t=178465[/URL]\r\n\r\nI haven't noticed any others in my searches which makes me think some of the OM backs might give you problems. The Bell card is one of my favorites and I have several others with various backs. I don't think I'm ready to part with it yet but depending on how your quest develops I might be swayed to contribute. Good luck!",
      "post_time": "20160221T21:28:52-06:00",
      "timestamp": "1456115332"
    },
    {
      "post_id": "1509555",
      "post_title": "",
      "post_author_name": "Luke",
      "post_content": "Want to bump this for this weekend (I promise I won't be bumping it weekly) just to see if anyone else has any.  I've added 5 so far since starting the thread, and looking for more.\n\nThanks for posting Zach.  Your Bell is definitely a tough one.  I haven't seen one for sale in the last 2 years I've been looking.  I don't want anyone to part with a card they want to keep.  This project will take a long time (and will most likely never be totally complete) and I'm not in a huge hurry to add any particular front/back combo.  Some seem impossibly tough but then after I buy the first one I see, 2 more show up soon after.  There is a card on this list that I'd been looking for for 2 years, and then within the span of 3 days I went from having 0 to having 2 of them.  Funny how that works.  Just keep me in mind if you ever decide you want to sell it, or to entertain offers.  \n\nAnd thanks to everyone who has helped me so far.",
      "post_time": "20160228T15:11:49-06:00",
      "timestamp": "1456697509"
    },
    {
      "post_id": "1509893",
      "post_title": "",
      "post_author_name": "Sean",
      "post_content": "Luke, sorry, I just checked and you already have all the Old Mills in my collection. Except one. I have the Murray portrait, but it's the MURR'Y version.\r\n\r\nI don't think you want to trade for that one. Good luck.  :)",
      "post_time": "20160229T12:40:45-06:00",
      "timestamp": "1456774845"
    },
    {
      "post_id": "1510546",
      "post_title": "",
      "post_author_name": "Jantz",
      "post_content": "Hi Luke\r\n\r\nSince PSA started adding the back distinction to their pop report they have graded 3 Liebhardts. I own the PSA 1 graded Liebhardt and I'm willing to part with it.\r\n\r\nAs a back collector myself, I have to ask. Do you have any Polar Bear backs in 3-4 condition? I would like to possibly help you with your Old Mill set while acquiring a Polar Back for my set instead of just selling. A cash & trade on my part is fine. My Liebhardt is in rough shape, but it is a tough front/back combo to find. \r\n\r\nI can provide a list of the Polar Bears that I need, but I would bet that your list of Polar Bears that you have is shorter than my want list since I'm building the set.\r\n\r\nIf you could please, assuming you are interested in the Liebhardt, shoot me a list of the Polar Bears that you have in any condition.\r\n\r\nI will be PMing you soon about another topic that I would like to discuss with you.\r\n\r\nThanks\r\n\r\nJantz",
      "post_time": "20160301T23:24:41-06:00",
      "timestamp": "1456899881"
    }
  ]
}