{
  "id": "192357",
  "forum_id": "39",
  "title": "FS: T206 Player Autographs - Devlin Lord Ball Paskert Hinchman Bradley Barbeau ++",
  "author": "btcarfagno",
  "reply_count": 6,
  "view_count": 905,
  "created_date": null,
  "last_reply": "20180114T09:16:00-06:00",
  "posts": [
    {
      "post_id": "1309924",
      "post_title": "FS: T206 Player Autographs - Devlin Lord Ball Paskert Hinchman Bradley Barbeau ++",
      "post_author_name": "btcarfagno",
      "post_content": "Art Devlin\n\nThis is such a cool piece. It hails from the group of letters that were recently found from 1910 regarding the post season all star series that never got off the ground. This piece is actually on a single page but is folded so as to put the writing on three sides.\n\nDevlin writes regarding his agreement to take part in the all star series, but shows some reluctence as he does not want to get in trouble with the league. The great part of the letter is that he mentions that he will be \"going to trial\" in October of 1910 in Brooklyn. This was due to an on field incident where Devlin climbed into the stands to pummel a heckling fan in June of that year.\n\nThe letter is in beautiful condition and the autograph is large and very bold. The letter is dated September 25, 1910 from the Polo Grounds.\n\nDevlin was a member of the 1905 World Champion Giants and was integral to the many contending Giants teams from 1904-1911. He passed away in 1948 making his autograph very tough to find in any format, let alone a playing days ALS.\n\nAsking SOLD delivered.\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/img09012017_0003_zpshmfynknz.jpg[/IMG]\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/img09012017_0002_zpsnqwg8f6g.jpg[/IMG]\n\n\n\nHarry Lord\n\nAnother tough T206 player autograph. This one also hails from the group of letters pertaining to the 1910 post season all star series that was not to be.\n\nThis letter is on Planters Hotel of St Louis stationary (likely stolen from there by Mr. Lord himself on one of his trips through town with the Red Sox or White Sox) and was written on September 29, 1910. \n\nWritten in bold fountain pen, the signature is tremendous and dark. Lord passed away in 1948 making his signature very tough to acquire, especially a playing days ALS.\n\nHarry Lord played with the Boston Red Sox from 1907-1910. He was with the Chicago White Sox from 1910-1914, and with the Buffalo Blues of the Federal League (The Buffeds) in 1915. \n\nAsking $450 delivered.\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/img09012017_0001_zpsjuo04tgr.jpg[/IMG]\n\n\n\nBill Carrigan\n\nMy third and final piece from the group of 1910 letters regarding the post season all star series. \n\nCarrigan writes on hotel stationary his concerns about the series as well as his uniform measurments. This one is also dated to 1910. It contains a full name autograph of Carrigan which is nearly non existent. Carrigan lived until 1969 and his is not a difficult autograph to find. However, all examples that you do find will be later in life examples signed \"Bill Carrigan\". Tis one was signed during his playing career and he signed it \"William F Carrigan\".\n\nCarrigan was a player on the Boston Red Sox from 1906-1916. He played on World Series champion Red Sox teams in 1912, 1915 and 1916, the latter two of which he was also manager of the team. He was Red Sox manager from 1913-1916 and again from 1927-1929.\n\nMany mentions of Hall Of Famer Tris Speaker.\n\nAsking $300 delivered\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/2016/img09012017_0004_zpsno619ljl.jpg[/IMG]\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/2016/img09012017_0005_zpst7dklugf.jpg[/IMG]\n\n\n\nDode Paskert\n\nPaskert was an above average outfielder for the Phillies, Reds and Cubs from 1907-1921. He is pictured with the Cincinnati Reds in the T206 set. He was a fast runner and above average outfielder who also managed to have a career OPS+ of 108 over nearly 7000 career plate appearances. Items signed by Paskert are especially tough to find, even on a 3x5 or GPC. This is the first signed photo of him that I have even encountered. This is a 4x6 Burke and Brace photo and has been signed by Paskert along the left side. Very bold signature as well. Condition is exquisite. Paskert passed away at age 77 in 1959.\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/collectiblesgains042/paskert_zps902e656b.jpeg[/IMG]\n\nAsking $380 delivered.\n\nNeal Ball\n\nBall was a member of the New York Highlanders (Yankees) when he was included in the T206 set. In 1909 he became the first player in major league history to complete an unassisted triple play. He laster was a member of the 1912 World Series champion Boston Red Sox. Offered here is an 4x6 George Burke photo signed beautifully across the front by Ball in vintage fountain pen. Ball passed away at the age of 76 in 1957 and his autograph is not an easy one to find, even on a 3x5 or GPC. Signed photos of him, however, are just about nonexistent. Condition is exquisite.\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/collectiblesgains042/ball_zpsd6d3dd40.jpeg[/IMG]\n\nAsking $340 delivered\n\n\nJap Barbeau signed 3x5\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/collectiblesgains006/JapBarbeau_zpse3578f64.jpg[/IMG]\n\nDied in 1969. $65\n\n\n\n\nNeal Ball signed 3x5\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/collectiblesgains006/NealBall_zpsb823bd07.jpg[/IMG]\n\nExtremely tough autograph to find. Died in 1957. $190\n\n\n\nBob Dusty Rhoads Signed 3x5\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/collectiblesgains006/DustyRhoads_zps0d4a08d8.jpg[/IMG]\n\nTougher autograph even though he lived until 1967. $95\n\n\n\nBill Bradley signed 3x5\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/collectiblesgains006/BillBradley_zps284dd582.jpg[/IMG]\n\nTough signature died 1954. $190\n\n\n\n\nBill Hinchman 1948 GPC\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/2014_02_03_13_12_06_zps8d3b6c7c.jpg[/IMG]\n\nHinchman passed away in 1963 and is very tough to find. $100\n\n\n\nAlso have 3x5 Index cards signed of:\n\nPaddy Livingston $15\n\nTom C",
      "post_time": "20140813T20:36:36-06:00",
      "timestamp": "1407983796"
    },
    {
      "post_id": "1321492",
      "post_title": "",
      "post_author_name": "btcarfagno",
      "post_content": "Edited for items sold. Prices reduced.\r\n\r\nTom C",
      "post_time": "20140913T09:28:52-06:00",
      "timestamp": "1410622132"
    },
    {
      "post_id": "1348334",
      "post_title": "",
      "post_author_name": "btcarfagno",
      "post_content": "Added trio of tough signed photos...\r\n\r\nTom C",
      "post_time": "20141126T11:16:36-06:00",
      "timestamp": "1417025796"
    },
    {
      "post_id": "1707298",
      "post_title": "",
      "post_author_name": "btcarfagno",
      "post_content": "Bump for some really cool new items.\r\n\r\nTom C",
      "post_time": "20171004T15:06:57-06:00",
      "timestamp": "1507151217"
    },
    {
      "post_id": "1707365",
      "post_title": "",
      "post_author_name": "ronniehatesjazz",
      "post_content": "PM sent",
      "post_time": "20171004T18:26:13-06:00",
      "timestamp": "1507163173"
    },
    {
      "post_id": "1727924",
      "post_title": "",
      "post_author_name": "btcarfagno",
      "post_content": "Bump for some really nice T206 player autographs available.",
      "post_time": "20171209T12:44:54-06:00",
      "timestamp": "1512848694"
    },
    {
      "post_id": "1738616",
      "post_title": "",
      "post_author_name": "btcarfagno",
      "post_content": "Prices dropped on some VERY tough T206 player autographs.",
      "post_time": "20180114T09:16:00-06:00",
      "timestamp": "1515946560"
    }
  ]
}