{
  "id": "229631",
  "forum_id": "39",
  "title": "FT/FS: Raw Mid-Grade American Beauty's",
  "author": "Baseball*Collectibles",
  "reply_count": 0,
  "view_count": 250,
  "created_date": null,
  "last_reply": "20161008T08:40:16-06:00",
  "posts": [
    {
      "post_id": "1592100",
      "post_title": "FT/FS: Raw Mid-Grade American Beauty's",
      "post_author_name": "Baseball*Collectibles",
      "post_content": "I have the following nice American Beauty cards available for sale or trade (I prefer to trade).  All of the cards are GUARANTEED to grade or your money back (including shipping).  I cannot guarantee the grades, however, I do feel I have graded them accurately.  Please refer to the scans, and do not hesitate to contact me at [url]tbotticell@gmail.com[/url] or PM me if you have any questions, comments or concerns.  PayPal FF is preferred (PayPal address is [url]tbotticell@aol.com[/url]).  The prices include delivery.  Looking for T206 HOF's with more difficult backs in G-VG.\r\n\r\nHayden AB 350 Frame - VG-VG/EX - This card has nice borders, decent corners and no creases.  The minor flaw is staining on the back along the middle to upper right edge with an indentation near the corner. $160\r\nMalarkey AB 350 Frame - EX - Really nice card with sharp corners, borders and no creases. $325\r\nPaskert AB 350 Frame - VG-VG/EX - Nice corners, borders and no creases.  There is staining on the front in the upper left edge to the upper right corner. Slight chipping along the edges.  $160\r\nPickering AB 350 Frame - VG/EX-EX - Decent borders, slightly rounded corners and a wrinkle on the upper left back.  $250\r\nSteinfeldt AB 350 No Frame - VG+ - Rounded corners, especially the upper right corner. Clean back with no creases. $250\r\nWhite AB 350 Frame - VG/EX-EX - Nice corners with light staining in the upper left with nice borders.  There is a wrinkle on the front that starts on the left edge near the back of White's head and goes horizontally through to the right edge. $250.",
      "post_time": "20161008T08:40:16-06:00",
      "timestamp": "1475937616"
    }
  ]
}