{
  "id": "232799",
  "forum_id": "39",
  "title": "4Show Graded Baseball Card Wall Display Frames - Made in USA",
  "author": "cguidi",
  "reply_count": 12,
  "view_count": 1723,
  "created_date": null,
  "last_reply": "20170506T06:43:02-06:00",
  "posts": [
    {
      "post_id": "1612975",
      "post_title": "4Show Graded Baseball Card Wall Display Frames - Made in USA",
      "post_author_name": "cguidi",
      "post_content": "[IMG]https://static1.squarespace.com/static/584584b9e58c6295c564ee8b/t/584ef9dcbe6594f67578dfef/1481576798931/?format=750w[/IMG]\n\nI have noticed that every couple of years a thread pops up on the forum asking for ideas or product suggestions that allow us collectors to showcase our cards in a way that is stylish and affordable.  While I have been amazed at the creativity and resourcefulness of some of the Net54 members, I have myself been frustrated with the limited number of options available on the open market and the high costs of custom framing through my local frame shop.  I decided to take matters into my own hands and design a solution I hope the community will enjoy.   \n\nI custom cut these pieces of black matte acrylic using a gigantic laser to fit SGC cards like a glove.  There is a little play on the PSA cards since they are a little smaller but I wanted collectors to be able to display both in the same frame.  In the future, if demand is high enough, I can create a mat that specifically fits PSA.   \n\nThe mats are designed to be inserted into most standard 14x11, 10x8, or 7x5 inch frames but I am also offering them paired up with these handsome wood frames if you would prefer to buy something that is ready to hang on your wall.\n\nThese frames are designed to allow you to switch cards in and out very easily so you can rotate your favorites.  Or you could just hang them all!\n\nEverything is proudly made in the USA!\n\nIf you would like to order one of these mats or frames please visit my store at 4Showframes.com where we are currently accepting orders. I set the website and everything up myself (first time) so please PM me or email me at [url]guidi.christian@gmail.com[/url] if you have any trouble or have suggestions.  It should work well on your phone too.  \n\nSince this board was a source of inspiration Net54 members can enjoy a 20% discount on their first order by entering promo code NET54.  I will also be offering them on eBay at a slightly higher price to cover the selling fees.   \n\nThank you,\nChristian Guidi \n4Showframes.com",
      "post_time": "20161222T05:23:17-06:00",
      "timestamp": "1482409397"
    },
    {
      "post_id": "1613177",
      "post_title": "",
      "post_author_name": "Mountaineer1999",
      "post_content": "These look really nice! Will definitely consider using these when I start to display my collection.",
      "post_time": "20161222T18:43:43-06:00",
      "timestamp": "1482457423"
    },
    {
      "post_id": "1616080",
      "post_title": "",
      "post_author_name": "cguidi",
      "post_content": "Thanks!  Please do... we are hoping to add a few new options to the lineup the next time we reorder so if there is something you would like to see in the future please let me know.  \r\n\r\nHappy New Year :)",
      "post_time": "20170101T19:31:49-06:00",
      "timestamp": "1483324309"
    },
    {
      "post_id": "1616121",
      "post_title": "",
      "post_author_name": "VintageBen",
      "post_content": "coupon is no longer available",
      "post_time": "20170101T20:41:06-06:00",
      "timestamp": "1483328466"
    },
    {
      "post_id": "1616320",
      "post_title": "",
      "post_author_name": "cguidi",
      "post_content": "It was set to expire on 12/31/16... I just reactivated it!\r\n\r\nEmail me if you have any trouble:\r\n\r\n[url]guidi.christain@gmail.com[/url]",
      "post_time": "20170102T11:07:03-06:00",
      "timestamp": "1483380423"
    },
    {
      "post_id": "1616364",
      "post_title": "",
      "post_author_name": "Matt1150",
      "post_content": "I just ordered one, thanks for the code Christian!",
      "post_time": "20170102T13:25:14-06:00",
      "timestamp": "1483388714"
    },
    {
      "post_id": "1616387",
      "post_title": "",
      "post_author_name": "cguidi",
      "post_content": "Got your order Matt... Your Round Tripper frame will ship out first thing tomorrow.  Let me know what you think about the frame and thank you for your order :)",
      "post_time": "20170102T14:49:11-06:00",
      "timestamp": "1483393751"
    },
    {
      "post_id": "1617361",
      "post_title": "bigger?",
      "post_author_name": "tuckr1",
      "post_content": "I have 1935 National Chicle Set, with 36 SGC cards was wondering if you could make something that big?",
      "post_time": "20170105T07:29:39-06:00",
      "timestamp": "1483626579"
    },
    {
      "post_id": "1617417",
      "post_title": "",
      "post_author_name": "cguidi",
      "post_content": "Tucker,\r\n\r\nCongratulations on your set!  I am keeping a list of \"custom order\" requests and when I have enough I will put them all together.  The mats are cut from a giant piece of acrylic and the set up and design costs for each order are a couple hundred bucks so I need to to sell a little bit of what I had made up to start before I do another order.  Thanks for your interest and I will keep you posted!\r\n\r\nThanks,\r\n\r\nChristian",
      "post_time": "20170105T10:33:32-06:00",
      "timestamp": "1483637612"
    },
    {
      "post_id": "1621577",
      "post_title": "",
      "post_author_name": "cguidi",
      "post_content": "Update: We will be adding a two card \"Ground Rule Double\" frame and a nine card \"Boys of Summer\" frame in the next two weeks.",
      "post_time": "20170117T18:39:01-06:00",
      "timestamp": "1484703541"
    },
    {
      "post_id": "1657841",
      "post_title": "Custom Order",
      "post_author_name": "cguidi",
      "post_content": "Several folks have reached out requesting custom cut mats and I am putting in an order with our manufacturer so I wanted to see if anyone else out there is interested. \r\n\r\nCustom orders will be for the Mat Only unless the dimensions match one of the black frames we already offer (14x11, 10x8, 7x5).  The mats are 1/4\" thick but should fit with many frames you can pick up at your local frame or craft shop.\r\n\r\nRight now we can cut PSA and SGC card openings perfectly but if you are looking for graded autograph or oversized card holders you will need to send me the EXACT dimensions for the opening size(s) you want along with any layout preferences.  \r\n\r\nPricing will be $0.35 per square inch (plus shipping) based on the outside dimensions of the mat.  \r\n\r\nIf you are interested please let me know before the end of the weekend as our final proof will be submitted on Monday.  I should have the mats in hand next weekend so delivery will likely be the week after that.\r\n\r\nThank you for your interest.\r\n\r\nChristian Guidi\r\n4Showframes.com\r\n[url]guidi.christian@gmail.com[/url]",
      "post_time": "20170504T08:31:46-06:00",
      "timestamp": "1493908306"
    },
    {
      "post_id": "1658057",
      "post_title": "",
      "post_author_name": "Rich Falvo",
      "post_content": "Is the 9-card mat available yet?",
      "post_time": "20170504T18:36:52-06:00",
      "timestamp": "1493944612"
    },
    {
      "post_id": "1658418",
      "post_title": "",
      "post_author_name": "cguidi",
      "post_content": "Yes I have a 9 card mat in stock (measures 16X20) but I have not found the frame I want to sell it with yet.  The openings are SGC sized so you could use it with SGC or PSA slabbed cards.  You should be able to find a frame that works locally at a Target, Michaels, or frame shop.  The price for the mat would be $95 plus shipping.  Thank you so much for your interest.",
      "post_time": "20170506T06:43:02-06:00",
      "timestamp": "1494074582"
    }
  ]
}