{
  "id": "273958",
  "forum_id": "39",
  "title": "FS  T206 Cycle 460  PSA 4 (mk)  John McGraw (glove at hip)  Highest Grade (only 1 )",
  "author": "Donscards",
  "reply_count": 7,
  "view_count": 542,
  "created_date": null,
  "last_reply": "20190926T17:14:16-06:00",
  "posts": [
    {
      "post_id": "1919238",
      "post_title": "FS  T206 Cycle 460  PSA 4 (mk)  John McGraw (glove at hip)  Highest Grade (only 1 )",
      "post_author_name": "Donscards",
      "post_content": "Selling---PSA 4 (mk)  T206 Cycle 460  John McGraw  Glove at Hip  $2250 or best offer--check scans---This is the only Cycle 460 McGraw graded, needless to say , the highest grade.  The mark is on the back of the card and very tiny.  Clean front and well centered--Very Nice card---let me know if you have any questions.  thanks,  Don",
      "post_time": "20190925T13:07:10-06:00",
      "timestamp": "1569438430"
    },
    {
      "post_id": "1919335",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "Are you sure the mark is on the back? Unless there's a red mustache version I don't know about, I'd say the mark appears to be right under his nose.",
      "post_time": "20190925T19:51:39-06:00",
      "timestamp": "1569462699"
    },
    {
      "post_id": "1919343",
      "post_title": "",
      "post_author_name": "blametony",
      "post_content": ":)",
      "post_time": "20190925T20:15:15-06:00",
      "timestamp": "1569464115"
    },
    {
      "post_id": "1919433",
      "post_title": "",
      "post_author_name": "trambo",
      "post_content": "I had this card in my collection for a bit and couldn't exactly figure out where the MK came from.  Initially, I thought it was under his lip but I believe that's not a mark where someone took pen/pencil to the card.  Someone asked me last night what I thought so I pulled the scan I had of the card and blew it up.  The part I think is the mark should be attached to this post.  It looks like a green ink mark to the right of the 460.\r\n\r\nCertainly Don can answer any questions as he's far more experienced and knowledgeable on T206's than I am but I thought I'd provide my $.02 as I was the owner of the card for a time.  The card presents really well and is the only Cycle 460 version of this card in the PSA pop report.  I only sold it because I picked up a higher grade common back for my set.",
      "post_time": "20190926T10:46:55-06:00",
      "timestamp": "1569516415"
    },
    {
      "post_id": "1919447",
      "post_title": "Green spot . . . red lip . . .",
      "post_author_name": "HobokenJon",
      "post_content": "I see the green spot. What's your theory on the red lip? Is the red line a print spot?",
      "post_time": "20190926T12:19:34-06:00",
      "timestamp": "1569521974"
    },
    {
      "post_id": "1919455",
      "post_title": "",
      "post_author_name": "trambo",
      "post_content": "again, only my $.02 but I do think it's a print issue w/the red lips.  I saw a thread about it here somewhere not long ago.  The green spot looks like ink to me but I missed it when I used my loupe originally.  Regardless, it's a sweet card!",
      "post_time": "20190926T12:34:46-06:00",
      "timestamp": "1569522886"
    },
    {
      "post_id": "1919458",
      "post_title": "",
      "post_author_name": "Luke",
      "post_content": "I think the red is just from his lips and it's a little out of register.  My copy has red lips as well:",
      "post_time": "20190926T12:43:21-06:00",
      "timestamp": "1569523401"
    },
    {
      "post_id": "1919530",
      "post_title": "E90-1 Joss pitching",
      "post_author_name": "823dek",
      "post_content": "See this card for Red lips it happens...not interested move on. This brain surgeon male bonding is over kill, the card is scanned, you see it. Does Dolly Parton sleep on her back ?",
      "post_time": "20190926T17:14:16-06:00",
      "timestamp": "1569539656"
    }
  ]
}