{
  "id": "359798",
  "forum_id": "39",
  "title": "1910 T206 Wallace SGC 3 VG. PLEASE READ.",
  "author": "Brian Van Horn",
  "reply_count": 0,
  "view_count": 689,
  "created_date": null,
  "last_reply": "20250402T18:19:29-06:00",
  "posts": [
    {
      "post_id": "2507327",
      "post_title": "1910 T206 Wallace SGC 3 VG. PLEASE READ.",
      "post_author_name": "Brian Van Horn",
      "post_content": "1910 T206 Wallace SGC 3 VG-The corners are great. Now for the back which has a horizontal mark and a number of stains.\r\n\r\nOn the back in the upper right where the top line loops is a horizontal mark from the right border. It looks like a typing mark, but I cannot confirm.\r\n\r\nNow, for the stains:\r\n\r\nIn the upper left of the three-line border parallel to the top loop of the three is a small stain. \r\n\r\nThere is another stain touching inside top and the bottom of the \"3,\" going over the \"5\" and into the upper right of the \"0\" in \"350\" on the upper the upper left side.\r\n\r\nThere is a stain touching the inside of the \"S\" and the \"U\" in \"SUBJECTS.\"\r\n\r\nTouching the lower sides of the \"B\" and \"J\" is another stain that touches the edge of the top diagonal line above \"Piedmont.\"\r\n\r\nAbove the \"T\" in \"SUBJECTS\" is another stain.\r\n\r\nAbove the diagonal \"Piedmont\" there are two more stains with one above the \"e\" and another above the circle in the \"d.\" \r\n\r\nThere is a little spot above the top of the high finish of the second diagonal group of three lines and another dot in the right border just below the diagonal finish of the third line in the second group of three diagonal lines. \r\n\r\nThere are a couple of spots in the right border diagonally up to the right of \"The.\"\r\n\r\nIn the lowest edge of the second set of three lines and diagonally up to the left of the \"C\" in \"CIGARETTE\" is another stain which goes through the back of the \"C\" and through its base to space below the \"C.\" Next to the bottom of that stain is a stain below the \"I\" and \"G.\"\r\n\r\nHorizontally to the right of the second \"E\" in \"CIGARETTE\" touching the outside of the third vertical line.\r\n\r\nFINALLY, just to the left of the \"V\" bottom of the ad there is a stain that starts just inside the diagonal lining below the \"A\" in \"QUALITY\" and extends down to the left through the lines and one part stops above the \"Y\" in \"FACTORY\" while another part of the same stain extends into the \"CTOR\" of the same word. \r\n\r\nThere is also a little white diagonal spot rising left to right over the \"A\" and \"C\" in \"FACTORY.\"\r\n\r\n$225.00\r\n\r\nS/h is $5.65 outside of California, Oregon, the state of Washington and Arizona in which case the s/h is $6.05. S/h to Hawaii or Alaska is higher.\r\n\r\nIf paying by PayPal, please pay by PayPal Gift/Friends and Family to [url]wzard15243@yahoo.com[/url].",
      "post_time": "20250402T18:19:29-06:00",
      "timestamp": "1743639569"
    }
  ]
}