{
  "id": "209568",
  "forum_id": "39",
  "title": "Jack and Molly - Dey Gone",
  "author": "frankbmd",
  "reply_count": 1,
  "view_count": 255,
  "created_date": null,
  "last_reply": "20150804T15:50:59-06:00",
  "posts": [
    {
      "post_id": "1438259",
      "post_title": "Jack and Molly - Dey Gone",
      "post_author_name": "frankbmd",
      "post_content": "Two Texas Leaguers in 1909 who played for San Antonio and Dallas are Jack Bastian and Molly Miller.  Jack and Molly are also the names of my great aunt and great uncle from Peterborough, Ontario, who did not play baseball, but I digress.\r\n\r\nBastian and Miller never made it to the \"Bigs\", but they did make it to T206 immortality.  Offering the pair for SOLD shipped may seem like highway robbery to some, but is an opportunity for someone to pick up two SLers whose eye appeal exceeds their grade of SGC 20.\r\n\r\nI would contend that the Bastian card from the front appears much better and only that nasty tape residue on the back is responsible for the lowered grade.  Please note the Old Mill reverse as well\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10025/bastian-sl[/IMG]\r\n\r\nMolly Miller is a well centered example with a sharp image.  There is some creasing which does not detract from the image and in my opinion this card could have received a grade of 30 on another day.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10276/miller-m-sl[/IMG]\r\n\r\nFor those of you who want to review their illustrious careers, in Baseball Reference Jack is known as John Bastian and Molly is known as Charles Miller.\r\n\r\nThey are offered as a pair and are SOLD.  If you only want one, we can talk.;)",
      "post_time": "20150804T15:02:34-06:00",
      "timestamp": "1438722154"
    },
    {
      "post_id": "1438294",
      "post_title": "",
      "post_author_name": "Laxcat",
      "post_content": "I'll make them at home in Texas if they are still available.",
      "post_time": "20150804T15:50:59-06:00",
      "timestamp": "1438725059"
    }
  ]
}