{
  "id": "291968",
  "forum_id": "39",
  "title": "FS T206 Cycle 460 White and Berger",
  "author": "hcv123",
  "reply_count": 3,
  "view_count": 560,
  "created_date": null,
  "last_reply": "20201120T11:23:51-06:00",
  "posts": [
    {
      "post_id": "2036148",
      "post_title": "FS T206 Cycle 460 White and Berger",
      "post_author_name": "hcv123",
      "post_content": "Rare Cycle 460 backs of Berger (combined SGC and PSA pop of 8) and White (combined PSA and SGC pop of 10).  Cards are offered individually.  I will sell to the best offer (offers accepted by Private Message only - posted offers will be ignored/excluded) over $275 for each card that I have by this Friday at Noon (12PM) Eastern.  You can make 1 offer for each card.  I will not be posting offers, just selling to the best 1 I have by Friday.  Offer includes insured delivery and net payment to me (your exact offer by Paypal friends and family or +3% by Paypal goods and services).  Checks and money orders also accepted.  \nBerger has 2 horizontal creases Just below his arms and another across his face as well as a light stain in the top right quadrant of the card.\nWhite has a crease in the lower right quadrant and others in the upper right and lower left corners.  Very slight wet sheet transfer.  This card has very nice eye appeal.",
      "post_time": "20201117T14:16:11-06:00",
      "timestamp": "1605647771"
    },
    {
      "post_id": "2036494",
      "post_title": "2 days left bump",
      "post_author_name": "hcv123",
      "post_content": "ttt",
      "post_time": "20201118T15:29:55-06:00",
      "timestamp": "1605738595"
    },
    {
      "post_id": "2036792",
      "post_title": "20 hours till offer deadline",
      "post_author_name": "hcv123",
      "post_content": "Last bump  - offers due before noon tomorrow (Friday).",
      "post_time": "20201119T13:38:49-06:00",
      "timestamp": "1605818329"
    },
    {
      "post_id": "2037052",
      "post_title": "Thank you",
      "post_author_name": "hcv123",
      "post_content": "Thank you for all offers.  The member with the highest offer has been notified by PM",
      "post_time": "20201120T11:23:51-06:00",
      "timestamp": "1605896631"
    }
  ]
}