{
  "id": "308957",
  "forum_id": "39",
  "title": "SGC 1.5 Old Mill red Cobb with iconic back-stamp--What's it worth?--",
  "author": "dougscats",
  "reply_count": 4,
  "view_count": 845,
  "created_date": null,
  "last_reply": "20211024T08:43:43-06:00",
  "posts": [
    {
      "post_id": "2152922",
      "post_title": "SGC 1.5 Old Mill red Cobb with iconic back-stamp--What's it worth?--",
      "post_author_name": "dougscats",
      "post_content": "I am considering trading this Cobb and would like to know its fair value.\r\n\r\nNow I know that it's worth more to back-stamp collectors than to others.\r\nSo, if there are any back-stamp collectors out there who value it highly, I might sell it, as I might buy the card that I'd like to trade for.\r\n\r\nOtherwise, I'd like to know what you think it's worth.\r\n\r\nThanks.\r\n\r\nDoug",
      "post_time": "20211011T13:47:45-06:00",
      "timestamp": "1633981665"
    },
    {
      "post_id": "2153619",
      "post_title": "Update--",
      "post_author_name": "dougscats",
      "post_content": "I was looking to trade my Cobb for an E92 Wagner, which is no longer available for trade.  I'm not really looking to move it.\r\n\r\nI got three replies regarding it's value:\r\n\r\n1. [First evaluation was $3.5K] \"$4k might be a better guess since your card presents very well….\"\r\n\r\n2. \"I think overall it presents well, just need the right buyer who doesn’t mind the stamp. \r\n[Messenger 2 compared this Cobb to another at an attractive price, but I don't want to specify, not to identify him or give away his information].\r\n\r\n3. \"I'd say yours is at least 4000, maybe 4500 to the right buyer.\"\r\n\r\nI think those are all good estimates.  ButI do collect back-stamps myself, and I value it more than that.\r\nThe pointing finger is my favorite stamp, and to me the stamp adds to, not detracts from the value.  I fully realize that many collectors don't feel the same way.  So that's why I'm keeping it.\r\n\r\nI did get a couple of other pm's from people interested in buying/trading for  it.  I won't rule out selling it or trading it for a bigger/more desirable card.  But I likely over-value it.  As [3] above says, it would have to be to the right buyer.\r\n\r\nThanks for the interest and the input.",
      "post_time": "20211013T15:16:23-06:00",
      "timestamp": "1634159783"
    },
    {
      "post_id": "2156592",
      "post_title": "Email",
      "post_author_name": "Thromdog",
      "post_content": "Email sent",
      "post_time": "20211023T11:36:56-06:00",
      "timestamp": "1635010616"
    },
    {
      "post_id": "2156743",
      "post_title": "PM sent",
      "post_author_name": "westwin",
      "post_content": "PM sent",
      "post_time": "20211023T22:03:40-06:00",
      "timestamp": "1635048220"
    },
    {
      "post_id": "2156810",
      "post_title": "",
      "post_author_name": "Oscar_Stanage",
      "post_content": "considering common back 2s have and are selling up to $5k...I'd put a common back 1.5 in the low 3000s up to $4k.  I'd add a premium for Old Mill, so call it $4-5k.  A buyer will either care or not care about the stamp but it does not add anything IMO.",
      "post_time": "20211024T08:43:43-06:00",
      "timestamp": "1635086623"
    }
  ]
}