{
  "id": "173691",
  "forum_id": "39",
  "title": "See new thread above for same cards",
  "author": "z28jd",
  "reply_count": 22,
  "view_count": 2617,
  "created_date": null,
  "last_reply": "20130906T19:59:51-06:00",
  "posts": [
    {
      "post_id": "1167941",
      "post_title": "See new thread above for same cards",
      "post_author_name": "z28jd",
      "post_content": "See last post. This post was getting long and cluttered with scans of sold cards so I started a new thread",
      "post_time": "20130807T12:03:35-06:00",
      "timestamp": "1375898615"
    },
    {
      "post_id": "1167948",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "I also have these three redheads and a blue hair monster. I have no idea what these are worth, just know they are cool looking cards, especially the Wright which has the most excess ink. These aren't color shifts I'd say, they seem to have their hair colored in the background color for some reason. After seeing the scans, for some reason the Quillen barely shows, but the extra ink on his forehead is blue, trust me",
      "post_time": "20130807T12:18:37-06:00",
      "timestamp": "1375899517"
    },
    {
      "post_id": "1168114",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "....",
      "post_time": "20130807T17:11:55-06:00",
      "timestamp": "1375917115"
    },
    {
      "post_id": "1168149",
      "post_title": "Email sent",
      "post_author_name": "tedzan",
      "post_content": "Hi John\r\n\r\nI am interested in the Joe Doyle card.\r\n\r\nTED Z",
      "post_time": "20130807T18:41:51-06:00",
      "timestamp": "1375922511"
    },
    {
      "post_id": "1168292",
      "post_title": "",
      "post_author_name": "the 'stache",
      "post_content": "Hi John, \r\n\r\nI will take the Clyde Milan (if it's still available) if you will accept Paypal (friends and family is cool with me). Please PM me the total including shipping. \r\n\r\nThanks! \r\n\r\nBill",
      "post_time": "20130807T22:20:39-06:00",
      "timestamp": "1375935639"
    },
    {
      "post_id": "1169986",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "Cards added.",
      "post_time": "20130812T09:54:04-06:00",
      "timestamp": "1376322844"
    },
    {
      "post_id": "1169996",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "Adding a blurry/ghost hands Pattee. Cool card despite condition. \n Casey double eyes, two\n \n Conroy no lines in cap no lines had writing on back, someone started to erase",
      "post_time": "20130812T10:23:41-06:00",
      "timestamp": "1376324621"
    },
    {
      "post_id": "1170166",
      "post_title": "",
      "post_author_name": "the 'stache",
      "post_content": "John,\r\n\r\nGot my Milan in the mail today. It's a real beauty in person. Thank you, and good luck with the rest of your sales.\r\n\r\nBill",
      "post_time": "20130812T18:05:14-06:00",
      "timestamp": "1376352314"
    },
    {
      "post_id": "1170298",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "Glad to hear, Bill. Thanks!",
      "post_time": "20130812T23:24:22-06:00",
      "timestamp": "1376371462"
    },
    {
      "post_id": "1171040",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "everything for sale individually, make offers",
      "post_time": "20130814T15:57:31-06:00",
      "timestamp": "1376517451"
    },
    {
      "post_id": "1171828",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "All have fairly clean backs, Dubuc has a little bit of paper loss in spots but not horrible. Demmitt has wet sheet transfer of the grass on the back. Fairly clean group, Wright is a Polar Bear back, plus there are three of the tougher Sweet Cap 350/25 backs. everything for sale individually, make offers",
      "post_time": "20130816T09:43:48-06:00",
      "timestamp": "1376667828"
    },
    {
      "post_id": "1172203",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "The Bell and Mowrey have partial names up top. Five of them are SC 350/25 backs. The back of the Stovall is dirty, Cree has a little paper loss, others are fairly clean. Pickering and Wilhelm have slight color shifts, you can see the white background on the Wilhelm and Pickering has grey below the bottom border. everything for sale individually, make offers",
      "post_time": "20130817T10:07:47-06:00",
      "timestamp": "1376755667"
    },
    {
      "post_id": "1173040",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "The rest of the cards I have...85 in all and all are scanned here. Just make offers on anything, these new ones and the ones up top, will do better with multiple cards. We have some double names, printing errors, light ink, slight miscuts, hall of famers, everything above too. I'm looking to get $2275 for all 85 cards($27.05 each and many are $50+ cards), I'll drop the price by whatever one sells for, so I'll get $2300 whether it is as a group of individual. Ask questions, send PM's.  If someone buys the group, I have a few little extras to throw in for free, a copy of Heitman's monster, an old 1914 coupon, a 1971 issue of sports hobbyist with tons of t206 info\n\n   Of note, the Hinchman lot is real cool. One has a semi colon in the name, one has a red print line in the same spot, the other a blue print line, the last, a double name. That would be a nice group to keep together\n\n  The Doc White is bad shape has printing lines in the bottom right corner, yellow across bottom/ dark going down from corner\n\n  The Lobert is just a decent Lobert, no printing flaws\n\n   Ritchey has a strong Sweet Cap back on front, probably from storage problems, not factory, but it looks cool anyway\n\n  Clark has a print line across top, tougher SC 350/25 back\n \n  The three card group with Congalton, Seymour all have color shifts\n\n  The Brain and Ferguson have WST, along with extra ink on the McIntyre, so that is the three back scan\n\n  Rhodes as hand outside the border\n\n  Make offers, lets move these cards.\n\nOnly sold cards right now that are pictured are the Shaw and Steinfeldt up top, graded ones, took any other scans down to make it easier",
      "post_time": "20130819T10:33:53-06:00",
      "timestamp": "1376930033"
    },
    {
      "post_id": "1174030",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "Only cards gone are Lobert, Lake, Wright/PB, Bresnahan and also Happy Smith, which is on hold awaiting payment.",
      "post_time": "20130821T16:17:59-06:00",
      "timestamp": "1377123479"
    },
    {
      "post_id": "1175439",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "Bumping this nice assortment of cards, graded ones, low grade commons, HOF'ers, semi-tough backs, errors, miscuts, WST, printing flaws and color shifts, something for everyone.  I'm open to offers on everything and the more you take the better the deal.\r\n\r\n   I also have this still available, only got a couple offers on it and nothing big. Didn't want to bump both threads\r\n\r\n [url]http://www.net54baseball.com/showthread.php?t=174573[/url]",
      "post_time": "20130825T09:58:43-06:00",
      "timestamp": "1377446323"
    },
    {
      "post_id": "1175851",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "Okay, I'm starting something crazy now. I'm putting a $32 price tag on each card starting today. Each day there are cards left, the price goes down $1(after I change the price). Payment must be paypal gift and there is a one-time $4 shipping charge no matter if it's one card or eighty-one. Only card this doesn't apply to is the Camnitz in the link above. Any card listed here, HOF, printing error, miscut, tough back.\n\n  Obviously there are plenty of cards above worth more than $32 each(and ones worth less), so have at it. When the list of available cards gets smaller, I'll list what is left individually. Some people are going to get great deals today...It's first come, first serve and I check PM's on here first, so PM me please\n\n  Edited to add which cards are left:\n\n  graded: McEleveen, Jordan, Pastorius, Doolan EPDG, Lake, Hulswitt/Sov, Rossman, Lindaman\n  \n  ungraded:Oakes, White, Ritchey, Thomas(2) missing ink, Rhoades, Clark, Wiltse, Quillen, Beckley, Wright, Milligan, McIntyre, Ferguson, Brain, Malarkey, Merritt, Doolan/tolstoi, Stanage/EPDG, Hannifan, Schlei, Conroy(2) missing lines, Casey(2) both double eyes, Pattee, Stahl, Murray, Karger, Lennox, Murphy, Chase(2), Demmitt, Oldring, Downey, Atz, Dubuc, Bliss, Bowerman, Crandall, Wilhelm, Bell(2), Pickering, Stovall, Meyers, McElveen, Cree, Mowrey, Hemphill, Ganzel, Clymer, Doolin, Payne, McGlynn, McCormick, Willis, H. McIntyre/miscut reverse, Miller, Rucker, Hinchman x3 including the semi-colon version(a steal!), Seymour, Congalton, Kroh, Charles, Konetchy",
      "post_time": "20130826T08:54:51-06:00",
      "timestamp": "1377528891"
    },
    {
      "post_id": "1176841",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "See last post",
      "post_time": "20130828T08:16:28-06:00",
      "timestamp": "1377699388"
    },
    {
      "post_id": "1177885",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "See last post",
      "post_time": "20130830T09:09:41-06:00",
      "timestamp": "1377875381"
    },
    {
      "post_id": "1178747",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "Last post",
      "post_time": "20130901T12:16:52-06:00",
      "timestamp": "1378059412"
    },
    {
      "post_id": "1178985",
      "post_title": "",
      "post_author_name": "scottglevy",
      "post_content": "Will take the hinchman semi, ferguson wst and Thomas no red.  I think id like the back miscut as well but would appreciate a scan of that card. Pls send details to [url]scottglevy@yahoo.com[/url]\n\n\nBest\nScott",
      "post_time": "20130901T19:59:41-06:00",
      "timestamp": "1378087181"
    },
    {
      "post_id": "1179834",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "Updated the list after seven sold. There are still some great deals. Someone could have an EPDG and American Beauty card for $64 dlvd if they wanted. Can't beat that deal! I highlighted some of the better deals. All the scans are up top\r\n\r\ngraded: McEleveen, Jordan($20), Doolan EPDG, Lake($20), Hulswitt/Sov($25), Lindaman($25)\r\n\r\nungraded:Oakes, White, Ritchey, Thomas, Rhoades, Clark, Quillen, Wright($20), Milligan($20), Brain, Malarkey American Beauty, Merritt, Conroy missing lines, Casey(2) both double eyes, Stahl, Karger, Lennox, Murphy, Chase(2), Demmitt, Downey, Atz, Dubuc, Bliss, Bowerman, Wilhelm, Bell(2), Pickering, Stovall, Murray, Cree, Mowrey, Hemphill, Ganzel, Clymer, Doolin, Payne, McGlynn, McCormick($25), Willis($20), H. McIntyre/miscut reverse, Miller SL/miscut back($25), Rucker($25) miscut back, Hinchman(2), Congalton, Kroh, Charles, Konetchy",
      "post_time": "20130903T11:28:57-06:00",
      "timestamp": "1378229337"
    },
    {
      "post_id": "1180747",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "I added prices above:\r\n\r\n   Everything highlighted is $30\r\n   If it's not highlighted and doesn't have a price listed, it is $15\r\n\r\n   $4 shipping no matter how many you take, paypal gift/friend please.",
      "post_time": "20130905T10:00:58-06:00",
      "timestamp": "1378396858"
    },
    {
      "post_id": "1181476",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "New thread started, please go to that one for any questions. Cleaned up the scans so it's easier to see what is left.",
      "post_time": "20130906T19:59:51-06:00",
      "timestamp": "1378519191"
    }
  ]
}