{
  "id": "287744",
  "forum_id": "39",
  "title": "FS - Down sizing my Chicao Cubs T206 Collection",
  "author": "Rascal1010",
  "reply_count": 4,
  "view_count": 672,
  "created_date": null,
  "last_reply": "20200824T06:15:24-06:00",
  "posts": [
    {
      "post_id": "2010083",
      "post_title": "FS - Down sizing my Chicao Cubs T206 Collection",
      "post_author_name": "Rascal1010",
      "post_content": "After working on my collection of T206 Cubs for the last 7 years, I have decided to downsize my collection to focus more on other interests.  I'm not offering all of my Cubbies for sale, but have decided to offer a few mid-grade (most with tougher backs) for sale at this time.  For those that are interested I am offering a handful of rare Sweet Caporal factory 25 backs in this group, most of the ones listed are in the top 5 of their respective front/back combination for condition, a lot of these very rarely are available for purchase, and most of these factory 25's took years for me to find.  I am also offering an assortment of Cycle, Sovereign, Tolstoi & a beautiful Old Mill PSA 6.  \n      Here is a list of the cards I am offering at this time, I have attached a few scans but only have a few on my laptop right now, scans will be updated on Thursday afternoon and scans of all cards will be available at that time.  I will be sticking pretty firm to these prices, but will strongly consider offers involving multiple cards.  If you are seriously interested in any of these cards, please contact me and I will make sure to get you scans ASAP.  I will respond to emails in the order in which they are received.  Payment will be via Paypal Goods & Services and all cards will be shipped no charge via USPS insured Priority Mail.\n\n       For anyone putting together player Front/Back combinations I don't have to tell you how tough some of the front/back combinations on this list can be to locate.\n\n       Feel free to contact me with any questions via email [url]Asmusstephen@gmail.com[/url]. \n\nThanks,\nSteve\n \nG. Brown (Browne, Chicago) SC 150/25   PSA 4 Sale Pending\nM. Brown (Cubs on Shirt) SC 150/30  SGC 2 $ 250\nEvers (Chicago on Shirt) SC 460/30SGC 4 $ 450\nEvers (Cubs on Shirt)SC 150/30SGC 4 $ 600\nMcIntyre (Brooklyn & Chicago) SC 350/30   SGC 5.5 $165\nNeedhamSC 460/30 SGC5 $165\nOverall - Portrait SC 350/25   PSA 3 $200Rare 350/25 back, Extremely difficult to find\nReulbach - No Glove Showing SC 350/30   SGC 5 $ 165\nSchulte (Back View) SC 460/30   SGC 5$165",
      "post_time": "20200819T22:47:40-06:00",
      "timestamp": "1597898860"
    },
    {
      "post_id": "2010087",
      "post_title": "",
      "post_author_name": "mzljapan",
      "post_content": "Take m brown sc 350/25 Chicago for $480\n\n\nSent from my iPhone using Tapatalk",
      "post_time": "20200819T22:54:36-06:00",
      "timestamp": "1597899276"
    },
    {
      "post_id": "2010095",
      "post_title": "",
      "post_author_name": "ahumes13",
      "post_content": "Email sent",
      "post_time": "20200820T00:15:00-06:00",
      "timestamp": "1597904100"
    },
    {
      "post_id": "2010393",
      "post_title": "",
      "post_author_name": "Rascal1010",
      "post_content": "Updated with sold cards removed.  I think I got everyone scans that had requested them, if you did not hear back from me, please send me a PM or an email and I will get it taken care of.\r\n\r\nSteve",
      "post_time": "20200821T06:10:24-06:00",
      "timestamp": "1598011824"
    },
    {
      "post_id": "2011316",
      "post_title": "",
      "post_author_name": "Rascal1010",
      "post_content": "All sold cards have been removed updated 8/24.  Just a handful of cards left and only 2 factory 25's left out of this group.\r\n\r\nThanks to everyone who has purchased and looked at my cards this go around.\r\n\r\nSteve",
      "post_time": "20200824T06:15:24-06:00",
      "timestamp": "1598271324"
    }
  ]
}