{
  "id": "192332",
  "forum_id": "39",
  "title": "Have you seen any of these \"missing cards\"?",
  "author": "Howe’s Hunter",
  "reply_count": 16,
  "view_count": 1136,
  "created_date": null,
  "last_reply": "20150404T08:32:21-06:00",
  "posts": [
    {
      "post_id": "1309661",
      "post_title": "Have you seen any of these \"missing cards\"?",
      "post_author_name": "Howe’s Hunter",
      "post_content": "Just trying to keep my database updated on cards I know exist with Howe's stamp on the back, but have no idea where they are now. \r\n\r\nAlso on the list of missing and whereabouts unknown are the following, which I don't have scans for:\r\n\r\nAmes/Glove–Piedmont\r\nBirmingham–Piedmont\r\nCovaleski–Piedmont\r\nElberfeld/N.Y. Amer–Piedmont\r\nWarhop–Piedmont\r\nWillis/batting–Piedmont\r\n\r\nand a Cobb/green portrait/Piedmont that was in a GAI 30 holder about seven years ago. Would have come from a dealer in the New York area, who also attended shows in Canada. My guess is that card may have been freed from its GAI holder and now resides in something else.\r\n\r\nNot in a position to purchase/trade for any of these now, but just wanted to throw this on the board and see if I could track any of the missing 23.\r\n\r\nThanks to board members who have let me know they are the current owners of 10 others.\r\n\r\nThanks to all for help in my strange quest.\r\n\r\n[URL=http://s150.photobucket.com/user/T206ster/media/Group-shot-of-those-Ive-missed_zps91962d2c.gif.html][IMG]http://i150.photobucket.com/albums/s81/T206ster/Group-shot-of-those-Ive-missed_zps91962d2c.gif[/IMG][/URL]",
      "post_time": "20140813T11:09:45-06:00",
      "timestamp": "1407949785"
    },
    {
      "post_id": "1309683",
      "post_title": "",
      "post_author_name": "Jobu",
      "post_content": "Ed, your quest sounds fascinating. Can you please tell newer members, like myself, exactly what you are up to? Thanks.",
      "post_time": "20140813T12:15:37-06:00",
      "timestamp": "1407953737"
    },
    {
      "post_id": "1309703",
      "post_title": "Bryan, just trying to rebuild a dead guy's collection",
      "post_author_name": "Howe’s Hunter",
      "post_content": "Started in '91 or '92 when I got a card with the stamp on the back. 15 years later found another on eBay and bought it. Decided to sell the 200 or so t206s I had at the time to see how many I could find with this guys stamp on the back. \r\n\r\nFast forward to this week, I own 259 of them, plus the missing ones listed in this post. Have over time found he lived in a market/grocery owned by his father and uncle, was about 14 when the cards came out, was drafted in WWI, married, had a child, never left the Gainesville area and died in 1976. His daughter never married, had no children and died about 10 years later. He had moved from this address by 1925, so didn't collect after that point by all appearances. No idea how many cards he had at one time, how they were broken up, or when. But did find a couple pictures of him...\r\n\r\n[url]http://www.net54baseball.com/showthread.php?t=171365[/url]\r\n\r\nStill looking for all I can find and reunite. Guess I'll never know if I am finished or not.",
      "post_time": "20140813T13:05:06-06:00",
      "timestamp": "1407956706"
    },
    {
      "post_id": "1309733",
      "post_title": "",
      "post_author_name": "The Nasty Nati",
      "post_content": "In my opinion, Ed's got one of the coolest projects on this forum. It's truly fascinating. I almost feel when all things are said and done the cards with the documented photos and backstory could be in a museum.",
      "post_time": "20140813T14:05:45-06:00",
      "timestamp": "1407960345"
    },
    {
      "post_id": "1309753",
      "post_title": "",
      "post_author_name": "the 'stache",
      "post_content": "[quote name=\"The Nasty Nati\" post=1309733]In my opinion, Ed's got one of the coolest projects on this forum. It's truly fascinating. I almost feel when all things are said and done the cards with the documented photos and backstory could be in a museum.[/QUOTE]\r\n\r\nI agree it's one of the coolest projects on Net 54. For one reason, it's likely unique. There are a good deal of T206 collectors, but I'd be surprised if there were somebody else collecting them with this same stamp.\r\n\r\nI also like it because there doesn't seem to be any identifiable pattern to the stamps. It doesn't look like Howe was sticking to any one back or front combination. There are commons, Hall of Famers and Southern Leaguers. There's some variance in the card condition, and a good variety of backs. I love this collection. It's Ed's quest against the rest of the world to find stamps put on tobacco cards over 100 years ago. Just incredible.\r\n\r\nEd, have you ever found duplicates? Or thus far, has every single find been one more piece? Wouldn't it be incredible if this entire set existed with the stamp?",
      "post_time": "20140813T14:40:53-06:00",
      "timestamp": "1407962453"
    },
    {
      "post_id": "1309757",
      "post_title": "",
      "post_author_name": "Jobu",
      "post_content": "Wow Ed! Thank you for doing this - to me this is what collecting is all about. \r\n\r\nYour collection would fit right in at the Hall of Fame (who knows, maybe someday.....). \r\n\r\nYou now have one more soldier keeping his eyes peeled for you.\r\n\r\nBest of luck.",
      "post_time": "20140813T14:43:34-06:00",
      "timestamp": "1407962614"
    },
    {
      "post_id": "1309763",
      "post_title": "",
      "post_author_name": "Bpm0014",
      "post_content": "As stated before, one of the 2 coolest collections on this forum. The other being t206 Collector (who collects autographed t206s). I never tire of seeing pics of either one of these fascinating collections!",
      "post_time": "20140813T14:54:04-06:00",
      "timestamp": "1407963244"
    },
    {
      "post_id": "1309866",
      "post_title": "",
      "post_author_name": "Mountaineer1999",
      "post_content": "What a unique collection! As most T206 collectors do , I often wonder about the cards I get and their history. You've gone and unraveled a part of the history of these cards. Thanks for sharing the story Ed.",
      "post_time": "20140813T19:09:45-06:00",
      "timestamp": "1407978585"
    },
    {
      "post_id": "1309875",
      "post_title": "",
      "post_author_name": "Matvoo",
      "post_content": "Very interesting story and cards\nThank you for showing us",
      "post_time": "20140813T19:23:15-06:00",
      "timestamp": "1407979395"
    },
    {
      "post_id": "1310082",
      "post_title": "Thanks for the kind words",
      "post_author_name": "Howe’s Hunter",
      "post_content": "Having a few more eyes out there looking for these is helpful.\r\n\r\nAnd thanks to everyone on the board who has been so helpful in finding many of these. I owe a lot of people a lot of favors for all they've done for me.\r\n\r\nSomeday, I hope to actually get to meet Paul and perhaps see some of his collection autographed cards in person. His cards are truly amazing when you think that at some point and time in the last 100 years, the player on the card actually handled that card, signing it for a kid or collector. \r\n\r\nWe've shared emails back and forth, when he finds one of mine, and I think I've found one of his (but none I've found have ever panned out or even been authentic) but hope one day to help him add a card or two to his awesome collection.\r\n\r\nAgain, thanks everyone.",
      "post_time": "20140814T11:05:56-06:00",
      "timestamp": "1408035956"
    },
    {
      "post_id": "1310523",
      "post_title": "",
      "post_author_name": "BicycleSpokes",
      "post_content": "Ed awesome project.  I realized a few months back that I have randomly reunited 2 cards with a \"George R. Granger\" stamp, which I thought was so cool, even if on a small scale.",
      "post_time": "20140815T15:23:39-06:00",
      "timestamp": "1408137819"
    },
    {
      "post_id": "1396248",
      "post_title": "",
      "post_author_name": "polakoff",
      "post_content": "Ed,\r\n\r\nI sent you a PM but wanted you to be aware of this one\r\n\r\n[url]http://www.ebay.com/itm/T206-1909-Hindu-Cigarettes-Al-Burch-Brooklyn-Dodgers-H-McCormick-stamp-SGC-20-/331513712248?pt=LH_DefaultDomain_0&hash=item4d2fc1ce78[/url]",
      "post_time": "20150330T15:50:22-06:00",
      "timestamp": "1427752222"
    },
    {
      "post_id": "1396446",
      "post_title": "Just Wondering ....",
      "post_author_name": "ChiSoxFan",
      "post_content": "has the \"Howe McCormick\" stamp been found on any non T206 cards?\r\n\r\n\r\n\r\nJames",
      "post_time": "20150331T06:42:51-06:00",
      "timestamp": "1427805771"
    },
    {
      "post_id": "1396736",
      "post_title": "Ulric Howe McCormick",
      "post_author_name": "Dave1943",
      "post_content": "Hi Ed,\r\n\r\nThe following may be of help in your search for family:\r\n\r\n1900 Census lists:\r\nU Howe McCormich dob 31 Jul 1895\r\nfather as William McCormick, b Jan 1862 in Fla\r\nmother Agnes E, b Jan 1870 in England\r\nsister Caroline E, b Nov 1898\r\n\r\n1915 WWI Draft Card lists name as Ulric Howe McCormick\r\n\r\n1920 Census lists Howe and Thelma as married\r\n\r\n1930 census lists Howe, Thelma, and Betty\r\n\r\n1940 census lists Howe, Thelma, and Betty with Betty's dob approx. Oct 1929\r\n\r\nGood Luck with your project.\r\n\r\nRespectfully,\r\nDave",
      "post_time": "20150331T18:58:24-06:00",
      "timestamp": "1427849904"
    },
    {
      "post_id": "1397513",
      "post_title": "",
      "post_author_name": "Howe’s Hunter",
      "post_content": "James, I am aware of a total of six E98s that have Howe's stamp on them. I've seen photos of them from an individual who had two T206s with the stamp, but don't know what happened to any of those eight cards. I do know the person who had them back in 2009 no longer owns them, but he hasn't been able/doesn't want to share what happened, at least to the T206s I had been interested in.\r\n\r\nDave, thanks for the info. Through a different source than Ancestry.com, I have also found the grave marker for Howe and Thelma, he passing away in 76, and her five years later. I've not been able to find out anything else about Betty, as she doesn't show up on any census info that has been released yet, and there is a record of a death for a Betty McCormack (sp?) in '85 who was also born in 29. Guessing from that, she never married.\r\n\r\nStill lots of blanks in Howe's history. His sister appears to have married before 1930, but passed before 1940. No children listed for her, either. \r\n\r\nJust need to find that long lost, great great great nephew or niece who knows all the answers, and has a couple hundred more of Uncle Howe's cards that they are just willing to give away.\r\n\r\nThanks to everyone on the board for their support and help in trying to reassemble the collection.\r\n\r\nEd",
      "post_time": "20150402T21:27:26-06:00",
      "timestamp": "1428031646"
    },
    {
      "post_id": "1397702",
      "post_title": "",
      "post_author_name": "bigtrain",
      "post_content": "Looking forward to the Howe McCormick\r\nWagner turning up soon. Very cool. I love \r\nback stamps.",
      "post_time": "20150403T12:05:24-06:00",
      "timestamp": "1428084324"
    },
    {
      "post_id": "1397985",
      "post_title": "",
      "post_author_name": "Howe’s Hunter",
      "post_content": "Tom, my hope is that as rare as Piedmont backs are for Wagners and Planks, neither one exists. If they do, I'll add them to the data base under \"Those that exist that I'll never get my hands on\". If a Magie error exists, it would go on the same list. Luckily, since Howe's cards only come with Piedmont, Hindu and Old Mill backs, I don't have to worry about O'Hara and Demmitt. But if another blue Old Mill turns up with Howe's stamp on the back, well crap.",
      "post_time": "20150404T08:32:21-06:00",
      "timestamp": "1428157941"
    }
  ]
}