{
  "id": "330788",
  "forum_id": "39",
  "title": "T206s. No HOFers. All sold.",
  "author": "Brian Van Horn",
  "reply_count": 2,
  "view_count": 613,
  "created_date": null,
  "last_reply": "20230125T18:48:59-06:00",
  "posts": [
    {
      "post_id": "2308054",
      "post_title": "T206s. No HOFers. All sold.",
      "post_author_name": "Brian Van Horn",
      "post_content": "All sold.\r\n\r\n1909 T206 Arrelanes-two pinholes top center that are also evident on the back. Also, a stain upper left border, a black stain on throwing shoulder just inside the left border and a white scuff in the blue background to the right of upper glove arm-$40.00 (Sold)\r\n\r\n1909 T206 Camnitz (Throwing)-Black upper left background. On the back spots of paper loss including diagonally up to the right of \"B\" in \"BEAR\" and diagonally to the left just above the \"R\" in \"BEAR\". A larger scrap of paper loss is lower left below \"Scrap\" and there is a smaller spot of paper loss below the \"D\" and \"e\" in \"Designs\"-$40.00 (Sold)\r\n\r\n1909 McQuillan-red stain on the shoulder on the right of the card. The stain is also in the top center border and the center to the top of the right border-$40.00 (Sold)\r\n\r\n1909 T206 Mullin-crease across the center of the card. Also, stain top border and stain bottom left border under \"M\" and \"U\" in \"MULLIN\"-$40.00 (Sold)\r\n\r\n1909 T206 Smith (Buffalo)-vertical crease from the middle top border through the cap and ear and through the \"B\" in \"BUFFALO\" at the bottom of the card. Also, surface wear in the blue background in the upper right and staining along the right border-$40.00 (Sold)\r\n\r\n1909 T206 Willett (batting)-vertical crease the length of the middle of the card witha break in the red background to white above his head, a speck of paper loss beneath his his face and this crase goes trough his face and through the lip on the right side. The crease has a creek breakoff at his forearm and both creases go to the bottom border.There is also a diagonal crease from just below the mid-right border into just to the right of the bottom central border. Finally, staining just to the right of the top center border and a little staining lower right border-$40.00 (sold)\r\n\r\n1909 T206 Willetts (throwing)-crease from top right border almost into the second white line in his cap from the left. Two blue vertical marks in the orange background below the white part of his glove arm. There is also a crease from just above the middle part of his upper glove arm down to the \"I\" in \"WILLETTS\". In the bottom border there is a spot partially obscuring the \"S\" in \"WILLETTS\" and there is  a spot in the border to the right of the \"S\" in \"WILLETTS\". Finally, some corner wear-$40.00 (Sold)\r\n\r\nS/h is $5.00 unless you live in California, Oregon or the state of Washington. In the aforementioned states, the s/h is $5.50. If paying by PayPal, please pay by PayPal Gift/Friends and Family to [url]wizard15243@yahoo.com[/url].",
      "post_time": "20230125T16:00:26-06:00",
      "timestamp": "1674687626"
    },
    {
      "post_id": "2308056",
      "post_title": "",
      "post_author_name": "MatthewN",
      "post_content": "I’ll take Camnitz if available. Message sent. \n\nThanks!\n\n\nSent from my iPhone using Tapatalk",
      "post_time": "20230125T16:11:16-06:00",
      "timestamp": "1674688276"
    },
    {
      "post_id": "2308096",
      "post_title": "",
      "post_author_name": "RCFire82",
      "post_content": "Will take the Willett batting.",
      "post_time": "20230125T18:48:59-06:00",
      "timestamp": "1674697739"
    }
  ]
}