{
  "id": "189532",
  "forum_id": "39",
  "title": "Kiernan With Nothing In Common With Willis Who Has Been Sold",
  "author": "frankbmd",
  "reply_count": 2,
  "view_count": 386,
  "created_date": null,
  "last_reply": "20140621T06:40:50-06:00",
  "posts": [
    {
      "post_id": "1288136",
      "post_title": "Kiernan With Nothing In Common With Willis Who Has Been Sold",
      "post_author_name": "frankbmd",
      "post_content": "No, they are both dead, but that's not what I'm talking about.\r\n\r\nThey are both slabbed beaters.\r\n\r\nBeaters from the Southern Leagues and the Hall of Fame can be daunting and stretch the budget of bottom feeding beater grabbers.   Here's your chance.\r\n\r\nFirst, J F Kiernan, Columbia's finest, is offered in stunning PSA 1 condition.  Underneath the flaws the astute collector will note above average registration and centering.  In addition the Piedmont 350 back can still be read.  This card is offered for $40 shipped.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/t206-psa/10454/kiernan-sl[/IMG]\r\n\r\nSecond, Vic Willis, in his Pittsburgh portrait pose, is offered in GAI 1 condition.  Note that the wrinkles for the most part trend upward from left to right like a bull market.  Who knows maybe this card will appreciate in value as well. SOLD\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/t206-gai/10603/willis-portrait[/IMG]\r\n\r\n\r\nAll forms of payment are accepted and appreciated.  If you prefer reg PP instead of the no fee option, just add $1 per card.\r\n\r\nDon't worry about the packaging, for if these cards get damaged in shipping, you will never know it.:D:D  \r\n\r\nLets get this card out the door before the sun sets.;)\r\n\r\nThere has to be someone out there who needs to fill out their Southern Leagues set.",
      "post_time": "20140616T10:22:30-06:00",
      "timestamp": "1402935750"
    },
    {
      "post_id": "1288979",
      "post_title": "Come and Get 'Em",
      "post_author_name": "frankbmd",
      "post_content": "The sale is now open.  Pick up these doorbusters in the next 30 minutes for only $63.\n\n\nThe sale is over, but the cards are still available.  If you want a heads up on the next sale price, send me a PM.",
      "post_time": "20140618T17:59:57-06:00",
      "timestamp": "1403135997"
    },
    {
      "post_id": "1289812",
      "post_title": "",
      "post_author_name": "frankbmd",
      "post_content": "Guess what.   Willis has been sold.  Only Kiernan remains.",
      "post_time": "20140621T06:40:50-06:00",
      "timestamp": "1403354450"
    }
  ]
}