{
  "id": "208468",
  "forum_id": "39",
  "title": "Rebel Yell - Southern Leaguers Sobering Up - 1 Remains",
  "author": "frankbmd",
  "reply_count": 5,
  "view_count": 485,
  "created_date": null,
  "last_reply": "20150710T14:44:02-06:00",
  "posts": [
    {
      "post_id": "1429146",
      "post_title": "Rebel Yell - Southern Leaguers Sobering Up - 1 Remains",
      "post_author_name": "frankbmd",
      "post_content": "[IMG]http://www.collectorfocus.com/images/show/frankbmd/z-folder/29940/rebel-yell[/IMG]\r\n\r\nYup, the boys were drinking last night and one thing led to another.  i really don't know all the issues, whether it is just the bitter Wisconsin winters or the flap about the confederate flag, but when I got up this morning this foursome wanted out, and I'm not talking about a tee time either.  Since the majority of you cardboard renegades live south of here, so I'm going to open the door and let these boys hit the road.\r\n\r\n1.  Carlos Smith originally from Shreveport drives an SGC 30 holder with an Old Mill Southern League trunk and seems to be the ringleader, and he got away.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/t206-sgc/10313/smith-c-sl[/IMG]\r\n\r\n2. With Carlos, riding shotgun, originally from Nashville is Hub Perdue.  Hub would probably fit nicely in an SGC 40 roadster with a Piedmont trunk, but is currently without wheels although he does have a Hub cap as shown, and he got away.\r\n\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10800/perdue-sl[/IMG]\r\n\r\n3. In the back up car Al Orth originally from Lynchberg drives an SGC 40 automatic with a Piedmont flag.  He is armed with a heater, but no curve.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/23473/orth-sl[/IMG]\r\n\r\n4. And the tail gunner with Al is Scoops Carey from Memphis.  Scoops' Old Mill fender has a few dings but don't let that fool you.  He's ready for the road trip and determined to raise hell wherever he goes and he got away.  Watch out.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10965/carey-omsl[/IMG]\r\n\r\nNow here's the kick.  They have no gas and need your help.  Actually I need your help because they are holding me hostage.  Perhaps this will change when they sober up, but for now they are demanding a ransom of $250 for my release.  I can only imagine what they might do, if they get a hold of another bottle of that Rebel Yell.  \r\n\r\nI can try to deal with them individually and am willing to do so, but only via a secure PM.  I will wait 24 hours before considering individual sales.  If you want to make an offer privately before then you could secure your place in line.  If you want individual pricing from me, stay tuned tomorrow.  i want to give the night shift on 54 a shot at the whole gang.  You wont find me in the saloon this evening either.  Splitting up this gang of four could get dicey, but any help you can offer is sincerely appreciated.",
      "post_time": "20150709T07:16:01-06:00",
      "timestamp": "1436447761"
    },
    {
      "post_id": "1429236",
      "post_title": "",
      "post_author_name": "wazoo",
      "post_content": "I live for these kind of posts. Good luck with the sale...eh hostage crisis.",
      "post_time": "20150709T11:07:22-06:00",
      "timestamp": "1436461642"
    },
    {
      "post_id": "1429242",
      "post_title": "",
      "post_author_name": "mybuddyinc",
      "post_content": "PM sent, although I'm more of a Wild Turkey guy :rolleyes:",
      "post_time": "20150709T11:15:33-06:00",
      "timestamp": "1436462133"
    },
    {
      "post_id": "1429272",
      "post_title": "It's funny",
      "post_author_name": "Stetson_1883",
      "post_content": "I saw the subject titled \"Rebel Yell\" and somehow I knew it was created by frankmd....love it!",
      "post_time": "20150709T12:02:29-06:00",
      "timestamp": "1436464949"
    },
    {
      "post_id": "1429312",
      "post_title": "",
      "post_author_name": "Joshwesley",
      "post_content": "Lol\r\nMy favorite posts on the board!",
      "post_time": "20150709T13:09:34-06:00",
      "timestamp": "1436468974"
    },
    {
      "post_id": "1429679",
      "post_title": "",
      "post_author_name": "frankbmd",
      "post_content": "Carlos and Hub appear to have left the area.  No sign of them or their car.\r\n\r\nAl and Scoops are still available.\r\n\r\n$75 for Al\r\n\r\n$45 for Scoops\r\n\r\nOr $110 for the pair.\r\n\r\nOnce they are gone, life can get back to normal.;)",
      "post_time": "20150710T14:44:02-06:00",
      "timestamp": "1436561042"
    }
  ]
}