{
  "id": "276419",
  "forum_id": "39",
  "title": "FS: T206 Piedmont Ty Cobb (Bat-On) SGC 3",
  "author": "robw1959",
  "reply_count": 3,
  "view_count": 627,
  "created_date": null,
  "last_reply": "20191130T10:15:01-06:00",
  "posts": [
    {
      "post_id": "1934910",
      "post_title": "FS: T206 Piedmont Ty Cobb (Bat-On) SGC 3",
      "post_author_name": "robw1959",
      "post_content": "My scanner doesn't deliver super clarity on graded cards, but there are no creases or other issues that aren't visible in the scans. Asking $3000 delivered, PayPal preferred, and I will cover shipping. \n\nSuccessful transactions with: Sean1125, 39special, Ericc22, asoriano, Econteachert205, oldcardboard, tolstoi, Jobu, simas7173, espomario, jmb, Charlie Faust III, Paul S, quitcrab, avalanche2006, Beatles Guy, Banjo, tjenkins, botn, trdcrdkid, jtschantz, longstreet766, greenmonster66, edjs, jb67, rhotchkiss, Puckettfan, mybuddyinc, frankbmd, Baseball*Collections, btcarfagno, vintageonlybb, bigfish, Luke, t206collector, marvymelvin, benginino9, bigedmachine, Stampsfan, Moonlight Graham, Rebublicaninmass, Gradedcardman, Tigerden, Smanzari, clydepepper, Scott L., Brian Van Horn, t206kid, Stampsfan, t206whiteborder, polakoff, GoCubsGo32, Hxcmilkshake",
      "post_time": "20191129T16:04:34-06:00",
      "timestamp": "1575068674"
    },
    {
      "post_id": "1934914",
      "post_title": "",
      "post_author_name": "Jstottlemire1",
      "post_content": "Beautiful card.  Glws.  I’m saving to pick this card up next year.   Thanks for sharing.",
      "post_time": "20191129T16:22:57-06:00",
      "timestamp": "1575069777"
    },
    {
      "post_id": "1934948",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "Sounds good. I can wait until January if you need the time to save up. Thanks.",
      "post_time": "20191129T19:27:59-06:00",
      "timestamp": "1575080879"
    },
    {
      "post_id": "1935022",
      "post_title": "",
      "post_author_name": "Jstottlemire1",
      "post_content": "Thanks sir. PM sent.",
      "post_time": "20191130T10:15:01-06:00",
      "timestamp": "1575134101"
    }
  ]
}