{
  "id": "337657",
  "forum_id": "39",
  "title": "WTT -Downgrading Perdue and Schaefer Washington from PSA 3/3.5 to PSA 2",
  "author": "trambo",
  "reply_count": 2,
  "view_count": 295,
  "created_date": null,
  "last_reply": "20230715T19:29:37-06:00",
  "posts": [
    {
      "post_id": "2354696",
      "post_title": "WTT -Downgrading Perdue and Schaefer Washington from PSA 3/3.5 to PSA 2",
      "post_author_name": "trambo",
      "post_content": "In what I hope will be the conclusion of a 520 all PSA 2 set w/no qualifiers, I have a trade request for the group.\r\n\r\n\r\nI will have a Hub Perdue P350 PSA 3 and Germany Schaefer (Washington) PSA 3.5 later this week.  I am working on an all PSA 2 set and would like to find copies of these and would like to trade my higher grade for your PSA 2.  \r\n\r\nI'm not that concerned about the back of either so having a P350 Perdue versus an Old Mill doesn't matter.  \r\n\r\nThe deal for either or both should be your PSA 2 with no qualfiers and some amount of cash (guessing on your side of fair) for the upgrade.  These most likely will put 519 and 520 in a PSA 2 slab so you're assisting in completing the project!\r\n\r\nIf you can help, please reply and/or send a PM.  The cards were mailed today (7/10) so I should have them Wednesday or Thursday and can provide scans when they arrive.  \r\n\r\nThanks in advance and do PM if you have either a Perdue or Schaefer (Washington) PSA 2 w/no qualifiers you want to upgrade!\r\n\r\nTRambo",
      "post_time": "20230710T10:08:10-06:00",
      "timestamp": "1689005290"
    },
    {
      "post_id": "2354735",
      "post_title": "",
      "post_author_name": "Kidnapped18",
      "post_content": "Good luck Troy!!\n\nHope you get the 520 PSA 2 soon!",
      "post_time": "20230710T12:28:02-06:00",
      "timestamp": "1689013682"
    },
    {
      "post_id": "2356056",
      "post_title": "",
      "post_author_name": "trambo",
      "post_content": "Card scans added.  If can help me out, I'd really appreciate it!  Just need a PSA 2 in each and these are available.  Happy to buy if you would prefer not to trade, too.  \r\n\r\nPM to discuss.\r\n\r\nThanks!!",
      "post_time": "20230715T19:29:37-06:00",
      "timestamp": "1689470977"
    }
  ]
}