{
  "id": "304039",
  "forum_id": "39",
  "title": "FS: T206 Ty Cobb (Bat Off Shoulder) SGC 50",
  "author": "robw1959",
  "reply_count": 6,
  "view_count": 1127,
  "created_date": null,
  "last_reply": "20210816T22:56:32-06:00",
  "posts": [
    {
      "post_id": "2116689",
      "post_title": "FS: T206 Ty Cobb (Bat Off Shoulder) SGC 50",
      "post_author_name": "robw1959",
      "post_content": "This is a solid 4, and certainly better than any of the PSA 4 examples of Cobb that have sold recently - in the last six months - for as much as $14000+ on eBay. No creases, stains, or scuffs; clean front and back with decent centering on both sides. I do think it would crossover to a PSA 4, but in any case it is very solid as is. Asking net $12000 shipped, PayPal preferred.\r\n\r\nSuccessful transactions with: Sean1125, 39special, Ericc22, asoriano, Econteachert205, oldcardboard, tolstoi, Jobu, simas7173, espomario, jmb, Charlie Faust III, Paul S, quitcrab, avalanche2006, Beatles Guy, Banjo, tjenkins, botn, trdcrdkid, jtschantz, longstreet766, greenmonster66, edjs, jb67, rhotchkiss, Puckettfan, mybuddyinc, frankbmd, Baseball*Collections, btcarfagno, Luke, vintageonlybb, bigfish, t206collector, marvymelvin, benginino9, bigedmachine, Stampsfan, Moonlight Graham, Rebublicaninmass, Gradedcardman, Tigerden, Smanzari, t206kid, clydepepper, Scott L., Brian Van Horn, t206whiteborder, polakoff, GoCubsGo32, Hxcmilkshake, Scott Garner, Goudey77, rdixon1208, Pat R, Bram99, bks14sr, Haybag, charlietheexterminator, fusorcruiser, Mutton Chap Yaz, ncinin, rootsearcher60, GoldenAge50s, thecomebacker, Kryksir, T206.org, seattlebaseball, banksfan14, slantycouch, forceplay sport, niembre, nickers, Kris19, bounce, aloondilana, lrush, fusorcruiser, cardsagain74, aronbenabe, JollyElm, Charger74, Cooper1972, ainmon, Gorditadogg, AWGreen, chadeast, ahumes13, dhicks67, mikemcgrail, DHogan, chrisn28, Frankish, bigfish, Donscards, hcv123",
      "post_time": "20210624T21:39:09-06:00",
      "timestamp": "1624592349"
    },
    {
      "post_id": "2119091",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "The most colorful of the (4) Cobbs . . .",
      "post_time": "20210701T22:03:58-06:00",
      "timestamp": "1625198638"
    },
    {
      "post_id": "2119147",
      "post_title": "",
      "post_author_name": "brianclat11",
      "post_content": "Great card Rob! I wish it was in the budget for me right now.",
      "post_time": "20210702T06:53:03-06:00",
      "timestamp": "1625230383"
    },
    {
      "post_id": "2119202",
      "post_title": "",
      "post_author_name": "tnosmoothly",
      "post_content": "nice card! good luck with the sale.",
      "post_time": "20210702T10:05:43-06:00",
      "timestamp": "1625241943"
    },
    {
      "post_id": "2120875",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "Thanks.",
      "post_time": "20210707T11:46:53-06:00",
      "timestamp": "1625680013"
    },
    {
      "post_id": "2129393",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "Still available . . .",
      "post_time": "20210802T09:46:19-06:00",
      "timestamp": "1627919179"
    },
    {
      "post_id": "2134740",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "Available . . .",
      "post_time": "20210816T22:56:32-06:00",
      "timestamp": "1629176192"
    }
  ]
}