{
  "id": "312873",
  "forum_id": "39",
  "title": "LTS: Large raw lot (from Canada)",
  "author": "Panatha",
  "reply_count": 6,
  "view_count": 640,
  "created_date": null,
  "last_reply": "20220101T09:06:01-06:00",
  "posts": [
    {
      "post_id": "2180537",
      "post_title": "LTS: Large raw lot (from Canada)",
      "post_author_name": "Panatha",
      "post_content": "Hi all, I am hoping someone on this forum has experience selling (or having transacted) from Canada to the US.  \r\n\r\nI have am located in Toronto and have a large lot of raw T206. Mostly great eye appeal cards (very few rough ones). I need to take a closer look but, I think its about 270 cards in total of which there are about 30 HOF cards (none are the big boys).  Before I make the formal post to sell, with the full list and scans), I was wondering if anyone can provide me some insight on some of the logistics on selling from Canada to the US. More so from a tax/duties standpoint and insurance.  \r\n\r\nFrom my understanding, for me to insure the package, I would need to declare that same value I used for insurance to customs as well. If this is the case, that tax/duties that would need to be paid would be significant.\r\n\r\nCan anyone provide some insight on this or the process?  I will be making the post in the new year. \r\n\r\nfor context, I have never sold anything and shipped to the states, so this is all very new to me. Any advice is appreciated.",
      "post_time": "20211231T10:31:44-06:00",
      "timestamp": "1640971904"
    },
    {
      "post_id": "2180777",
      "post_title": "",
      "post_author_name": "skelly423",
      "post_content": "I live in Canada (and may be interested if the price and pictures are right).  When shipping to the US, as I understand it, import prices are paid by the purchaser and are based on the declared value of the cards.  You can artificially declare the value to be less than the actual value, but that will limit your insurance coverage if the package is lost.  It is also considered mail fraud, so you do it at your own peril.  I usually ship at full declared value, with full insurance coverage.  It is more expensive, but it’s the only guarantee you are protected.  You will pay postage based on the declared value, amount of insurance, and size/weight of the package. That can be costly too, but there’s no good way to avoid it\r\n\r\nYou also need to give consideration to your choice of shipper.  Since COVID hit, getting packages across the border in a timely fashion has been extremely difficult.  I’ve had a few packages with basic traffic take over a month to arrive (and one never did arrive). You’ll probably want to pay a bit extra to get expedited shipping, priority mail or a courier service).  It reduces the timelines, and gives you some proof of delivery in the event of a dispute.  \r\n\r\nUltimately the amount you pay depends on the value of what you’re shipping, and the risk you are comfortable assuming.  I can’t give you a flat cost estimate, but you’ve got the basics to weigh into your calculations.   \r\n\r\nNow just let me know what you’re selling…:)",
      "post_time": "20220101T05:54:27-06:00",
      "timestamp": "1641041667"
    },
    {
      "post_id": "2180786",
      "post_title": "",
      "post_author_name": "scottglevy",
      "post_content": "The other thing to consider is for a significant sized sale - which yours appears to be - many buyers may be willing to physically take the trip and make the transaction to avoid all the pitfalls discussed above.",
      "post_time": "20220101T06:33:58-06:00",
      "timestamp": "1641044038"
    },
    {
      "post_id": "2180799",
      "post_title": "",
      "post_author_name": "bbcard1",
      "post_content": "[quote name=\"scottglevy\" post=2180786]The other thing to consider is for a significant sized sale - which yours appears to be - many buyers may be willing to physically take the trip and make the transaction to avoid all the pitfalls discussed above.[/QUOTE]\r\n\r\nI was going to say the same, but technically, I think you would be a baseball card mule.",
      "post_time": "20220101T07:20:43-06:00",
      "timestamp": "1641046843"
    },
    {
      "post_id": "2180811",
      "post_title": "",
      "post_author_name": "maniac_73",
      "post_content": "[quote name=\"Panatha\" post=2180537]Hi all, I am hoping someone on this forum has experience selling (or having transacted) from Canada to the US.  \n\nI have am located in Toronto and have a large lot of raw T206. Mostly great eye appeal cards (very few rough ones). I need to take a closer look but, I think its about 270 cards in total of which there are about 30 HOF cards (none are the big boys).  Before I make the formal post to sell, with the full list and scans), I was wondering if anyone can provide me some insight on some of the logistics on selling from Canada to the US. More so from a tax/duties standpoint and insurance.  \n\nFrom my understanding, for me to insure the package, I would need to declare that same value I used for insurance to customs as well. If this is the case, that tax/duties that would need to be paid would be significant.\n\nCan anyone provide some insight on this or the process?  I will be making the post in the new year. \n\nfor context, I have never sold anything and shipped to the states, so this is all very new to me. Any advice is appreciated.[/QUOTE]\n\n\nI live in Oakville and may be interested in some or all of what you have. DM me with more info or if you would like to discuss further. I could do local pickup so it saves the shipping logistics\n\n\nSent from my iPhone using Tapatalk",
      "post_time": "20220101T07:48:45-06:00",
      "timestamp": "1641048525"
    },
    {
      "post_id": "2180835",
      "post_title": "LTS: Large raw lot (from Canada)",
      "post_author_name": "Panatha",
      "post_content": "I have received a ton of messages (I have not been able to get back to everyone - give me some time). I have received some very helpful information as well. \r\n\r\nIn the next day or two I will have the scans and card list available and will post as a new thread here. I will also reply back to all those who have inquired as well.  Happy new year everyone!\r\n\r\nAK",
      "post_time": "20220101T09:05:17-06:00",
      "timestamp": "1641053117"
    },
    {
      "post_id": "2180836",
      "post_title": "",
      "post_author_name": "scottglevy",
      "post_content": "[quote name=\"bbcard1\" post=2180799]I was going to say the same, but technically, I think you would be a baseball card mule.[/QUOTE]\n\nHa!  Never thought of it that way … but I suppose that’s a fair point.  Please disregard my previous post as I would recommend against doing just this.",
      "post_time": "20220101T09:06:01-06:00",
      "timestamp": "1641053161"
    }
  ]
}