{
  "id": "251675",
  "forum_id": "39",
  "title": "Sold",
  "author": "david_l",
  "reply_count": 6,
  "view_count": 605,
  "created_date": null,
  "last_reply": "20180301T11:21:48-06:00",
  "posts": [
    {
      "post_id": "1750629",
      "post_title": "Sold",
      "post_author_name": "david_l",
      "post_content": "Sold\r\n\r\n\r\nGreetings Friends,\r\n\r\nI'm a low-end T206 set builder. I recently came into possession of this Tolstoi Slagle. I know it's in rough shape but I was curious if anybody wanted to trade a non-rare back T206 for it. Ideally I'd trade it for a beater T206 HoF(s) but I may be open to a few cards or something else. Slabbed cards will get cracked upon arrival at my house. \r\n\r\nI have lots of good trader references that I can point you to even though I don't post much here. I'm also a member of OBC.\r\n\r\nWe can work out details of a trade. I'm willing to sell for $45 shipped.\r\n\r\nBelow is my list of cards that I have.\r\n\r\n-David \r\n\r\n[IMG]https://2.bp.blogspot.com/-HqEK3RxcssE/WpAtT9QBbiI/AAAAAAAABfQ/D490BrDKPqMne41WCOLxk9-YGX4GkjTTACLcBGAs/s1600/IMG_1986.JPG[/IMG]\r\n\r\n[IMG]https://4.bp.blogspot.com/-7worKSaQrno/WpAtT3VuHbI/AAAAAAAABfM/tHVZ6hEA7jMzy5C-EjgpOts-zG8gCe_2ACLcBGAs/s1600/IMG_1987.JPG[/IMG]\r\n\r\n\r\n[IMG]https://1.bp.blogspot.com/-XTuZXTd8luU/WpAtT_p6wNI/AAAAAAAABfU/S7up7goZ7XA0RIzDc6G0BiJnGshSi2aNwCLcBGAs/s1600/IMG_1988.JPG[/IMG]\r\n\r\n[IMG]https://2.bp.blogspot.com/-7V6D3Xksf1E/WpAtUOKHYQI/AAAAAAAABfc/JieAECFhiKcQMiaO7SA73-9F7xc-sqnHACLcBGAs/s1600/IMG_1989.JPG[/IMG]\r\n\r\nHave: Abbaticchio (brown), Abbott, Ames (hands above head), Anderson, Armbruster, Ball (Cle.), Barbereau, Barry (Mil.), Bastian, Batch, Beck, Becker, Bergen (w/ glove), Bescher (Portrait), Bradley (with bat), Bransfield, Geo. Brown (Wash.), M. Brown (portrait), M. Brown (Chicago on shirt), Burchell, Cicotte, Clark (Columbus), Clymer, Cobb (portrait green), Covaleski, Cravath, Cree,  Criger, Cross, H. Davis (Phil. throwing), H. Davis (Phil. Catching), Delehanty (Wash.), Devlin, Donlin (w/ bat), Donlin (fielding), Donlin (sitting), Donovan (portrait), Doolan (fielding), Dorner, Downey (fielding), Doyle (portrait), Dubuc, Dunn (Balt.), Dunn (Brooklyn), Egan, Ewing, Evans, Flanagan, Flick, Freeman, Fromme, Gandil, Ganley, Ganzel, Gasper, Gibson, Gilbert, Graham (StL), Hallman, Hannifan, Herzog (NY Nat'l), Hinchman (Cle), Hinchman (Tol.), Hofman, D. Hoffman (St. L), Howard (batting), Huggins (hands), Isbell, Jacklitsch, Jackson (Balt.), F. Jones (Chi. Portrait), F. Jones (Standing), T. Jones (St. L), Tim Jordan (Portrait), Joss (portrait), Kelley, Killian (Portrait), Kissinger, Knight (with bat), Knight (portrait), Konethcy (glove high), Kroh, Lake (ball in hand), Latham, Lattimore, Lavender, Leach (bending), Leach (portrait), Lord, Magee (batting), Marquard (throwing), McAleese, Mcbride, McGann, Mcginley, McGraw (finger in air), McQuillan (fielding), Merkle (throwing), Milan, D. Miller (Pitt), M. Miller (Dallas),  Mitchell (Cincy), Moeller, Mowrey, Murray (portrait), Nichols (batting), Oakes, Oldring (batting), Oldring (fielding), O'Leary (hands on knees), , O'Leary (portrait), Parent, Paskert, Pastorius, Pattee, Pfeffer, Phelps, Phillippe, Pickering, Quinn, Randall, Raymond, Ritchey, Ritter, Rucker (throwing), Rudolph, Schirm, Schlei (batting), Schreck, Seitz, C. Seymour (batting), Shaw (St. Louis), Shipke, F. Smith (dark hat), Spade, Stahl (no glove), Starr, Stone, Stovall (portrait), Strang,  Sullivan, Summers, J. Sweeney (NY Amer.), Tannehill (Tannehill on front), Tenney, Thomas, Wallace, Walsh*, Wilhelm (bat), Wilhelm (chest), Willets, C. Young (glove), I. Young.",
      "post_time": "20180223T08:10:46-06:00",
      "timestamp": "1519398646"
    },
    {
      "post_id": "1750733",
      "post_title": "",
      "post_author_name": "Pat R",
      "post_content": "Hi David,\r\n\r\nI would trade this McGinnity for the Slagle if you're interested.\r\n\r\nPatrick\r\n\r\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=306424&d=1519416652[/IMG]",
      "post_time": "20180223T13:12:02-06:00",
      "timestamp": "1519416722"
    },
    {
      "post_id": "1750906",
      "post_title": "",
      "post_author_name": "david_l",
      "post_content": "Response sent. Thanks so much. Still available.",
      "post_time": "20180224T05:23:13-06:00",
      "timestamp": "1519474993"
    },
    {
      "post_id": "1752608",
      "post_title": "",
      "post_author_name": "david_l",
      "post_content": "Still have my eye out for a trade or sale. Looking for a low condition second tier HoFer or maybe a third tier HoFer and a small throw in. I don't mind trimmers, chewers, scrapped backs, etc. I may also be willing to trade for a few commons in lower grade.",
      "post_time": "20180228T09:02:35-06:00",
      "timestamp": "1519833755"
    },
    {
      "post_id": "1752769",
      "post_title": "Slagle",
      "post_author_name": "OldOriole",
      "post_content": "PM sent.",
      "post_time": "20180228T17:23:20-06:00",
      "timestamp": "1519863800"
    },
    {
      "post_id": "1752895",
      "post_title": "",
      "post_author_name": "david_l",
      "post_content": "Nothing in my inbox from you..",
      "post_time": "20180301T06:25:17-06:00",
      "timestamp": "1519910717"
    },
    {
      "post_id": "1752991",
      "post_title": "T206",
      "post_author_name": "OldOriole",
      "post_content": "I just tried PMing you again.  Please let me know if you don't get it.  Thanks, Dave",
      "post_time": "20180301T11:21:48-06:00",
      "timestamp": "1519928508"
    }
  ]
}