{
  "id": "273637",
  "forum_id": "39",
  "title": "6x T206 Cards - Moving Out",
  "author": "timber09",
  "reply_count": 2,
  "view_count": 583,
  "created_date": null,
  "last_reply": "20190919T09:54:59-06:00",
  "posts": [
    {
      "post_id": "1917280",
      "post_title": "6x T206 Cards - Moving Out",
      "post_author_name": "timber09",
      "post_content": "Picked these up awhile back - not really in my wheelhouse so hopefully moving them to their new forever homes.\n\nI am pretty new here but have been collection for decades and have had thousands of positive easy transactions online.  Happy to share ebay info or give anything else that would make you more comfortable dealing with a newbie.  \n\n$3.50 for shipping regardless of number of cards purchased - will come in soft sleeve, top loader, added packaging, team bag and bubble mailer - will provide tracking number once the package goes out (most should go out within 24 hours of payment).\n\nAgain - these are not my wheelhouse so feel free to let me know if I am missing the mark with pricing or if you need any further information.\n\nThanks!\n\nSweet Caporal Hunky Shaw - $GONE\nPiedmont George Bell - $GONE\nPiedmont Owen Wilson - $GONE\nPiedmont Mike Mowrey - $25\nPiedmont Fred Snodgrass - $35\nPiedmont Jimmy Phelan - $GONE\nNote - I think the photos do a fair job of showing the flaws in each card pretty well but let me know if you want more information.  The Phelan is a tough one as there is a substantial rip that nearly splits the card - it is in one piece but top folds over pretty easily if not stored properly. You can see where the rip starts on the back and comes down through his ear/face on the front.",
      "post_time": "20190916T14:46:04-06:00",
      "timestamp": "1568666764"
    },
    {
      "post_id": "1917299",
      "post_title": "",
      "post_author_name": "blametony",
      "post_content": "I'll take Bell and Wilson.",
      "post_time": "20190916T16:12:11-06:00",
      "timestamp": "1568671931"
    },
    {
      "post_id": "1917935",
      "post_title": "",
      "post_author_name": "timber09",
      "post_content": "Two cards left from the original listing - one more that I forgot to add...\r\n\r\nPiedmont Dick Hoblitzell - $22\r\n\r\nThank you!\r\nJoe",
      "post_time": "20190919T09:54:59-06:00",
      "timestamp": "1568908499"
    }
  ]
}