{
  "id": "179112",
  "forum_id": "39",
  "title": "anybody got low grade Ray Ryans",
  "author": "bbcard1",
  "reply_count": 4,
  "view_count": 250,
  "created_date": null,
  "last_reply": "20131122T21:03:34-06:00",
  "posts": [
    {
      "post_id": "1209191",
      "post_title": "anybody got low grade Ray Ryans",
      "post_author_name": "bbcard1",
      "post_content": "you're willing to sell inexpensively or donate to a good cause?  We have gotten Ray inducted into the local baseball hall of fame.  Many of his descendants are coming to town in February for his induction. The family only has two or three of his T206s among them and I'd like to have a couple more to give those who make the trip to the hall of fame dinner (Salem Roanoke baseball hall of fame) in February. \r\n\r\nI'm going to do a story on it...will be glad to post it when it comes out.",
      "post_time": "20131121T20:47:24-06:00",
      "timestamp": "1385092044"
    },
    {
      "post_id": "1209533",
      "post_title": "",
      "post_author_name": "jlehma13",
      "post_content": "That's really neat.  I'm without a Ryan as I haven't come across one within my budget but I hope you have some luck.  Looking forward to your write-up in Feb.",
      "post_time": "20131122T19:30:07-06:00",
      "timestamp": "1385173807"
    },
    {
      "post_id": "1209542",
      "post_title": "",
      "post_author_name": "bbcard1",
      "post_content": "I write in a monthly sports magazine...usually high school stuff and whatnot, but now and then I venture into baseball cards.  Once month when I was particularly dry on content, I did an article on baseball players in the T206 set who had some connection to Southwest Virginia.  I made off hand remark that both Ray Ryan and Shag should be inducted into the local baseball hall of fame.  I got a call from his granddaughter asking what the procedure was and we got him nominated and now quite a few of the Ryan family will be coming to the Star City for his induction.",
      "post_time": "20131122T19:44:41-06:00",
      "timestamp": "1385174681"
    },
    {
      "post_id": "1209555",
      "post_title": "",
      "post_author_name": "jlehma13",
      "post_content": "That is so cool.  Well done.  If I find a Ryan, it's yours to pass along.",
      "post_time": "20131122T20:26:25-06:00",
      "timestamp": "1385177185"
    },
    {
      "post_id": "1209567",
      "post_title": "",
      "post_author_name": "Vol",
      "post_content": "[quote name=\"jlehma13\" post=1209555]That is so cool.  Well done.  If I find a Ryan, it's yours to pass along.[/QUOTE]\r\n\r\nAgree. That is very cool.\r\n\r\nPlease let us know how it goes and where to read a write up of the event.",
      "post_time": "20131122T21:03:34-06:00",
      "timestamp": "1385179414"
    }
  ]
}