{
  "id": "191899",
  "forum_id": "39",
  "title": "Wtb",
  "author": "Conner161822",
  "reply_count": 6,
  "view_count": 360,
  "created_date": null,
  "last_reply": "20140804T20:54:11-06:00",
  "posts": [
    {
      "post_id": "1306173",
      "post_title": "Wtb",
      "post_author_name": "Conner161822",
      "post_content": "Already posted this inside of another thread but--\r\n\r\n Hi,\r\nI'm 15 and am wanting to start collecting pre-war cards after seeing them at the National. If you have anything super low grade and relatively cheap, please let me know either in the thread or PM.",
      "post_time": "20140804T19:39:36-06:00",
      "timestamp": "1407202776"
    },
    {
      "post_id": "1306176",
      "post_title": "",
      "post_author_name": "veleno45",
      "post_content": "Hi Conner,\n\nAny certain pre-war or just pre-war in general?",
      "post_time": "20140804T19:41:58-06:00",
      "timestamp": "1407202918"
    },
    {
      "post_id": "1306183",
      "post_title": "",
      "post_author_name": "Conner161822",
      "post_content": "I really like the 1933 and 34 Goudey's and T206/T205's but at this point I'm really just finding a place to start. I really ike the 14 and 15 CJ's but that will come when i have a real job that makes lots of money.",
      "post_time": "20140804T19:48:10-06:00",
      "timestamp": "1407203290"
    },
    {
      "post_id": "1306203",
      "post_title": "",
      "post_author_name": "Mountaineer1999",
      "post_content": "Hi Conner, welcome to the board. May I ask what interested you in pre-war cards? And also, I see you are from Pittsburgh............ tell me your a Pirates fan! :)",
      "post_time": "20140804T20:18:23-06:00",
      "timestamp": "1407205103"
    },
    {
      "post_id": "1306213",
      "post_title": "",
      "post_author_name": "Conner161822",
      "post_content": "Yes i am a HUGE pirates fan! I've already been to 11 games this season! What sparked my interest in pre-war cards was seeing all go the cards at the National this past weekend. And then my dad signed up with PSA and got the Cracker Jack book. We went to the HOF in Cooperstown 3 years ago and I have really been interested in the history of baseball since then! Seeing the old faces on 100 year old cardboard really brings the history to life.",
      "post_time": "20140804T20:25:21-06:00",
      "timestamp": "1407205521"
    },
    {
      "post_id": "1306227",
      "post_title": "",
      "post_author_name": "Mountaineer1999",
      "post_content": "That's awesome Conner, we get up to PNC about once a year to take in a game. Best park in the majors.\n\nI dont have much experience with many cards but jsut started a T206 collection and love the cards. Maybe get some rough examples of each and go from there. I don't know about the other sets but you can sometimes pick up a rough but quality T206 for $15 or so on Ebay and here on B/S/T.",
      "post_time": "20140804T20:47:40-06:00",
      "timestamp": "1407206860"
    },
    {
      "post_id": "1306231",
      "post_title": "",
      "post_author_name": "Conner161822",
      "post_content": "PNC is the only park I have been to but my standards are now pretty high as far as ball parks are concerned. I'm pretty excited about this new venture into pre-war. I'll post about my Progress periodically!!",
      "post_time": "20140804T20:54:11-06:00",
      "timestamp": "1407207251"
    }
  ]
}