{
  "id": "242605",
  "forum_id": "39",
  "title": "T206 Blowout - Raw Mostly Auth With Amazing Eye Appeal Or Lower Grade",
  "author": "btcarfagno",
  "reply_count": 2,
  "view_count": 400,
  "created_date": null,
  "last_reply": "20170719T16:08:41-06:00",
  "posts": [
    {
      "post_id": "1682490",
      "post_title": "T206 Blowout - Raw Mostly Auth With Amazing Eye Appeal Or Lower Grade",
      "post_author_name": "btcarfagno",
      "post_content": "McGraw - From a near set I purchased a couple of years ago that had over two hundred cards with clipped corners that were otherwise mostly in outstanding condition. Mugsy has the clipped corner...nice corners otherwise. Pencil mark in border by finger. Clean back. No creasing at all. $35\n\nChance - From a near set I purchased a couple of years ago that had over two hundred cards with clipped corners that were otherwise mostly in outstanding condition. Chance has the clipped corner. Card almost near mint otherwise. Beautiful eye appeal. Great centering. SOLD\n\nGriffith - From a near set I purchased a couple of years ago that had over two hundred cards with clipped corners that were otherwise mostly in outstanding condition. Griffith has the clipped corner. Some creasing. Very red background. Seems like an extra red pass. SOLD\n\nWillis - From a near set I purchased a couple of years ago that had over two hundred cards with clipped corners that were otherwise mostly in outstanding condition. Willis has the clipped corner. Card EX-MT otherwise. Beautiful eye appeal. $45\n\nBarry - Very nearly a complete no-name card. Someone wrote name \"Barry\" in pencil along border due to the name almost not appearing on the card at all. Clipped corner. Otherwise near EX. $15\n\nKillian - GD condition. Small stain top right corner. Back clean. No creases. $23\n\nO'Brien - This card is a mess but it is absolutely HUGE. 1 or 2 mm larger than any other T206 I have owned. SOLD\n\nAll prices include shipping.\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/img07192017_0002_zpsmycfj2ht.jpg[/IMG]\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/img07192017_0003_zpskmt5to2d.jpg[/IMG]\n\nTom C",
      "post_time": "20170719T13:37:25-06:00",
      "timestamp": "1500493045"
    },
    {
      "post_id": "1682498",
      "post_title": "",
      "post_author_name": "JCC",
      "post_content": "PM sent",
      "post_time": "20170719T14:07:26-06:00",
      "timestamp": "1500494846"
    },
    {
      "post_id": "1682537",
      "post_title": "",
      "post_author_name": "adoo1",
      "post_content": "Pm sent",
      "post_time": "20170719T16:08:41-06:00",
      "timestamp": "1500502121"
    }
  ]
}