{
  "id": "351025",
  "forum_id": "39",
  "title": "22 t206 cards for sale or trade",
  "author": "doug.goodman",
  "reply_count": 9,
  "view_count": 1055,
  "created_date": null,
  "last_reply": "20240706T15:12:12-06:00",
  "posts": [
    {
      "post_id": "2445862",
      "post_title": "22 t206 cards for sale or trade",
      "post_author_name": "doug.goodman",
      "post_content": "I just found these in a long forgotten box, I bought them back in the Teletrade days.\r\n\r\nThey fit nowhere in my collection (except evidently forgotten boxes).\r\n\r\nI have never been a t206 guy, but for a moment (or 22 moments) I evidently had an interest.\r\n\r\nI posted these in the July pickup thread (I found them this July, and it's possible they were purchased during a previous July) and was kind of being facetious when I said \"offers for the lot encouraged\", but then I got a few messages, so I figured I should put a slight amount of real effort into letting the t206 section of the board know they are available.\r\n\r\n\r\nI think all the details you guys look for is viewable in the attached scans, but email me via the site for higher quality scans if needed.\r\n\r\nEverything is factory 25, except the de Gales cards are factory 17.\r\n\r\nThe Dunn card has a ghost image of his name and team on the back on the bottom. \r\n\r\n\r\nAll offers entertained whether on individual cards, a group of cards, or the lot.\r\n\r\nI have no other tobacco cards to sell (that I am aware of) and no interest in trading for more, although I am interested in large sized tobacco era items, particularly m113 supplements (and also m114), but any large sized supplements (The Stage, StL Republic, etc.), newspaper or magazine images (Police Gazette, Sporting Life, etc).   \r\n\r\nThanx,\r\nDoug",
      "post_time": "20240705T21:50:47-06:00",
      "timestamp": "1720237847"
    },
    {
      "post_id": "2445864",
      "post_title": "Dunn",
      "post_author_name": "Lunker21",
      "post_content": "Hi, I'm interested in Dunn... will PM\r\n.. thanks!",
      "post_time": "20240705T22:01:07-06:00",
      "timestamp": "1720238467"
    },
    {
      "post_id": "2445866",
      "post_title": "",
      "post_author_name": "Lucas00",
      "post_content": "These look really nice Doug. Good luck!",
      "post_time": "20240705T22:10:01-06:00",
      "timestamp": "1720239001"
    },
    {
      "post_id": "2445870",
      "post_title": "",
      "post_author_name": "Mantle77CA",
      "post_content": "[quote name=\"doug.goodman\" post=2445862]I just found these in a long forgotten box, I bought them back in the Teletrade days.\r\n\r\nThey fit nowhere in my collection (except evidently forgotten boxes).\r\n\r\nI have never been a t206 guy, but for a moment (or 22 moments) I evidently had an interest.\r\n\r\nI posted these in the July pickup thread (I found them this July, and it's possible they were purchased during a previous July) and was kind of being facetious when I said \"offers for the lot encouraged\", but then I got a few messages, so I figured I should put a slight amount of real effort into letting the t206 section of the board know they are available.\r\n\r\nI’m \r\nI think all the details you guys look for is viewable in the attached scans, but email me via the site for higher quality scans if needed.\r\n\r\nEverything is factory 25, except the de Gales cards are factory 17.\r\n\r\nThe Dunn card has a ghost image of his name and team on the back on the bottom. \r\n\r\n\r\nAll offers entertained whether on individual cards, a group of cards, or the lot.\r\n\r\nI have no other tobacco cards to sell (that I am aware of) and no interest in trading for more, although I am interested in large sized tobacco era items, particularly m113 supplements (and also m114), but any large sized supplements (The Stage, StL Republic, etc.), newspaper or magazine images (Police Gazette, Sporting Life, etc).   \r\n\r\nThanx,\r\nDoug[/QUOTE]\r\n\r\nI’m interested in the Piedmont backed cards, PM sent.",
      "post_time": "20240705T22:48:33-06:00",
      "timestamp": "1720241313"
    },
    {
      "post_id": "2445919",
      "post_title": "My quandary",
      "post_author_name": "doug.goodman",
      "post_content": "Apologies in advance for this potentially rambling / long winded post, I admit to thinking too much :\n\nThose of you who are active on other parts of the board may know me as fairly knowledgeable about a few things like m113 / m114 supplements, or scored programs, but while I have been \"curious\" about the t206 set and over the years have enjoyed (and marveled at) t206 posts by the late great TedZ and others, my only \"specific\" knowledge on the \"values\" of these 22 cards I own was attained last night via googling the individual cards, and looking at ebay SOLD prices, but the enormous amount of variations with this set, make it difficult to compile info for a neophyte such as myself.\n\nAs an example, while my hatred of the opinion sellers is pretty well documented, I'm also aware that the website of \"everybody's favorite\" is a pretty good place to learn things in certain situations, this being one of them.\n\nBut I was quickly struck by the fact that while they differentiate all the backs and all the fronts for a total of 3,942 cards in a master set, they in fact do not differentiate all the backs and all the fronts because according to t206resource.com :\n\n\"Thirteen subjects in the T206 set can be found only with 150 Series backs, and all are part of group 1. Eleven were pulled from production prior to this group's transition to the 350 Series print runs.\"\n\nThat tells me that every card in the t206 set with a Piedmont 150 back ALSO has a Piedmont 350 back, so however many that is (137?) should be listed in the master set twice for an actual total of 4,079 cards in the master set, and I don't know about factories, and districts and \"weights\" and, and, and, and.\n\nAnd since I mentioned \"weights\" I have to ask, are they stupid? I think maybe they aren't completely, but kind of in a \"the Wagner must weigh about ten million (that's a t206 pun) kind of way\". All my cards weigh the standard normal common 1, except the El Principe and the McGraw (wow and 8 of 10, I guess it's nearly a Wagner 10!)\n\nI think you all see where I'm going. The master set listed by that specific opinion seller is wrong, by a long shot, which makes me question how much more they are wrong about.\n\n\nFor some context, I'm a guy who while collecting the 1963 Topps Peel-Offs set noticed that while some in the hobby were aware of the two back variations (instruction and black backs) and allowed for their variation in availability, there were in fact three variations (instructions either right side up or upside down) and those have a very definite availability difference (which, led by the brain surgeons who sell opinions, the hobby still does not recognize).\n\n\nSo, back to the Piedmont backs, my question becomes does the opinion seller not differentiating the different Piedmont backs mean that nobody differentiates (doubtful) or that the opinion sellers are stupid (probable)?\n\nAt that point last night, I kind of gave up on attempting to price what I have.\n\nI'm annoyed by sellers who don't post a price as much (maybe more so) than anybody, so I sincerely apologize for being that guy, but as Dezi used to say (even though he actually never said it) \"explain it to me Lucy\" how am I supposed to do so with the minimal knowledge I have?\n\n\nSo the rambling about leads me to :\n\nI have had two offers for the lot one for $2k and one for $3k, another guys said \"I was going to offer $2600 but since you got them from teletrade I think many of them are probably trimmed\". \n\nI kind of appreciate that third note because it \"alerts\" me to teletrade evidently having a reputation (I googled it, but fell in a rabbit hole and decided to just take that line for what it is worth), but at the same time I'm not really sure what to do with that info.\n\nI would be happy to pass these 22 cards to a collector who would love them and appreciate them and fill a hole in his / her collection with them (while I make a couple bucks in the process), BUT (and I can't lie, I like big BUTs) I don't want to rip anybody off (or get ripped off myself, BUT that is secondary).\n\nHow do I do that without dealing with the headache of selling them to somebody, who then sends them to the useless opinion sellers, who proceeds to like them or not, based on whether they got laid on their lunch break or not, and if they don't like them my buyer now hates me, and wants their money back, which they arguably very much deserve back, but I already spent their money to fill some holes in my m113 / m114 sets, and, and, and, but maybe I should just of just put them back in the box I found them in and forgot about them for another 25 years?\n\nAnybody have any thoughts?\nDoug\n\n\nPS - and who knows what trimmed even means to the opinion sellers, and the rest of us?",
      "post_time": "20240706T11:54:04-06:00",
      "timestamp": "1720288444"
    },
    {
      "post_id": "2445923",
      "post_title": "",
      "post_author_name": "brianp-beme",
      "post_content": "Looking at the cards my first thought was that they were possibly (and mostly) trimmed...a good portion of them look small and just too perfect.  I have a Willetts that also has an angular cut and nice corners, but you can see that mine has substantially, and probably unnaturally, larger borders.\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=627451&d=1720290060[/IMG][IMG]http://www.net54baseball.com/attachment.php?attachmentid=627452&d=1720290087[/IMG]\n\nI could be completely wrong about all this.  From my perspective the fact that they came from Teletrade made no difference, as I purchased from them and did not have any trimming issues.  However, I was/am into lower condition cards, so something like these real nice looking examples would never have been something I went after (My Willetts probably came in a group lot).\n\nIt would be nice to know what T206'ers have to say about them.  And I appreciate a seller looking out for their customers...kudos!\n\nBrian",
      "post_time": "20240706T12:29:11-06:00",
      "timestamp": "1720290551"
    },
    {
      "post_id": "2445926",
      "post_title": "",
      "post_author_name": "doug.goodman",
      "post_content": "[quote name=\"brianp-beme\" post=2445923]And I appreciate a seller looking out for their customers...kudos!\r\n\r\nBrian[/QUOTE]\r\n\r\nThank you.\r\n\r\nThe thing is I don't really have a seller mentality because I am not really a seller, I am way more of a buyer. \r\n\r\nI only sell things because I have a spare, or in this instance have something that doesn't interest me and I would prefer somebody own it who would enjoy it, OR because I would REALLY like to thin the herd, (anybody want 5000 scored programs? Or 60 years of The Sporting News? hahaha).",
      "post_time": "20240706T12:39:30-06:00",
      "timestamp": "1720291170"
    },
    {
      "post_id": "2445935",
      "post_title": "",
      "post_author_name": "doug.goodman",
      "post_content": "I have now responded to all of the offers I have received by telling people that I do not know what price(s) I want and to read my updated post.\r\n\r\nThere are 22 pretty nice looking 113+ year old pictures of old baseball players. Are all, or some, or none of them trimmed? I don't know. \r\n\r\nAs an old man in reading glasses eyes who needed to look at enlarged scans to read the names (and notice the Dunn ghost print) I haven't bothered taking them out of the sheets.\r\n\r\nAre they worth an average of $135 each (as $3k offer guy thought before I told him to read the update, I don't know what he thinks now) or does the possibility of them being trimmed make them worthless? I again don't know.\r\n\r\nBut, if the slab of the most famous trimmed card in the world is worth whatever it's worth to the people who choose to ignore reality (and let's all be honest, it's the slab that holds that value, not the the actual card) then I see nothing wrong with these cards being worth an average of $135 each (plus of course the cost of an \"authentic\" slab.\r\n\r\nBut maybe I'm wrong.\r\n\r\nI actually kind of enjoy the 22 of them now.\r\n\r\nDoug",
      "post_time": "20240706T13:20:54-06:00",
      "timestamp": "1720293654"
    },
    {
      "post_id": "2445944",
      "post_title": "",
      "post_author_name": "Kevin",
      "post_content": "Enjoy them, Doug.",
      "post_time": "20240706T14:11:25-06:00",
      "timestamp": "1720296685"
    },
    {
      "post_id": "2445956",
      "post_title": "Piedmonts & Schidt SOLD - 3 EPDG / 1 Sovereign / 1 Sweet Caporal remaining",
      "post_author_name": "doug.goodman",
      "post_content": "[quote name=\"Kevin\" post=2445944]Enjoy them, Doug.[/QUOTE]\r\n\r\nThank you, but I didn't enjoy the Piedmonts or Schmidt for long, they are now sold.\r\n\r\nUpdated scans of remaining cards with backs matched to fronts.\r\n\r\nOffers still encouraged.\r\n\r\nThank you for the various advice and kind words from everybody.\r\n\r\nDoug",
      "post_time": "20240706T15:12:12-06:00",
      "timestamp": "1720300332"
    }
  ]
}