{
  "id": "316394",
  "forum_id": "39",
  "title": "[SOLD] t206 SGC Lower Grade Commons",
  "author": "drazz5",
  "reply_count": 4,
  "view_count": 605,
  "created_date": null,
  "last_reply": "20220310T13:23:49-06:00",
  "posts": [
    {
      "post_id": "2204028",
      "post_title": "[SOLD] t206 SGC Lower Grade Commons",
      "post_author_name": "drazz5",
      "post_content": "Hi All,\r\nI am trying to transition my t206 collection to strictly PSA graded (and also focusing on cards in the 4-5 grade range) so these lower grade SGC cards unfortunately have to go. I tried to upload scans that were as clear as possible and provide an honest description of imperfections below, but let me know if you would like to see additional pictures. All cards are for sale but I will also consider any combination or partial trade (will include additional cash as necessary). As I mentioned, I am looking for PSA graded t206 in the 4-5 range (will consider 3 grade if they are HOF’ers). To simplify shipping, I am asking you tack on a flat fee of $4 whether you get one card or all of them. Thanks!\r\n\r\n•[STRIKE]Charlie Rhodes – Authentic – Originally bought raw so I assume it was trimmed at some point [/STRIKE]- [STRIKE]$65[/STRIKE] SOLD\r\n\r\n•[STRIKE]Moose Mccormick – 35 Good+ (2.5) – Good looking card and well centered, corner wear on bottom left corner and mall crease above head (only visible from the front side of the card) [/STRIKE]- SOLD\r\n\r\n•[STRIKE]Billy Maloney – 30 Good (2) – Rounded corners and top part of “M” letter has worn off.[/STRIKE] - [STRIKE]$75[/STRIKE] SOLD\r\n\r\n•[STRIKE]Admiral Schlei (catching) – 20 Fair (1.5) – Decent corners on left side, rounded on right side. Three major creases from top left of card down to the bottom. Two additional creases going from left side to top right.[/STRIKE] - [STRIKE]$50[/STRIKE] SOLD\r\n\r\n•[STRIKE]Moose Grimshaw – 20 Fair (1.5) – Worn top left corner, crease at bottom right corner. Nice looking card but for the creasing.[/STRIKE] -[STRIKE]$65[/STRIKE] SOLD\r\n\r\n•[STRIKE]Mike Donlin (seated) – 35 Good+ (2.5) – Slight crease on bottom right corner, typical corner wear for grade. [/STRIKE] - SOLD\r\n\r\n•[STRIKE]George Moriarty – 30 Good (2) – Corners are dinged up on left side, slight paper loss on back. Backside of case has sticker residue – should scrub off fine.[/STRIKE] - SOLD\r\n\r\n•[STRIKE]Clyde Engle – 30 Good (2) – Best looking card of the group IMO. Ding on bottom right corner. Only thing that might justify a 2 grade is the small “ck” stamp on back bottom left border. Back of SGC holder has a small scratch.[/STRIKE] - SOLD\r\n\r\n•[STRIKE]Jake Weimer – Raw – crease above head (visible on both sides) and another crease on left side of face. Guessing this would grade in the “good” range as well.[/STRIKE] - [STRIKE]$75[/STRIKE] SOLD",
      "post_time": "20220309T14:06:52-06:00",
      "timestamp": "1646860012"
    },
    {
      "post_id": "2204047",
      "post_title": "",
      "post_author_name": "jakebeckleyoldeagleeye",
      "post_content": "If you just selling I'll take the McCormick.",
      "post_time": "20220309T15:11:27-06:00",
      "timestamp": "1646863887"
    },
    {
      "post_id": "2204061",
      "post_title": "T206",
      "post_author_name": "ClementeFanOh",
      "post_content": "Message sent re: trading- Trent King",
      "post_time": "20220309T15:53:45-06:00",
      "timestamp": "1646866425"
    },
    {
      "post_id": "2204181",
      "post_title": "",
      "post_author_name": "drazz5",
      "post_content": "Responded to all PM’s. List of available updated.",
      "post_time": "20220309T21:30:35-06:00",
      "timestamp": "1646886635"
    },
    {
      "post_id": "2204345",
      "post_title": "Bump",
      "post_author_name": "drazz5",
      "post_content": "BUMP for Price reduction",
      "post_time": "20220310T13:23:49-06:00",
      "timestamp": "1646943829"
    }
  ]
}