{
  "id": "309996",
  "forum_id": "39",
  "title": "FS: T206 Bender pitching with trees PSA 1",
  "author": "cgjackson222",
  "reply_count": 0,
  "view_count": 560,
  "created_date": null,
  "last_reply": "20211104T06:01:57-06:00",
  "posts": [
    {
      "post_id": "2160388",
      "post_title": "FS: T206 Bender pitching with trees PSA 1",
      "post_author_name": "cgjackson222",
      "post_content": "Asking $160 net.   T207 Bender has been traded\r\n\r\nCharles Albert “Chief” Bender\r\n\r\nBorn: May 5, 1884 - Crow Wing County, MN\r\nDied: May 22, 1954 - Philadelphia, PA\r\nBatted: RH\r\nThrew: RH\r\nPosition: P\r\nMLB Pitching Record: 212–127\r\nERA: 2.46\r\n\r\nTeams:\r\nPhiladelphia Athletics AL (May 5, 1884 - May 22, 1954)\r\nBaltimore Terrapins FL (1915)\r\nPhiladelphia Phillies NL (1916–1917)\r\nChicago White Sox AL (1925)\r\n\r\nOne of the innovators of the pitch known as the slider, Charlie “Chief” Bender was not just a great pitcher, he was also a great representative of our National Pastime. Bender’s German-American father and Ojibwa mother settled in Crow Wing County, Minnesota, to raise their large family. When he was 12 years old, Bender was recruited to the famed Carlisle Indian School in Pennsylvania, where he developed his mental and baseball skills. Well-respected by peers and fans alike, Charlie Bender carried himself with grace and dignity, even when dealing with racial slurs. Known for his cerebral approach to the game and his ability to pitch under pressure, Bender was an integral part of the A’s dynasty in the days of Connie Mack’s $100,000 infield.\r\n\r\nWith 212 lifetime wins and a 2.46 lifetime ERA, Bender played on three World Series Champions and had two 20-win seasons. He led the American League in winning percentage in 1910, 1911 and 1914; and in saves in 1906 and 1913. A fairly good hitter, Bender also played both the infield and outfield on occasion. Although not overpowering, Bender was a crafty control pitcher who seemed to be at his best in important games. \r\n\r\nAfter a short stint in the Federal League, Bender worked in the shipyards during World War I, managed in the minors into the 1940s, coached at the U.S. Naval Academy, and served as coach or scout for the New York Yankees, Chicago White Sox, New York Giants, and Philadelphia Athletics. Actually, as coach for the White Sox, Bender pitched one last inning for them in 1925. Always loyal to the A’s, Bender went back to work for them as pitching coach when he was 61 years old.\r\n\r\nCharlie Bender was elected to the Hall of Fame in 1953. Although Bender accepted his nickname, he always signed autographs as Charlie Bender. When in Cooperstown for Hall of Fame weekend a few years ago, this writer met a gentleman who was a huge Bender fan, and would only refer to him as Charlie. He maintained that the “Chief” moniker was racially derogatory, and although Bender always answered with a smile, he wanted to be known as Charlie.  \r\n\r\n– Tom and Ellen Zappala, The Cracker Jack Collection: Baseball's Prized Players.",
      "post_time": "20211104T06:01:57-06:00",
      "timestamp": "1636027317"
    }
  ]
}