{
  "id": "336421",
  "forum_id": "39",
  "title": "FS: Hindu / Carolina Brights / Broad Leaf",
  "author": "robw1959",
  "reply_count": 2,
  "view_count": 422,
  "created_date": null,
  "last_reply": "20230608T20:26:07-06:00",
  "posts": [
    {
      "post_id": "2346334",
      "post_title": "FS: Hindu / Carolina Brights / Broad Leaf",
      "post_author_name": "robw1959",
      "post_content": "I have looked very carefully for creases in each of these, but found none. Asking $3500 shipped for each, or $10K for all three of them. Prices are firm, and a PayPal Friends & Family payment is preferred.\r\n\r\nSuccessful transactions with: Sean1125, 39special, Ericc22, asoriano, Econteachert205, oldcardboard, tolstoi, Jobu, simas7173, espomario, jmb, Charlie Faust III, Paul S, quitcrab, avalanche2006, Beatles Guy, Banjo, tjenkins, botn, trdcrdkid, jtschantz, longstreet766, greenmonster66, edjs, jb67, rhotchkiss, Puckettfan, mybuddyinc, frankbmd, Baseball*Collections, btcarfagno, Luke, vintageonlybb, bigfish, t206collector, marvymelvin, benginino9, bigedmachine, Stampsfan, Moonlight Graham, Rebublicaninmass, Gradedcardman, Tigerden, Smanzari, t206kid, clydepepper, Scott L., Brian Van Horn, t206whiteborder, polakoff, GoCubsGo32, Hxcmilkshake, Scott Garner, Goudey77, rdixon1208, Pat R, Bram99, bks14sr, Haybag, charlietheexterminator, fusorcruiser, Mutton Chop Yaz, ncinin, rootsearcher60, GoldenAge50s, thecomebacker, Kryksir, T206.org, seattlebaseball, banksfan14, slantycouch, forceplay sport, niembre, nickers, Kris19, bounce, aloondilana, lrush, fusorcruiser, cardsagain74, aronbenabe, JollyElm, Charger74, Cooper1972, ainmon, Gorditadogg, AWGreen, chadeast, ahumes13, dhicks67, mikemcgrail, DHogan, chrisn28, Frankish, bigfish, Donscards, hcv123, corky8484, sycks22, Scon0072, heisman95, cgjackson222, Beesweb2006, sflayank, horzverti, ClementeFanOh, scmavl, gooseman91, sb1, stkuhl, rand1com, Bliggity, lrush, paulcarek, Kris19, Belfast1933, Wookjie17, Kutcher55, vansaad, Redlegs25, Miamifinfan13, rjackson44, rpz2, vintagetoppsguy, lug-nut, GoldenAge50s, Jcosta19, gooseman91, irishdenny. ASF123, KMayUSA6060, RayBShotz, yanksfan09, Cubs Fan, bbsports, MBMiller25, mccrardl, babraham, Chicken man, Lobo Aullando, sflayank, funeralizer1, YazFenway08, philliesfan, Tyruscobb, dahunt8111, carlsonjok, iwantitiwinit, grandslamcardscria, Neal, docpatlv, 3arod13",
      "post_time": "20230608T15:30:22-06:00",
      "timestamp": "1686259822"
    },
    {
      "post_id": "2346338",
      "post_title": "",
      "post_author_name": "Luke",
      "post_content": "The Hunter does have a wrinkle/crease across the card from left to right.  I owned it for awhile before having it in the right light to see it.  You can barely see it on this scan if you know what you're looking for.  It's an amazing card, and that's a good price.",
      "post_time": "20230608T15:53:56-06:00",
      "timestamp": "1686261236"
    },
    {
      "post_id": "2346419",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "That's amazing. I even took it out of the holder when this card used to be an SGC 2, just to examine it further. Finding nothing to explain the grade, I sent it to PSA for their review, with this result. I cannot see anything like a crease or wrinkle that you are referring to, even under magnification and illumination. The grade could just be due to the extra ink on front.",
      "post_time": "20230608T20:26:07-06:00",
      "timestamp": "1686277567"
    }
  ]
}