{
  "id": "186305",
  "forum_id": "39",
  "title": "FS: Walter Johnson portrait, SGC 30. *Card has been sold!*",
  "author": "the 'stache",
  "reply_count": 3,
  "view_count": 498,
  "created_date": null,
  "last_reply": "20140416T13:18:18-06:00",
  "posts": [
    {
      "post_id": "1264999",
      "post_title": "FS: Walter Johnson portrait, SGC 30. *Card has been sold!*",
      "post_author_name": "the 'stache",
      "post_content": "*Update. Card has been sold!\r\n\r\nGood evening, everybody.\r\n\r\nI am selling my Walter Johnson T206 portrait in order to acquire another example of slightly higher quality. This one has been graded a 30 by SGC. The card back displays a Piedmont advertisement, 150 subjects. Factory 25 2nd Dist VA.\r\n\r\n[IMG]http://imagizer.imageshack.us/a/img21/3349/s4vk.jpg[/IMG][IMG]http://imageshack.com/a/img853/8944/bpkb.jpg[/IMG]\r\n\r\nI paid $500 for the card when I bought it on our BST in September. I am just looking to get my investment back. I ask that any correspondence regarding this card be sent via private message. I archive my private messages, so there is no chance my inbox will be full. \r\n\r\nThe card itself presents very nicely. I have provided links to 600 dpi scans of the front and back below. Additionally, I always like to point out any flaws I have identified in the card so they are not overlooked. I want the next owner of this card to be completely satisfied with their purchase. In the high upper left corner, there are a few diagonal creases which intersect both the top and left border. These do not present on the back of the card. On the opposite corner exist a few touches of tobacco stain. On the left border, directly across from Johnson's chin, there are three light imperfections. These are either scratches or very light wrinkles. I cannot be sure as to which under 10 x magnification. On the opposite side of the card appear four tear drop shaped indentations, each about the size of a pin head. There are a few additional slight indentations of a similar nature that present in the lower third of the card's front. The back is largely unremarkable save for a small tobacco stain on the lower left edge. Corner and edge wear are uniform and consistent with what one would expect for the grade. Please judge the centering from the scans provided. \r\n\r\nShould you have any questions, or need any other pictures, please feel free to pm me. Scans are done with my Canon CanoScan 8400F. Outside of a small adjustment to the black levels to accurately portray the card's appearance, the pictures provided have not in any way been further adjusted.   \r\n\r\n[IMG]http://imagizer.imageshack.us/a/img268/8641/59zv.png[/IMG]\r\n[IMG]http://imagizer.imageshack.us/a/img513/5603/07zf.png[/IMG]\r\n\r\nI am completely flexible on payment. Paypal is preferred. Should you choose goods & services, I do ask that you cover the fees, which would be $15.24. If you do not want to deal with Paypal at all, a money order or personal check is okay, too. The card would be sent upon the check clearing. I prefer that concealed cash not be used. This is to protect both of us. \r\n\r\nThe card will be shipped via USPS in a priority mail small flat rate box with signature confirmation and insurance for the full $500. I will pay for these. The slab itself will be backed on either side by cardboard, and further protected by bubble wrap. I will message my buyer when payment has been received, and when the card is sent, which would be next business day. \r\n\r\nI just had arthroscopic knee surgery on Wednesday morning, so the medications my doctor have me on are causing me to sleep some during the day. But I check the forum every evening, and will respond to any inquiries I get in the order they were received. I do business on a first come, first serve basis. A firm commitment always takes precedence. \r\n\r\nAll cards, while in my possession, are stored in a smoke free home. \r\n\r\nThank you for looking!!\r\n\r\nBill",
      "post_time": "20140411T18:19:04-06:00",
      "timestamp": "1397261944"
    },
    {
      "post_id": "1265009",
      "post_title": "",
      "post_author_name": "cincyredlegs",
      "post_content": "Bill,\r\n\r\nThat Big Train is a true beauty.  If I wasn't taking the family to Disney tomorrow for spring break, I would be all over that.  Good luck with your sale.\r\n\r\nMark",
      "post_time": "20140411T18:41:34-06:00",
      "timestamp": "1397263294"
    },
    {
      "post_id": "1265011",
      "post_title": "",
      "post_author_name": "the 'stache",
      "post_content": "Thanks, Mark. Have a great time with your family!",
      "post_time": "20140411T18:51:53-06:00",
      "timestamp": "1397263913"
    },
    {
      "post_id": "1266218",
      "post_title": "",
      "post_author_name": "the 'stache",
      "post_content": "Card has been sold!",
      "post_time": "20140416T13:18:18-06:00",
      "timestamp": "1397675898"
    }
  ]
}