{
  "id": "293007",
  "forum_id": "39",
  "title": "No Longer Available- T206 Cobb Red SC 460/30",
  "author": "sando69",
  "reply_count": 9,
  "view_count": 1212,
  "created_date": null,
  "last_reply": "20201216T22:27:51-06:00",
  "posts": [
    {
      "post_id": "2042941",
      "post_title": "No Longer Available- T206 Cobb Red SC 460/30",
      "post_author_name": "sando69",
      "post_content": "T206 Red Cobb SC 460/30 PSA 2, which, I feel, presents much nicer than it's appointed grade... vivid color, fat borders, exceptional centering, no creases or any other hidden problems. Front appears to be a 3 or 3.5, but has 2 small spots of slight paper loss along border, as well as a minute tobacco stain on reverse.\r\nI also found this back to be one of the tougher red Cobb common f/b combinations as confirmed by Scot Reader's in-depth analysis from \"Inside T206.\" \r\nWould be willing to trade only for any similar condition (or better plus cash) Cobbs from my wantlist below, especially the Piedmont 350 (far & away the most common back, but the final piece to my realistic back run).\r\nAlso searching for \"Bat On\" with SC 350/25 and \"Bat Off\" with P 350 backs.\r\nAny assistance that can be offered to help an old-timer complete a 40+ year old project would be greatly appreciated.\r\nThanks for looking!",
      "post_time": "20201207T12:01:36-06:00",
      "timestamp": "1607367696"
    },
    {
      "post_id": "2043211",
      "post_title": "",
      "post_author_name": "Blunder19",
      "post_content": "Good luck Mark.    I wish I had an extra pied 350 to trade you. Your collection was an inspiration for me.",
      "post_time": "20201208T06:23:26-06:00",
      "timestamp": "1607433806"
    },
    {
      "post_id": "2043264",
      "post_title": "Hi Jamie!",
      "post_author_name": "sando69",
      "post_content": "thank you.\nhave been pouring thru old emails & pm's recently in order to document the origin of my individual cobbs (which i would urge you to do as well, if you already haven't) \ni can't tell you what an absolute joy it has been rereading the dozens upon dozens of communications we have shared thru the past eight years in regards to your amazing quest.\ni can very honestly state that i am almost as proud of you for your incredible accomplishment as you are!\ni still enjoy, so very much, looking at your run whenever you share it. \ntho, i must admit there does exist a tinge of envy, it is truly an honor to have been, even just a minimal, motivational factor in your pursuit.\npersistence, insistence, patience, negotiating skills and financial commitment have all contributed to attaining your lofty goal!\nonce again, i say congratulations to you,\nyou shall always be the king of back runs, especially the t206 red cobb one.\n\nps: chris b. (hi chris!), made a comment in another post about me being the OG cobb rareback collector, which i took as quite a compliment!\nthat is until i realized that OG really means Old Geezer.   :eek:",
      "post_time": "20201208T08:51:24-06:00",
      "timestamp": "1607442684"
    },
    {
      "post_id": "2043266",
      "post_title": "",
      "post_author_name": "MVSNYC",
      "post_content": "Just wanted to say...very cool interaction between you two here...refreshing to read these type of posts, versus others.\n\nBest,\nMike",
      "post_time": "20201208T08:58:03-06:00",
      "timestamp": "1607443083"
    },
    {
      "post_id": "2043292",
      "post_title": "",
      "post_author_name": "atx840",
      "post_content": "[quote name=\"sando69\" post=2043264]\r\nps: chris b. (hi chris!), made a comment in another post about me being the OG cobb rareback collector, which i took as quite a compliment!\r\nthat is until i realized that OG really means Old Geezer.   :eek:[/QUOTE]\r\n\r\n:D\r\n\r\nNice looking card Mark!",
      "post_time": "20201208T10:50:50-06:00",
      "timestamp": "1607449850"
    },
    {
      "post_id": "2045652",
      "post_title": "New Trade Options",
      "post_author_name": "sando69",
      "post_content": "so, it appears that i will not be making a trade in the near future to acquire any of my three most preferred cobbs.\ntherefore, i have added a list of ten other t206's that i would be willing to trade in conjunction for my red cobb.\nequal or better condition, please, with similar eye appeal\n\nbender port\njimmy collins\nevers port\ngreminger \njennings port\n[STRIKE]wajo port[/STRIKE]\n[STRIKE]lajoie port[/STRIKE]\nmanion\n[STRIKE]tinker port[/STRIKE]\nwalsh\n\nthaks again for looking and any help you can offer!",
      "post_time": "20201215T08:17:01-06:00",
      "timestamp": "1608045421"
    },
    {
      "post_id": "2045672",
      "post_title": "",
      "post_author_name": "Casey2296",
      "post_content": "Very nice looking Cobb Mark, rooting for you to find that final piece to your run.",
      "post_time": "20201215T09:00:26-06:00",
      "timestamp": "1608048026"
    },
    {
      "post_id": "2046231",
      "post_title": "",
      "post_author_name": "notfast",
      "post_content": "[quote name=\"sando69\" post=2045652]so, it appears that i will not be making a trade in the near future to acquire any of my three most preferred cobbs.\r\ntherefore, i have added a list of ten other t206's that i would be willing to trade in conjunction for my red cobb.\r\nequal or better condition, please, with similar eye appeal\r\n\r\nbender port\r\njimmy collins\r\nevers port\r\ngreminger \r\njennings port\r\nwajo port\r\nlajoie port\r\nmanion\r\ntinker port\r\nwalsh\r\n\r\nthaks again for looking and any help you can offer![/QUOTE]\r\n\r\nWish I wouldn’t have sold my Wajo portrait recently. Oh well.\r\n\r\nThink of me if you want to sell this outright...:D",
      "post_time": "20201216T15:16:08-06:00",
      "timestamp": "1608156968"
    },
    {
      "post_id": "2046292",
      "post_title": "Same boat.....",
      "post_author_name": "vthobby",
      "post_content": "Unfortubnately I'm paypal friends and family rich ....... and T206 trades poor. :cool:\n\nI'd enjoy trading you CASH for this. Thanks for considering! \n\nMike",
      "post_time": "20201216T17:39:48-06:00",
      "timestamp": "1608165588"
    },
    {
      "post_id": "2046381",
      "post_title": "",
      "post_author_name": "sando69",
      "post_content": "i would like to thank those that have offered their kind words, compliments, interest and inquiries.\r\ni've seen numerous very nice cards that i would be happy to add to my set, but have been unable to come to a mutually satisfactory agreement mainly because  of the discrepancy between the values of one or two or three of the items on my trade list and my cobb. \r\nalso. my resistance to entertain cash for the cobb has become a serious obstacle. \r\nso now, i'm wondering if i need to pursue a different approach.\r\nseveral have asked me what i value the cobb to be worth.\r\nbased upon two recent ebay transactions for comparable psa 2's- 11/20/20 (old mill) $3900; 11/1/20 (sc 460/42) $3739; and three 2020 rea results for what i consider to be comparable psa 3's $3720, $3720 & $3600, i concluded that $3500 would be a reasonable valuation for my cobb.\r\nwhether or not that is an accurate and fair number, i suppose. remains to be seen. \r\nso, i have decided to open up my options to even more possibilities.\r\ni will now consider offers of all cards, cards plus cash or all cash for the cobb.\r\nalso, please feel free to share observations & commentary on my valuation of the cobb. \r\nof course. this offer is dependent on comparing \"apples with apples,\" but i am willing to listen to your perspectives on the subject!",
      "post_time": "20201216T22:27:51-06:00",
      "timestamp": "1608182871"
    }
  ]
}