{
  "id": "321107",
  "forum_id": "39",
  "title": "T206 Printer's scrap sale 4 cards",
  "author": "mrvster",
  "reply_count": 0,
  "view_count": 415,
  "created_date": null,
  "last_reply": "20220615T16:28:48-06:00",
  "posts": [
    {
      "post_id": "2234548",
      "post_title": "T206 Printer's scrap sale 4 cards",
      "post_author_name": "mrvster",
      "post_content": "Hello NET 54:)\r\n\r\nlooking to raise some cash for a card purchase....I hate to sell these, but offering up 4 of some of my favorite scraps;).....\r\n\r\nI will upload scans within the next few days or sooner....if you want a scan, I can email it to you in the meantime....I will try to have Erick Summers or Chris Browne to super impose the 2 overprints of the Tolstoi multi struck backs...\r\n\r\n\r\n1) T206 TOLSTOI Chic Gandil SGC \"AUTH MULTI STRIKE BACK\" - AWESOME SCRAP!  BLACK SOX ...\r\n\r\nCard has a multi struck back! SGC graded this as \"multi struck back\"  which no company even does now!!!  card has a multi printer strike of  Tolstoi  Advertisement, and that's not even the best part.... the card is 1 of 3 of this type of card known to exist, there exists 2 other cards (2 Fords, one of which I own and am listing here next) \r\n\r\n\r\nhere's the best part-\r\nCard has A MAGENTA GHOST OVERPRINT OF HERNANDO CORTES from T-68 Men of history issue!!!( Erick Summers deciphered this).... an issue printed at the ATC during 1909...:eek::eek::eek:\r\n\r\nI will include the PSA T-68 Hernando Cortes with the sale as a bonus! \r\n\r\n$3,500.00 or best offer\r\n\r\n2) T206 Russ Ford Tolstoi multi struck back SGC \"AUTH\"- most likely from the same sheet as the card listed above, Chic Gandil.....this card is not designated by SGC as \"multi strike\" , just \"Auth\" as any true scrap should have the authentic designation due to the hand cut......this card has T -68 GENEREAL CUSTER  magenta overprint also on the back.(Erick Summers also deciphered this....(I don't own the T-68 to accompany the sale)....ANOTHER AWESOME SCRAP! \r\n\r\n$2,500.00 or best offer\r\n\r\n3) T206 Jim Stephens Blank Back miscut front SGC \"AUTH\"\" Blank Back\"- sgc slabbed \"blank back\" , only one known to exist! SICK BLANK BACK SCRAP!  ONLY BLANK BACK TO HAVE A SUPER RARE FRONT MISCUT WITH A PART OF THE NEXT CARD SHOWING ON FRONT! This card was featured in an article written by Scott Forrest VBC article about \"error\" T206....I have the article and magazine to accompany this...purchased almost 20 years ago..\r\n\r\n$2,500.00 or best offer.....\r\n\r\n4) T206 Phil Poland\" yellow/brown type of printers scrap Pied 350 back.....card is missing most of the ink/print process....hand cut , wonky borders and \"creepy\" looking.....SICK CARD!\r\n\r\n$1,250.00 or best offer ...\r\n\r\n\r\n\r\n\r\nplease email me for scans until posted, or pm me(email preffered)\r\n\r\n[url]jvanderbeck@verizon.net[/url]\r\n\r\nThanks!\r\n\r\nJohnny V",
      "post_time": "20220615T16:28:48-06:00",
      "timestamp": "1655332128"
    }
  ]
}