{
  "id": "216166",
  "forum_id": "39",
  "title": "The Affordable HOF Act",
  "author": "frankbmd",
  "reply_count": 1,
  "view_count": 485,
  "created_date": null,
  "last_reply": "20160105T19:44:47-06:00",
  "posts": [
    {
      "post_id": "1488087",
      "post_title": "The Affordable HOF Act",
      "post_author_name": "frankbmd",
      "post_content": "4 HOFers are offered less than my wife's monthly health care premium.\n\nFirst, a Tinker Portrait (ungraded) with a Piedmont 150 reverse is offered for $OLD.\n\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/31528/tinker-portrait[/IMG]\n\nYup, that's a little paper loss on the reverse and a couple of diagonal creases, but a sharp image nonetheless.:cool:\n\nSecond, Keeler at bat in an SGC Auth holder with a Piedmont 150 reverse is offered for $77.\n\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10260/keeler-batting[/IMG]\n\nYup, Keeler may be a tad short, but his nickname was \"Wee Willie\" after all.  This is a very presentable authentic card with a crisp image.  Toning on the left border of the reverse doesn't show unless you turn the card over.;)\n\nThird, Zack Wheat in VG (ungraded) condition with a Piedmont 350/460 reverse is offered for $OLD.\n\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10783/wheat[/IMG]\n\nZack has one flaw, that little crease in the upper right corner.  Otherwise this card would receive a VGEX or EX grade.  I believe VG is a reasonable expression of this cards condition and would be surprised if it graded lower.:eek:\n\nFourth, John McGraw with his Glove at Hip in an SGC 30 holder with a desirable Sovereign 460 reverse is offered for $123.\n\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/16283/mcgraw-glove-at-hip-sov[/IMG]\n\nOverlook the left lower corner of the McGraw card and you see a strong image with the Sovereign 460 reverse which is clean.  One can only speculate about the damaged left lower corner with local toning/stain on the front and back.  Perhaps this was the result of a careless cigarette burn that occurred as a prior owner was overcome with the beauty of this card.:D\n\nNot one of this foursome would be considered a lower tier HOFers.  All prices include shipping costs and any form of payment net to me will do.  If you choose, you may take the remaining two (Keeler and McGraw) for $188.  Shipping will occur in a timely manner after receipt of payment.  Thanks as always for looking.\n\nOther duplicates are always posted on my TOBACCO ROAD collection on the collector focus website.  Most of these are also available if you choose to inquire.\n\n[url]http://www.collectorfocus.com/collection/frankbmd/duplicates[/url]\n\nPost if you choose, but PM messaging is preferred for interested buyers.",
      "post_time": "20160104T22:01:12-06:00",
      "timestamp": "1451970072"
    },
    {
      "post_id": "1488499",
      "post_title": "",
      "post_author_name": "sreader3",
      "post_content": "My high deductible PPO family policy was recently canceled due to ACA and I now have the \"privilege\" of paying $7K more a year for worse HMO coverage through Kaiser.  So you got any Wilhelms?",
      "post_time": "20160105T19:44:47-06:00",
      "timestamp": "1452048287"
    }
  ]
}