{
  "id": "262017",
  "forum_id": "39",
  "title": "Wanted: Beaters, chewers, trimmers, ripped and torn cards",
  "author": "david_l",
  "reply_count": 0,
  "view_count": 795,
  "created_date": null,
  "last_reply": "20181111T06:26:23-06:00",
  "posts": [
    {
      "post_id": "1826230",
      "post_title": "Wanted: Beaters, chewers, trimmers, ripped and torn cards",
      "post_author_name": "david_l",
      "post_content": "Hello friends,\n\nI’m a set builder looking for beaters. No condition is too crummy. Interested in commons and stars. Can buy singles or lots. I also have some T206 dupes as well as some other possible trade bait. \n\nI personally don’t place a higher value on graded cards or rare backs.\n\nBelow is my Have list (eg cards I already have from the set). I’m fine accumulating dupes if they’re part of a larger lot.\n\nThanks!\nDavid\n\n——————————-\nHave list:\n\nAbbaticchio (blue sleeves), Abbaticchio (brown sleeves), Abbott, Abstein, Ames (hands above head), Anderson, Armbruster, Arellanes, Ball (Cle.), Barbereau, Barry (Mil.), Bastian, Batch, Bates, Beck, Becker, Bergen (w/ glove), Bescher (Portrait), Blackburne, Bowerman, Bradley (with bat), Bransfield, Bresnahan (portrait), Bridwell (no cap), Bridwell (w/ cap), Geo. Brown (Wash.), M. Brown (portrait), M. Brown (Chicago on shirt), Burch (throwing), Burchell, Camnitz (arms folded),  Camnitz (arms in air),  Carrigan,  Chappelle,  Cicotte, Clancy, Clark (Columbus), Clymer, Cobb (portrait green), Conroy (batting), Controy (fielding), Covaleski, Cravath, Crawford, Cree,  Criger, Cross, H. Davis (Phil. throwing), H. Davis (Phil. Catching), Delehanty (Wash.), Devlin, Donlin (w/ bat), Donlin (fielding), Donlin (sitting), Donovan (portrait), Donovan (throwing), Doolan (fielding), Dorner, Downey (batting), Downey (fielding), Downs, Doyle (portrait), Dubuc, Dunn (Balt.), Dunn (Brooklyn), Dygert, Egan, Evers (Yellow sky/Chicago on shirt), Ewing, Evans, Ferris, Fiene (throwing), Flanagan, Flick, Ford, Freeman, Fromme, Gandil, Ganley, Ganzel, Gasper, Gibson, Gilbert, Graham (StL), Grimshaw, Groom, Hall, Hallman, Hannifan, Herzog (NY Nat'l), Hinchman (Cle), Hinchman (Tol.), Hofman, D. Hoffman (St. L), Howard (batting), Huggins (hands), Hunter, Isbell, Jacklitsch, Jackson (Balt.), F. Jones (Chi. Portrait), F. Jones (Standing), T. Jones (St. L), Tim Jordan (Portrait), Joss (pitching), Joss (portrait), Keeler (bat), Kelley, Killian (Portrait), Kissinger, Knight (with bat), Knight (portrait), Konethcy (glove high), Kroh, Kruger, Lajoie (throwing), Lake (NY), Lake (St. L ball in hand), Lake (STL no ball), Latham, Lattimore, Lavender, Leach (bending), Leach (portrait), Lord, Magee (batting), Magee (portrait), Maloney, Manning (batting), Manning (pitching),  Marquard (throwing), McAleese, Mcbride, McGann, McGlynn, McIntyre (Brooklyn & Chicago),  McIntyre (Detroit), Mcginley, McLean,  McGraw (finger in air), McQuillan (fielding), Merkle (throwing), Milan, D. Miller (Pitt), M. Miller (Dallas),  Mitchell (Cincy), Moeller, Mowrey, Mullen, Mullin (w/ bat), Murray (portrait), Myers (batting), Nichols (batting), Niles, Oakes, Oldring (batting), Oldring (fielding), O'Leary (hands on knees), O'Leary (portrait), Overall (hands at face/building in background), Parent, Paskert, Pastorius, Pattee, Pfeffer, Phelan (need upgrade), Phelps, Phillippe, Pickering, Powell, Purtell, Quinn, Randall, Raymond, Rhoades (hands at chest), Ritchey, Ritter, Rucker (throwing), Rudolph, Schaefer (Detroit), Schlafly, Schirm, Schlei (batting), Schlei (fielding), Schreck, Scott, Seitz, C. Seymour (batting), Shaw (Providence), Shaw (St. Louis), Shipke, F. Smith (dark hat), Snodgrass (batting), Spade, Stahl (no glove), Starr, Stone, Stovall (portrait), Strang,  Street (portrait), Sullivan, Summers, J. Sweeney (NY Amer.), Tannehill (Chi. Throwing), J. Tannehill (Wash.), Tenney, Thomas, Wallace, Walsh, Warhop, White (Buffalo), Wilhelm (bat), Wilhelm (chest), Willis (batting), Willett, Willetts, Wiltse (pitching), C. Young (glove), I. Young.",
      "post_time": "20181111T06:26:23-06:00",
      "timestamp": "1541942783"
    }
  ]
}