{
  "id": "227486",
  "forum_id": "39",
  "title": "WTB: T206 Portraits (No Hat) in poor condition",
  "author": "wnp22",
  "reply_count": 3,
  "view_count": 290,
  "created_date": null,
  "last_reply": "20161006T22:20:57-06:00",
  "posts": [
    {
      "post_id": "1576485",
      "post_title": "WTB: T206 Portraits (No Hat) in poor condition",
      "post_author_name": "wnp22",
      "post_content": "Well gents, the pre-war bug has finally bitten me.  For my first foray into the era, I've decided to delve in to my favorite cards of The Monster - Portraits.  Specifically, portraits without hats (ala Cobb, Wagner, etc).  To keep it relatively manageable to begin, I'm just going to be picking up cards in relatively poor condition.  Raw or slabbed doesn't matter.  Any back.  Not looking for total scrap, but nothing that would probably grade over a PSA 2.  I'm starting with a blank slate, so shoot me a PM if you have something you think I'd be interested in.  Not looking to spend over $35 a card to start.  Thanks and hope to hear from y'all!\r\n\r\n--Nick",
      "post_time": "20160824T16:06:29-06:00",
      "timestamp": "1472076389"
    },
    {
      "post_id": "1587192",
      "post_title": "",
      "post_author_name": "wnp22",
      "post_content": "Just wanted to bump this up and see what's out there before I hit up ebay this week.  Minimal funds at the moment, so just looking for 1 card with a max price of $50 at the moment.  Technical grade doesn't matter to me, just eye appeal.  Also willing to look at raw.  I already have:\n\nBatch\nChase - Pink\nDahlen\nDooin\nPerring \nRhodes\n\nThanks to those that I've already made deals with, and thanks for looking at this.",
      "post_time": "20160921T17:00:29-06:00",
      "timestamp": "1474498829"
    },
    {
      "post_id": "1590105",
      "post_title": "",
      "post_author_name": "wnp22",
      "post_content": "Bump.  Looking to pick up a couple low grade or a nice mid grade.  Let me know what you e got!  Thanks guys",
      "post_time": "20161001T19:45:10-06:00",
      "timestamp": "1475372710"
    },
    {
      "post_id": "1591694",
      "post_title": "",
      "post_author_name": "wnp22",
      "post_content": "Bump.  Got a $50 gift card on PayPal burning a hole in my pocket.  Just looking for one portrait (no hat) right now with a $50 max.  Prefer graded, but would entertain raw.  Thanks a bunch!",
      "post_time": "20161006T22:20:57-06:00",
      "timestamp": "1475814057"
    }
  ]
}