{
  "id": "194419",
  "forum_id": "39",
  "title": "FS: 79 Different T206 Commons + HOF + SL + Tough(ish) Backs ++",
  "author": "btcarfagno",
  "reply_count": 4,
  "view_count": 719,
  "created_date": null,
  "last_reply": "20141001T00:48:50-06:00",
  "posts": [
    {
      "post_id": "1325940",
      "post_title": "FS: 79 Different T206 Commons + HOF + SL + Tough(ish) Backs ++",
      "post_author_name": "btcarfagno",
      "post_content": "The following cards are available. Scans are available upon request.\n\nAnderson Providence Piedmont 350 VG+ $27\n\nBarry Milwaukee Piedmont 350 No Name Clipped corner otherwise VG $50\n\nBeckley (HOF) Kansas City Piedmont 350 Clipped corner otherwise VG/EX+ $22\n\nBell Brooklyn (Follow Through) Piedmont 460 Fact 25 VG/EX $45\n\nBell Brooklyn (Hands Above Head) Sweet Caporal 350 VG+ $27\n\nBender (HOF) Athletics (Trees) Sweet Caporal 350 Clipped corner otherwise VG $48\n\nBergen Brooklyn (Catching) Piedmont 460 Fact 25 Double Name EX $80\n\nBescher Cincinnti (Hands In Air) Piedmont 460 Fact 25 VG/EX+++ $55\n\nBliss St Louis Piedmont 350 Clipped corner otherwise EX/MT++ $20\n\nBradley Cleveland (With Bat) EX+ $80\n\nBresnahan (HOF) St Louis (With Bat) Piedmont 350 Clipped corner otherwise VG/EX $25\n\nBridwell Giants (Portrait) Sovereign 350 Forest Green VG/EX $65\n\nBrown Washington Sweet Caporal 350 Fair $65\n\nM Brown (HOF) (Chicago On Shirt) Piedmont 350 Clipped corner otherwise VG $75\n\nCamnitz Pittsburgh (Arm At Side) Piedmont 460 Fact 25 VG $25\n\nChance (HOF) Chicago (Portrait Yellow) Piedmont 350 Clipped corner otherwise EX/MT $45\n\nChase New York (Holding Trophy) Piedmont 460 Fact 25 GOOD $40\n\nCollins (HOF) Athletics Piedmont 350 Clipped corner otherwise VG/EX+ $55\n\nConroy Washington (With Bat) Piedmont 460 Fact 25 Good $18\n\nCrandall Giants (Portrait With Cap) Piedmont 460 Fact 25 EX $70\n\nCriss St Louis Sweet Caporal 350 VG $25\n\nDavis Athletics (Davis On Front) Sweet Caporal 350 VG+ $32\n\nDoolan Phillies (Batting) Piedmont 350 Clipped corner otherwise NM/MT $28\n\nDougherty White Sox (Portrait) Sweet Caporal 350 VG+ $35\n\nEvers (HOF) Cubs (Chicago On Shirt) Sweet Caporal 350 Clipped corner otherwise EX $55\n\nFrill Yankees Piedmont 460 Fact 25 VG/EX $45\n\nGriffith (HOF) Cincinnati (With Bat) Piedmont 350 Clipped corner otherwise EX (O/C) $45\n\nGriffith (HOF) Cincinnati (Portrait) Piedmont 350 Clipped corner otherwise VG Double Red Color Pass $75\n\nHerzog New York Piedmont 350 VG $25\n\nJackson Baltimore Piedmont 350 FR/GD $15\n\nKarger Cincinnati Piedmont 150 VG $25\n\nKrause Athletics (Portrait) Piedmont 350 Clipped corener otherwise NM $24\n\nKonetchy St Louis (Glove High) Piedmont 150 VG $25\n\nLatham Giants Piedmont 460 Fact 25 EX $70\n\nLindaman Braves Piedmont 150 VG $25\n\nLundgren Kansas City Piedmont 350 Clipped corner otherwise VG/EX+ $15\n\nMagee Phillies (Batting) Piedmont 350 VG/EX (dirt on back) $45\n\nMarquard (HOF) Giants Portrait Piedmont 350 Clipped corner otherwise VG/EX $25\n\nMarquard (HOF) Giants (Both Arms) Sweet Caporal 150 Fair $42\n\nMarquard (HOF) Giants (Throwing) Piedmont 460 Fact 25 EX (O/C tiny bit of other card on back) $75\n\nMcGraw (HOF) Giants (Portrait With Cap) Piedmont 350 Good $65\n\nMcGraw (HOF) Giants (Glove At Hip) Piedmont 460 EX $260\n\nMcGraw (HOF) Giants (Portrait) Sweet Caporal 150 Trimmed $70\n\nMcGraw (HOF) Giants (Finger In Air) Piedmont 350 Clipped corner otherwise VG $40\n\nMerritt Jersey City Polar Bear VG+ $30\n\nMurphy Athletics (Batting) Piedmont 460 Fact 25 EX+ $80\n\nMurray Giants (Portrait With Cap) Piedmont 460 EX $75\n\nNicholls Athletics (Hands On Knees) Piedmont 150 GD+ $23\n\nNichols Athletics (Batting) Sweet Caporal 350 VG/EX $45\n\nO'Leary Detroit (Hands On Knees) Piedmont 350 VG/EX $45\n\nOwen White Sox Piedmont 350 VG/EX $45\n\nPastorius Brooklyn Piedmont 350 VG/EX-EX $55\n\nPelty St Louis (Vertical) Piedmont 350 VG/EX $45\n\nPfeffer Chicago Cubs (Batting) Piedmont 460 EX $75\n\nPfeister Chicago (Throwing) Piedmont 350 Good $18\n\nRhoades Cleveland (Throwing) Piedmont 350 VG $25\n\nRockenfeld Montgomery (Southern League) Piedmont 350 Clipped corner otherwise VG/EX $35\n\nSchaefer Washington (Throwing) Piedmont 460 Fact 25 EX/MT $90\n\nSchmidt Detroit (Throwing) Sweet Caporal 150 Fact 649 Overprint EX/MT $115\n\nSchlei Giants (Portrait With Cap) Sweet Caporal 460 Fact 30 VG+ $28\n\nSeymour Giants (Throwing) Sweet Caporal 460 Fact 42 EX $120\n\nShaughnessy Roanoke (Southern League) Piedmont 350 Clipped corner otherwise VG/EX $60\n\nSmith Brooklyn (Throwing) Piedmont 460 Fact 25 VG/EX $45\n\nSmith Shreveport (Southern League) Old Mill Clipped corner otherwise EX $35\n\nSpencer Red Sox (Throwing) Piedmont 150 GD/VG $23\n\nStahl Red Sox Sweet Caporal 150 VG $25\n\nStovall Cleveland (With Bat) Piedmont 460 Fact 25 EX+ $80\n\nStreet Washington (Catching) Piedmont 350 EX+ $80\n\nSweeney New York (Catching) Piedmont 350 VG+ $28\n\nTannehill White Sox (L. Tannehill) Piedmont 350 Good $18\n\nTannehill White Sox (Tannehill) Piedmont 460 Fact 25 EX $75\n\nThebo Waco (Southern League) Piedmont 350 Corner clipped otherwise EX $35\n\nWalsh (HOF) White Sox Portrait Piedmont 350 FR/GD $65\n\nWestlake Danville (Southern League) Piedmont 350 Clipped corner otherwise VG/EX $35\n\nWhite Houston (Southern League) Piedmont 350 Clipped corner otherwise VG/EX $35\n\nWillett Detroit (Batting) Piedmont 350 Clipped corner otherwise VG $12\n\nWillis (HOF) Pittsburgh (Portrait) Sweet Caporal 350 VG $85\n\nWillis (HOF) St Louis (Throwing) Piedmont 350 Clipped corner otherwise EX $45\n\nWiltse Giants Portrait Piedmont 460 VG $25\n\n\nOr....if someone feels the need....I would sell the entire lot for $3400.",
      "post_time": "20140923T10:06:35-06:00",
      "timestamp": "1411488395"
    },
    {
      "post_id": "1325964",
      "post_title": "",
      "post_author_name": "jlehma13",
      "post_content": "PM sent on Lundgren, Willett and Beckley.",
      "post_time": "20140923T10:44:29-06:00",
      "timestamp": "1411490669"
    },
    {
      "post_id": "1326058",
      "post_title": "",
      "post_author_name": "Bpm0014",
      "post_content": "I'll take the Merritt.  May I see a pic first please?\r\n\r\nbmullen0014@aol.com",
      "post_time": "20140923T14:17:59-06:00",
      "timestamp": "1411503479"
    },
    {
      "post_id": "1328836",
      "post_title": "",
      "post_author_name": "Bpm0014",
      "post_content": "Would still like a pic of Merritt before I purchase it. Thanks.",
      "post_time": "20140930T22:13:15-06:00",
      "timestamp": "1412136795"
    },
    {
      "post_id": "1328869",
      "post_title": "",
      "post_author_name": "jasonc",
      "post_content": "I do not know if that card is scanned, but a majority of these cards are all scanned in other previous threads.\r\n\r\nPM sent on about half of the lot.",
      "post_time": "20141001T00:48:50-06:00",
      "timestamp": "1412146130"
    }
  ]
}