{
  "id": "172648",
  "forum_id": "39",
  "title": "FS/FT:  T206 Evers/Kleinow Highest PSA Graded",
  "author": "sreader3",
  "reply_count": 2,
  "view_count": 386,
  "created_date": null,
  "last_reply": "20130719T20:07:36-06:00",
  "posts": [
    {
      "post_id": "1160324",
      "post_title": "FS/FT:  T206 Evers/Kleinow Highest PSA Graded",
      "post_author_name": "sreader3",
      "post_content": "Looking to possibly move the following T206s that have the highest PSA grades for their front/back combos.  Kleinow (Boston) Old Mill PSA 6 is 1/1 none higher in the PSA pop report whereas Evers (Yellow Sky) Tolstoi PSA 5 was graded before PSA started tracking backs but would be 1/1 none higher if it were included in the report.  The scans pretty much tell the story.  Evers has a slight diamond cut (top and bottom) and a minor ding to the upper right corner.  The imperfection at the lower left corner of Kleinow isn't a ding as far as I can tell--just a light stain.\n\nNow on pricing.  The last public sale of an Evers Tolstoi was an SGC 50 (lower than the one offered here) at $2,861 with juice in Goodwin last month.  I'm asking $1,900 delivered for Kleinow and $2,900 delivered for Evers.  Personal check or paypal gift.  Will entertain trades for PSA 5+ T206s that I need--common or uncommon backs.  First committed email to sarpc at qwestoffice dot net gets the card.  Will read PMs but emails have priority.  Will pull the cards off the BST in a couple days and keep them for (at least) a while longer if there is no interest.  Thanks.  Scot",
      "post_time": "20130719T17:41:09-06:00",
      "timestamp": "1374277269"
    },
    {
      "post_id": "1160366",
      "post_title": "",
      "post_author_name": "Rob D.",
      "post_content": "Good to see you posting again, Scot.",
      "post_time": "20130719T19:04:43-06:00",
      "timestamp": "1374282283"
    },
    {
      "post_id": "1160398",
      "post_title": "",
      "post_author_name": "sreader3",
      "post_content": "[quote name=\"Rob D.\" post=1160366]Good to see you posting again, Scot.[/QUOTE]\r\n\r\nRob, Thanks for your kind words.  I am mainly on the BST these days but you never know.  Hope all is well.  Scot",
      "post_time": "20130719T20:07:36-06:00",
      "timestamp": "1374286056"
    }
  ]
}