{
  "id": "267423",
  "forum_id": "39",
  "title": "Yes, I am still looking for signed T206 cards",
  "author": "T206Collector",
  "reply_count": 7,
  "view_count": 548,
  "created_date": null,
  "last_reply": "20190601T06:55:27-06:00",
  "posts": [
    {
      "post_id": "1866190",
      "post_title": "Yes, I am still looking for signed T206 cards",
      "post_author_name": "T206Collector",
      "post_content": "[quote name=\"calvindog\" post=1865983]Frankly, I think everyone has the same concerns about autograph authenticity whether it be SGC, PSA, JSA, etc.[/QUOTE]\n\n[quote name=\"Runscott\" post=1865871]Buying an expensive autograph based entirely on JSA or PSA is foolishness.[/QUOTE]\n\n[quote name=\"OldSchoolBaseball\" post=1830495]Those T206, Goudey, etc vintage autograph collections are loaded with fakes.  And if they are not, everyone will think so anyway.[/QUOTE]\n\n[quote name=\"tab\" post=1830551]I have never been interested in autographs for this reason. Way too easy for some people to copy a signature.  I’m sure there are tons of fakes out there.  Why trust an “experts” opinion.[/QUOTE]\n\n[quote name=\"vintagebaseballcardguy\" post=1830568]Aside from disgust at the forger, I am thinking this brings into question most any autograph that has ever been authenticated.[/QUOTE]\n\n[quote name=\"HobokenJon\" post=1830599]And think about it . . . How would anyone know if a purported autograph of an obscure ballplayer from 100+ years ago was real, even in the absence of forensic evidence that it was fake?[/QUOTE]\n\n[quote name=\"Buythatcard\" post=1872967]I would never purchase an autograph unless I see it get signed myself.[/QUOTE]\n\n[quote name=\"Throttlesteer\" post=1873041]Nothing is safe anymore unless you obtained the signature in person.[/QUOTE]\n\n\nHi,\n\nIf you're one of the many Net54 collectors that has grown disgruntled with the autographed pre-war card market, it would be hard to blame you.  If you spent your hard earned money on autographed cards, no one could fault you for thinking that you've been hung out to dry by third-party authenticators that missed the boat.  Perhaps you are worried about whether the cards have any value left, and maybe there is good reason to worry.\n\nWhile the boat may be sinking, there is still one person - me - willing to buy a ticket for the ride.  In particular, I am looking for any signed pre-war cards that were certified by SGC, JSA, PSA or Beckett prior to 2015.  \n\nIf you'd like to divest yourself of your signed T206 (or other pre-1915) cards please feel free to contact me at [url]SignedT206@gmail.com[/url]\n\nAsk me about my policy of trying to \"reimburse\" you for the price you paid to buy the card, if you bought it at auction prior to 2015.\n\nThe signed T206 scandal is a problem for our hobby, but it no longer has to be your problem.  Make it my problem.  I may just pay you for the privilege!",
      "post_time": "20190329T11:19:10-06:00",
      "timestamp": "1553879950"
    },
    {
      "post_id": "1866246",
      "post_title": "Paul. I have one ...",
      "post_author_name": "Howe’s Hunter",
      "post_content": "Kid Elberfeld. Signed when he was a kid. In sharpie. Interested?",
      "post_time": "20190329T14:23:47-06:00",
      "timestamp": "1553891027"
    },
    {
      "post_id": "1866248",
      "post_title": "",
      "post_author_name": "T206Collector",
      "post_content": "[quote name=\"StuckInOmaha\" post=1866246]Kid Elberfeld. Signed when he was a kid. In sharpie. Interested?[/QUOTE]\r\n\r\nThanks, but I'm going to pass.  Since his name was Kid, all Kid Elberfeld cards were signed when he was a kid.\r\n\r\nBut I appreciate the offer!",
      "post_time": "20190329T14:39:02-06:00",
      "timestamp": "1553891942"
    },
    {
      "post_id": "1866250",
      "post_title": "",
      "post_author_name": "JoeRand",
      "post_content": "how do you know for sure when something was graded?",
      "post_time": "20190329T14:43:19-06:00",
      "timestamp": "1553892199"
    },
    {
      "post_id": "1866260",
      "post_title": "",
      "post_author_name": "T206Collector",
      "post_content": "[quote name=\"JoeRand\" post=1866250]how do you know for sure when something was graded?[/QUOTE]\n\nGreat question.  I would be looking for evidence of a sale prior to 2015, like ebay or an auction house.  Beyond that, obviously full JSA LOAs are dated.  \n\nSGC authenticated autographed cards with the green label, either with JSA, or without (beginning Mike Root era circa 2013), are pre-2015.  The SGC Authentic red label began no later than October 2015.\n\nPSA original red label and blue label are pre-2015.  PSA red label with the hologram on the front of the flip are circa 2015 and later.\n\nBeckett JSA dual-cert on flip existed pre-2016.\n\nFinally, I will still consider cards sold/authenticated in 2015 and later if there is proof of the signature's existence prior to 2015.  So, an SGC Authentic red label may be fine with me, if you can show evidence of the autograph's existence prior to 2015 (e.g., 2007 Great Pittsburgh Find, or even the Tom Marsilio collection sold by Steiner in May 2018).",
      "post_time": "20190329T15:18:42-06:00",
      "timestamp": "1553894322"
    },
    {
      "post_id": "1870553",
      "post_title": "",
      "post_author_name": "T206Collector",
      "post_content": "Three purchased - including Snodgrass (Pittsburgh Find), Jones (Morey Collection), and Marquard Portrait (PSA Red Label, no hologram/lighthouse).\n\nI’m still buying!  Please let me know what you’ve got available...",
      "post_time": "20190415T20:09:41-06:00",
      "timestamp": "1555380581"
    },
    {
      "post_id": "1875960",
      "post_title": "",
      "post_author_name": "T206Collector",
      "post_content": "ttt",
      "post_time": "20190508T08:03:00-06:00",
      "timestamp": "1557324180"
    },
    {
      "post_id": "1883236",
      "post_title": "",
      "post_author_name": "T206Collector",
      "post_content": "ttt",
      "post_time": "20190601T06:55:27-06:00",
      "timestamp": "1559393727"
    }
  ]
}