{
  "id": "229981",
  "forum_id": "39",
  "title": "FS T206 Red Cobb BVG 2.5 Piedmont Fact.25 *SOLD*",
  "author": "JustinD",
  "reply_count": 2,
  "view_count": 451,
  "created_date": null,
  "last_reply": "20161016T15:50:22-06:00",
  "posts": [
    {
      "post_id": "1594196",
      "post_title": "FS T206 Red Cobb BVG 2.5 Piedmont Fact.25 *SOLD*",
      "post_author_name": "JustinD",
      "post_content": "Hello all, \r\n\r\nTime to get the son a starter car so putting a couple extras up over the next few weeks. Not in desperate straights so if they go, they go...if not no biggie. \r\n\r\nFirst up is this Red Cobb, he's currently in a BVG holder that is 11 years old so it's a little fuzzy on the plastic but the card is clean and shows no surface scuffing or pull back on the corners. There is one visible with a loupe wrinkle that is sort of pointing between the n and t in piedmont on the back. I doubt it is visible in a photo or scan, so I am pointing it out. The discolor in the photo near the factory mark is only a shadow from me. The card is amazingly clean and has great corners for 2.5. The faint discoloring on the back is most likely an (to me) unrecognizable wet sheet light ghosting. It does not look like dirt. \r\n\r\nI know there are the BVG haters on the board, but this is a nice card and was graded in 06' when Beckett was thinking a 100 year old card should look like a new refractor. I have never found the time to submit for a new clean case and regrading. With a new case this is going to be a centerpiece card. \r\n\r\nI am asking *Sold* firm PPFF which includes insured shipping. \r\n\r\nPayment is expected within 72 hours please unless otherwise arranged.",
      "post_time": "20161016T11:06:06-06:00",
      "timestamp": "1476637566"
    },
    {
      "post_id": "1594246",
      "post_title": "",
      "post_author_name": "gnaz01",
      "post_content": "Beauty Justin, GLWS",
      "post_time": "20161016T15:02:05-06:00",
      "timestamp": "1476651725"
    },
    {
      "post_id": "1594255",
      "post_title": "",
      "post_author_name": "JustinD",
      "post_content": "Thank you Greg.",
      "post_time": "20161016T15:50:22-06:00",
      "timestamp": "1476654622"
    }
  ]
}