{
  "id": "173797",
  "forum_id": "39",
  "title": "FT: T206 Rare Backs",
  "author": "DerekMichael",
  "reply_count": 0,
  "view_count": 363,
  "created_date": null,
  "last_reply": "20130809T01:44:30-06:00",
  "posts": [
    {
      "post_id": "1168772",
      "post_title": "FT: T206 Rare Backs",
      "post_author_name": "DerekMichael",
      "post_content": "Hello, and thank you for taking the time to look at my listing.\n\nI wanted to attempt a possible trade, should anyone be interested. For roughly two+ months, I have attempted to acquire a Hughie Jennings (both hands/dancing) with an American Beauty 460 reverse. Unfortunately, I have only seen two examples in that time, one of which belongs in a legit collector who wanted to hang onto the card, and another which had writing all over the back. \n\nI am looking for a solid example. Nothing spectacular really, just something that is pleasant to look at (i.e. no writing, no severe creasing, no destructive paper loss etc. etc.). The technical grade is of no real consequence. If anyone has one that they are interested in turning over, I have the following two cards which I would be willing to trade:\n\nJohn McGraw (HOF)\nPortrait, No Cap\nHindu-Brown\nSGC 10 1\n\nThis is a fairly interesting card, in my opinion. You will notice the obvious writing and stamp on the back. It reads: \"Frederick Benedict Gessner\", and in a calligraphy style writing: \"Princeton\". You will also notice the initials \"f.b.g.\".\n\nI found it interesting, in that a similar T206 popped up recently (I had actually tried to add this card to my collection at one point, but it did not materialize as it had already been submitted to auction when I inquired):\n\n[url]http://goodwinandco.com/LotDetail.aspx?inventoryid=25646[/url]\n\nYou will notice that the Greminger(SL) appears to share the same former owner as my McGraw. It also is a Brown Hindu. They both appear to have spent time in a scrap book as well, as my McGraw had a small amount of residue from the page of the scrap book. Nothing too crazy, but I thought that was kind of cool. \n\nDoes anyone have any idea who this guy was?\n\nSam Crawford (HOF)\nWith Bat\nAmerican Beauty 350-No Frame\nSGC 40 3\n\nThis is a nice looking card, and has a unique cut to it. I believe it is called a \"diamond cut\", but I will leave that to those who are more knowledgable than I.\n\nIf you are interested in a making a trade (cash is an option as well, if necessary), please feel free to send me a PM.\n\nThank You Very Much for Your Time.\n\nDerek",
      "post_time": "20130809T01:44:30-06:00",
      "timestamp": "1376034270"
    }
  ]
}