{
  "id": "225759",
  "forum_id": "39",
  "title": "SOLD --- LOT of (107) T206s with HOFs, rarer backs",
  "author": "Cozumeleno",
  "reply_count": 2,
  "view_count": 360,
  "created_date": null,
  "last_reply": "20160721T09:53:28-06:00",
  "posts": [
    {
      "post_id": "1563924",
      "post_title": "SOLD --- LOT of (107) T206s with HOFs, rarer backs",
      "post_author_name": "Cozumeleno",
      "post_content": "** SOLD **\r\n\r\nI really wanted to avoid selling these, but could use the funds for T205 and T207 cards. This is a second set of T206 cards I had been working on. The project sort of stalled as I picked up more T205s lately and I'm calling off the dogs on this one. \r\n\r\nReluctantly up for sale here is a huge lot of (107) T206s. If you ever wanted a bunch in one shot or wanted a great head start to a LOW-GRADE set, this is it. This is nearly 1/4 of the entire set and there are NO doubles here.\r\n\r\nAlso included are many non-commons and some rarer backs.\r\n\r\nHighlights include:\r\n\r\n* Dahlen BROOKLYN (major back paper loss)\r\n* Elberfeld WASHINGTON (Paper added)\r\n* EIGHT Southern Leaguers (Bernard (Old Mill), Guiheen, Hart, Lipe, Seitz, Carlos Smith, Stark, White)\r\n* Two Hall of Famers (Bender Trees, Griffith (Polar Bear))\r\n* Some Non-Common Stars (Chase Blue Portrait, Chase Dark Cap, Chase Trophy, Dahlen Boston)\r\n* Several slightly tougher commons/minor stars (Demmitt, Doyle, Kleinow catching, Pfeister seated, Schaefer Washington, Both Schultes, Snodgrass catching, Stahl glove, etc.)\r\n\r\nAlso included are some rarer backs, including:\r\n\r\n* 8 Polar Bears\r\n* 3 Sovereigns, including a 460\r\n* 2 Old Mills\r\n\r\nThe Dahlen Brooklyn and Elberfeld Washington are probably the most difficult to find in the set minus the Big Four, and Demmitt/O'Hara St. Louis'. \r\n\r\nAgain, these cards are low-grade. See scans for details. The overwhelming majority are Poor or Fair. Some may consider a few of them as Good but I'm not making any specific claims to specific grades since can be pretty subjective. But consider these low-grade cards. Many flaws exist such as creasing, trimming, paper loss, pin holes, etc. Some are better and some are worse. Many have presentable fronts, backs, or in some cases, both.\r\n\r\nIf you are interested to know more about individual condition of any card, please send me a message and I'll gladly give you more of a rundown. Regarding backs, please note that these were scanned then flipped so the backs are in opposite order as the fronts. If you have a question about a specific combo, please feel free to ask.\r\n\r\nI am not interested in selling individually at this time - this is being sold for now as all one lot. Asking price is SOLD via PPFF OR add 3% for regular Paypal. Check/Money Order is fine, too. Price includes free insured shipping.\r\n\r\nThank you for looking.",
      "post_time": "20160720T17:30:22-06:00",
      "timestamp": "1469057422"
    },
    {
      "post_id": "1563925",
      "post_title": "",
      "post_author_name": "Cozumeleno",
      "post_content": "Additional scans ...",
      "post_time": "20160720T17:31:44-06:00",
      "timestamp": "1469057504"
    },
    {
      "post_id": "1564101",
      "post_title": "Sold",
      "post_author_name": "Cozumeleno",
      "post_content": "Sold",
      "post_time": "20160721T09:53:28-06:00",
      "timestamp": "1469116408"
    }
  ]
}