{
  "id": "272083",
  "forum_id": "39",
  "title": "FS: T206 Raw Collection New To Hobby 118 cards WaJo port Cy PB SLers Many Mid+ Grade",
  "author": "btcarfagno",
  "reply_count": 5,
  "view_count": 551,
  "created_date": null,
  "last_reply": "20190807T20:59:27-06:00",
  "posts": [
    {
      "post_id": "1906293",
      "post_title": "FS: T206 Raw Collection New To Hobby 118 cards WaJo port Cy PB SLers Many Mid+ Grade",
      "post_author_name": "btcarfagno",
      "post_content": "Technically this is the same collection I started parsing up two years ago, as my consignor is looking to possibly sell the remaining cards as one lot. As a brief history, my consignor was a flea market dealer in the 1970's and early 1980's and built up this collection at that time. There are, therefore, no malicious trims if there are any trims at all which I highly doubt. About two years ago I opened the collection up selling it on Net54 on a card-by-card basis. Quite a few cards were purchased, some of which were subsequently graded with surprisingly better than expected results on the whole.\n\nI try to be conservative with the grades that I show.\n\nHighlights of the collection:\n\nJimmy Hart SL - Piedmont Back - about EX\nMerritt - PB Back - About EX\nWiltse Pitching - PB Back - about EX\nManning Pitching - PB Back - about EX+\nDoyle Batting - Tolstoi Back - about EX\nMordecai Brown  Portrait - Piedmont back - about VG/EX\nMordecai Brown Throwing - Sweet Cap back - about VG\nWalter Johnson Portrait - Piedmont back - Looks VG/EX but has slightest surface wrinkle that may bring technical grade to 2.5 or 3\nCy Young Bare Hand - Sweet Cap back - about Fair\nCy Young Glove Shows - Polar Bear back - about GD/VG\n\nAlso HOFers valued in the $100-200 range including:\n\nMarquard Portrait\nChance Chicago On Shirt\nMcGinnity\nMarquard Hands At Things\nJennings One Hand\nHuggins Hands At Mouth\n\nAlso, of the remaining commons and semi-stars, 70% are VG or better...some likely EX+.\n\nVery few cards would grade poor or fair. Maybe 8 total out of the 118 cards. The rest are GD or better with 70% VG or better.\n\nBacks are mostly Sweet cap and Piedmont with 16 Polar Bear, 3 Sovereign and one Old Mill (SLer).\n\nAgain, part of the value of this group is that you will know with 100% certainty that the cards are free of any possible malicious trimming. Because of the background of the cards and because more than half of this collection has already been sold to Net54 members and there were ZERO returns from those cards.\n\nI am TAKING OFFERS for the lot. \n\nIf you might be willing to MAKE ME AN OFFER on the lot (without asking \"what are you looking to get\") please PM me and I will send you a link with the scans and full list of cards available. \n\nThanks for your time!",
      "post_time": "20190807T08:43:09-06:00",
      "timestamp": "1565188989"
    },
    {
      "post_id": "1906383",
      "post_title": "",
      "post_author_name": "blametony",
      "post_content": "It would be tremendously helpful if we had even some sort of ballpark figure as to what the seller is looking for with this lot.",
      "post_time": "20190807T12:56:12-06:00",
      "timestamp": "1565204172"
    },
    {
      "post_id": "1906483",
      "post_title": "Pm sent",
      "post_author_name": "Gradedcardman",
      "post_content": "Pm sent",
      "post_time": "20190807T18:58:40-06:00",
      "timestamp": "1565225920"
    },
    {
      "post_id": "1906484",
      "post_title": "PB",
      "post_author_name": "tothrk",
      "post_content": "If someone reaches a deal for these and wants to sell the polar bears, I’d be interested. Thx.  Bob",
      "post_time": "20190807T19:04:02-06:00",
      "timestamp": "1565226242"
    },
    {
      "post_id": "1906507",
      "post_title": "",
      "post_author_name": "eliotdeutsch",
      "post_content": "Please resend the link. Or can someone forward me a working one?",
      "post_time": "20190807T20:53:38-06:00",
      "timestamp": "1565232818"
    },
    {
      "post_id": "1906509",
      "post_title": "",
      "post_author_name": "btcarfagno",
      "post_content": "Sorry. Link resent. Hopefully it works this time!\r\n\r\nTom C",
      "post_time": "20190807T20:59:27-06:00",
      "timestamp": "1565233167"
    }
  ]
}