{
  "id": "291636",
  "forum_id": "39",
  "title": "Extremely Rare T-206 BLUE Old Mill Backed Card For Sale as part of Nov 20 REA Auction",
  "author": "hpkatz26",
  "reply_count": 8,
  "view_count": 929,
  "created_date": null,
  "last_reply": "20201113T14:25:07-06:00",
  "posts": [
    {
      "post_id": "2034102",
      "post_title": "Extremely Rare T-206 BLUE Old Mill Backed Card For Sale as part of Nov 20 REA Auction",
      "post_author_name": "hpkatz26",
      "post_content": "Hello to all fellow T-206 card collectors and Rare T-206 Back Collectors -\n\nUp for sale is one of the rarest T-206 cards - a rare front featuring an Elberfeld Washington portrait and arguably the rarest of all backs - a BLUE Old Mill back!  Only two of these cards have been authenticated to date.\n\nThis T-206 rarity will be sold at the upcoming Fall 2020 REA auction, which starts on Nov. 20 and ends on Dec. 6.  This card will open up for bidding at $5,000.  Pictures of this card will be featured in the upcoming Fall 2020 REA auction guide which can be viewed either on-line or in printed version so contact REA now and request your copy of their Catalog now.\n\nGood luck to all bidders and here is your opportunity to own this extremely rare T-206 card.  No collection would be complete without it!\n\nAn Update:  Lot #273 in Current REA Auction - Check it out!",
      "post_time": "20201111T12:18:00-06:00",
      "timestamp": "1605122280"
    },
    {
      "post_id": "2034374",
      "post_title": "",
      "post_author_name": "scottglevy",
      "post_content": "Good luck on the sale of a very interesting T-variation",
      "post_time": "20201112T06:27:17-06:00",
      "timestamp": "1605187637"
    },
    {
      "post_id": "2034378",
      "post_title": "",
      "post_author_name": "Rhotchkiss",
      "post_content": "[quote name=\"scottglevy\" post=2034374]Good luck on the sale of a very interesting T-variation[/QUOTE]\n\nThat’s what I am torn about- is it a variation or just a fluke? There was one and then two popped up this year. It is most definitely not regarded as a variation the way a brown old mill, brown Lenox or blank back is - we would need at least another dozen to surface for the to happen. But if another dozen did surface, than this one becomes much less rare. I am a major t206 back collector and I am confounded by this one.\n\nSorry to rain on your parade OP, but you did promote your card right here on the t206 BST page, where it does not belong (it belongs in another BST section), so let’s have a real discussion about what this really is. It is indeed blue, no doubt. And it is very cool. But variation vs just an odd coloring- not sure.",
      "post_time": "20201112T07:11:48-06:00",
      "timestamp": "1605190308"
    },
    {
      "post_id": "2034381",
      "post_title": "",
      "post_author_name": "Republicaninmass",
      "post_content": "In the past, outing upcoming auction items (not in their preview) in REA was frowned upon. \r\n\r\nGlws,",
      "post_time": "20201112T07:33:22-06:00",
      "timestamp": "1605191602"
    },
    {
      "post_id": "2034398",
      "post_title": "",
      "post_author_name": "Rhotchkiss",
      "post_content": "[quote name=\"Republicaninmass\" post=2034381]In the past, outing upcoming auction items (not in their preview) in REA was frowned upon. \r\n\r\nGlws,[/QUOTE]\r\n\r\nIts his auction and he is more than welcome to promote it - in the ebay, auction, and other venue section -- where, BTW, it was also listed/advertised by owner/consignor (seller is now REA).  Its a really cool card- I will likely be bidding.",
      "post_time": "20201112T08:32:58-06:00",
      "timestamp": "1605195178"
    },
    {
      "post_id": "2034400",
      "post_title": "",
      "post_author_name": "Republicaninmass",
      "post_content": "It was frowned upon by the old owner of REA\n\nSent from my SM-N950U using Tapatalk",
      "post_time": "20201112T08:39:09-06:00",
      "timestamp": "1605195549"
    },
    {
      "post_id": "2034405",
      "post_title": "",
      "post_author_name": "hpkatz26",
      "post_content": "Thanks for all the comments received to date.  The idea was to let collectors know that this card would be offered at auction so they would be aware of it coming up for sale and be able to bid on it if they wanted to.  No one is forcing anyone to bid on it.  So if you want to add this card to your collection great. \r\n Otherwise please don't feel forced to bid on it.  That's your choice.  I was just trying to make sure everyone was aware of this card coming up for auction. \r\n \r\nThank you all.",
      "post_time": "20201112T09:11:46-06:00",
      "timestamp": "1605197506"
    },
    {
      "post_id": "2034802",
      "post_title": "",
      "post_author_name": "Ronnie73",
      "post_content": "I'm not sure what to make of the \"Blue Ink\" either. And I own one. Using a microscope, I was at least able to determine that the blue color matches the Piedmont blue exactly (At least on mine). I've only seen blurry pictures of the Walsh and I haven't seen this Elberfeld Washington in person when it was being passed around during a show I believe last year. But everyone was in agreement that it wasn't black ink. I'm just curious if it's graded as a \"Blue Ink\" card or if it's just graded only. I believe that was the issue during the first attempt to sell this card at auction, was getting a TPG to confirm the \"Blue\" ink. That's why I never bothered to get mine graded. I know it's an authentic problem free card. I don't need a TPG to tell me that. If my card was to go on consignment, then I understand the need for a TPG opinion. But if the TPG doesn't put in the extra effort of matching up the color and confirming the matching print runs of these three cards, then I just don't feel they are doing as much as they could to determine what these cards actually are. I spent a lot of time comparing my card with other T206's and even other sets during that same time period that would have been printed by the same printer. Mine is a Piedmont match. But when I pulled out my over 4000 T59's and started noticing all the color variations of just blue, it was a bit overwhelming but obviously none rare because of the large quantities of each of the color variations.\n\nI forgot to add, I still haven't gotten around to searching all my other Print Group One Old Mills for any other \"Blue Ink\" variations. So who knows, there might be a fourth one. \n\n[IMG]http://www.unclenacki.com/5cards.jpg[/IMG]\n[IMG]http://www.myt206.com/net54/powellfront500.jpg[/IMG][IMG]http://www.myt206.com/net54/powellback500.jpg[/IMG]",
      "post_time": "20201113T10:36:54-06:00",
      "timestamp": "1605289014"
    },
    {
      "post_id": "2034876",
      "post_title": "",
      "post_author_name": "Luke",
      "post_content": "It's starting to seem pretty likely that there was just one sheet that got the blue by accident.\r\n\r\nI'd be interested in hearing what grade the card got and whether or not the TPG noted it as \"blue ink\" also.  We'll all see it soon anyway, but if the purpose of this thread is to advertise the card, might as well tell us some details about it.",
      "post_time": "20201113T14:25:07-06:00",
      "timestamp": "1605302707"
    }
  ]
}