{
  "id": "173784",
  "forum_id": "39",
  "title": "Slight off-center (reverse) T206 for Sale or Trade",
  "author": "aelefson",
  "reply_count": 3,
  "view_count": 527,
  "created_date": null,
  "last_reply": "20140522T18:46:04-06:00",
  "posts": [
    {
      "post_id": "1168697",
      "post_title": "Slight off-center (reverse) T206 for Sale or Trade",
      "post_author_name": "aelefson",
      "post_content": "Hi-\r\n       I am looking to sell the Schulte Sweet Caporal 350-460 card scanned below.  It has a large crease down the front, but the back is off-center enough to show the border of the card next to it.  \r\n       I know some people go crazy over these but I doubt this one has enough of a defect to be really valuable.  I am also having difficulty setting a price, but I know folks do not tend to even bother with a BST post unless it is priced.  \r\n        Therefore, I will throw out a price of 140.00 or best offer.  I think the price is too high myself, so please do not hesitate to offer what you think it is worth if you collect these.  I prefer emails over private messages or posts for offers.  I do apologize for the high price but I figured I would start somewhere.  I can send better scans if needed.  There is at least one other crease on the left corner of the card.\r\n         I will also accept trade offers for prewar items that fit my collection (19th and early 20th century ephemera, hall of famers and red sox stuff)\r\n\r\nAlan Elefson\r\n[url]aelefson@hotmail.com[/url]",
      "post_time": "20130808T20:39:24-06:00",
      "timestamp": "1376015964"
    },
    {
      "post_id": "1190615",
      "post_title": "Large Price Reduction 60/best offer",
      "post_author_name": "aelefson",
      "post_content": "Hi-\r\n       Obviously, I was way off on pricing this one.  It is now available for 60.00.  Or, if it is still too high, please let me know what you would be willing to pay.  I prefer emails, but pms are fine as well.  \r\nThanks,\r\nAlan",
      "post_time": "20130930T19:56:53-06:00",
      "timestamp": "1380592613"
    },
    {
      "post_id": "1192119",
      "post_title": "45.00",
      "post_author_name": "aelefson",
      "post_content": "Price lowered to 45.00.\r\n\r\nThanks,\r\nAlan",
      "post_time": "20131005T18:12:53-06:00",
      "timestamp": "1381018373"
    },
    {
      "post_id": "1279361",
      "post_title": "",
      "post_author_name": "aelefson",
      "post_content": "This card is now sold.\r\n\r\nHi-\r\n       I will lower this to 35.00 shipped if that piques anyone's interest.\r\n\r\nAlan",
      "post_time": "20140522T18:46:04-06:00",
      "timestamp": "1400805964"
    }
  ]
}