{
  "id": "193030",
  "forum_id": "39",
  "title": "Hinchman is no longer available",
  "author": "frankbmd",
  "reply_count": 2,
  "view_count": 372,
  "created_date": null,
  "last_reply": "20140831T18:49:12-06:00",
  "posts": [
    {
      "post_id": "1314884",
      "post_title": "Hinchman is no longer available",
      "post_author_name": "frankbmd",
      "post_content": "A deal has been accepted for this card.\r\n\r\nIf you are a Mud Hen collector, you may want this card.\r\nIf you are a Taylor collector, you may want this card.\r\nIf you are a double name collector, you may want this card.\r\nIf you are an incorrect image collector, you may want this card.\r\nIf you just like American Beautys, you may want this card.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/t206-raw/10939/hinchman-h-ab[/IMG]\r\n\r\nYes this card incorporates all of the above.  \r\n\r\nIt was posted in the Double Name thread a couple of years ago, where images of the Taylor name on top were posted.  It is also the only Double Name American Beauty back to be recognized here as well.  \r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/junk/19376/dn[/IMG]\r\n\r\nMore recently the Hinchman image on the card was shown to be an image of Bayard \"Call Me Bud\" Sharpe and not either of the Hinchmans.\r\n\r\n[url]http://www.net54baseball.com/showthread.php?t=182591&highlight=Hinchman+Sharpe[/url]\r\n\r\nSo in a nutshell you are looking at a unique double-name, incorrect image T206 with a rarer back in poor/fair condition.\r\n\r\nSo what is it worth.  You tell me.:confused:  I am open to sell it or trade it for a HOFer of comparable value whatever that value might be.  All I can be sure of is that it is not a \"scrap\", I think.:D\r\n\r\nPlease do not post offers on this thread, but rather PM me about what you are willing to pay or what you have to trade.  When I get an offer that I am considering, I will notify others who have made serious offers and set a deadline.   Since this is quite unique and there may be several interested parties, I want to try to be fair and give those parties a second shot. \r\n\r\nIf there are no reasonable offers, I will keep the card or consign it and let the chips fall where they may.",
      "post_time": "20140827T06:56:51-06:00",
      "timestamp": "1409144211"
    },
    {
      "post_id": "1314886",
      "post_title": "",
      "post_author_name": "ullmandds",
      "post_content": "Wow, frank...crazy card!  Good luck!",
      "post_time": "20140827T07:06:43-06:00",
      "timestamp": "1409144803"
    },
    {
      "post_id": "1316840",
      "post_title": "",
      "post_author_name": "frankbmd",
      "post_content": "Frank is still thinking..............",
      "post_time": "20140831T18:49:12-06:00",
      "timestamp": "1409532552"
    }
  ]
}