{
  "id": "247607",
  "forum_id": "39",
  "title": "Ed Abbaticchio Blue Sleeve PSA 7",
  "author": "Rynos23",
  "reply_count": 6,
  "view_count": 360,
  "created_date": null,
  "last_reply": "20171116T10:22:23-06:00",
  "posts": [
    {
      "post_id": "1720558",
      "post_title": "Ed Abbaticchio Blue Sleeve PSA 7",
      "post_author_name": "Rynos23",
      "post_content": "I picked up this card in an auction with a larger group. It's graded PSA 7 (mc)\r\nbut I question the MC as there is white border showing all the way around although the top is slight. If is a Sweet Caporal on the back. PSA value is listed at $625 but will entertain any reasonable offer. Can provide picture upon request. I haven't been on in a while but I sold a large amount of T206, T205, and T3 cards several years back.\r\nYou can contact me at [url]smaddox660@aol.com[/url]",
      "post_time": "20171115T20:44:42-06:00",
      "timestamp": "1510803882"
    },
    {
      "post_id": "1720583",
      "post_title": "",
      "post_author_name": "JP",
      "post_content": "I think the $625 estimate is for a PSA 7, not a PSA 7 (MC).",
      "post_time": "20171116T03:15:30-06:00",
      "timestamp": "1510827330"
    },
    {
      "post_id": "1720585",
      "post_title": "In a group?",
      "post_author_name": "glynparson",
      "post_content": "In a group? Was this not purchased as a single lot  from Scott's last auction, Birmingham Auctioneers?  PS. the SMR value is not for a qualified example but for a straight PSA 7.",
      "post_time": "20171116T03:35:30-06:00",
      "timestamp": "1510828530"
    },
    {
      "post_id": "1720623",
      "post_title": "Correct",
      "post_author_name": "Rynos23",
      "post_content": "Yes it was purchased from Birmingham Auctions. I guess\r\nI wasn’t as clear as I needed to be, I purchased a group\r\nof cards during the auction of which this was one, sorry for\r\nthe confusion. And my price was because I don’t believe it\r\nis a miscut as I tried to explain. But because it is labeled MC\r\nI put I would entertain reasonable offers. In other words not\r\n$50 or a low ball offer. Hope this clarifies things.",
      "post_time": "20171116T07:10:22-06:00",
      "timestamp": "1510841422"
    },
    {
      "post_id": "1720630",
      "post_title": "",
      "post_author_name": "JP",
      "post_content": "As these are your first two posts here, I’m going to make an assumption that might not be correct, so I apologize if I’m wrong. But just so you know, a qualifier like MC doesn’t just take a little off the price of a card. A good rule of thumb is that it knocks down a card by two full grades. So a PSA 7 MC is gonna sell like a PSA 5. Maybe even less because there are very few people who like qualifiers. You may be looking at about 1/3rd of the price estimate without the qualifier. When you get in the higher grades, qualifiers can be even more damaging. For example, a PSA 9 with a qualifier of OC knocks off 95% of the value, at times. I’d much rather take a PSA 6 of any card over a PSA 9 with a qualifier, personally.",
      "post_time": "20171116T07:40:58-06:00",
      "timestamp": "1510843258"
    },
    {
      "post_id": "1720635",
      "post_title": "",
      "post_author_name": "Republicaninmass",
      "post_content": "[quote name=\"Rynos23\" post=1720623]Yes it was purchased from Birmingham Auctions. I guess\r\nI wasn’t as clear as I needed to be, I purchased a group\r\nof cards during the auction of which this was one, sorry for\r\nthe confusion. And my price was because I don’t believe it\r\nis a miscut as I tried to explain. But because it is labeled MC\r\nI put I would entertain reasonable offers. In other words not\r\n$50 or a low ball offer. Hope this clarifies things.[/QUOTE]\r\n\r\n\r\nYou title should also be as  clear as it needs to be.  It is not a psa 7, but a psa 7 MC",
      "post_time": "20171116T07:49:04-06:00",
      "timestamp": "1510843744"
    },
    {
      "post_id": "1720715",
      "post_title": "",
      "post_author_name": "glynparson",
      "post_content": "Just an FYI psa is supposed to use the mc for any card with centering worse than 90-10  it need not be 100-0 to receive the mc from what I have been told by psa. Nice sharp card for anyone interested but is rather oc to the top. But if you just like sharp cards this one is clean.",
      "post_time": "20171116T10:22:23-06:00",
      "timestamp": "1510852943"
    }
  ]
}