{
  "id": "350299",
  "forum_id": "39",
  "title": "PSA Card Inventory",
  "author": "mdmolyneaux",
  "reply_count": 2,
  "view_count": 573,
  "created_date": null,
  "last_reply": "20240613T17:12:29-06:00",
  "posts": [
    {
      "post_id": "2441120",
      "post_title": "PSA Card Inventory",
      "post_author_name": "mdmolyneaux",
      "post_content": "So perhaps a silly question...but I have started adding my T206 inventory to PSA as all my cards are PSA graded.  And all of them went into my \"set\" - the 524 card T206 set - but 4 did not.  They are showing in my inventory but it won't let me add them to the 524 card set and each card, when you dive in, doesn't show being a member of the 524 card set but shows being members of other sets within T206.  For example, Joe Tinker (Bat off shoulder).  He is a member of lots of T206 sets (Cubs T206, Sovereign T206, HOF T206) but not a member of the T206 524 card complete set.  Anybody have any idea on how I override this and get him added or what I am doing wrong?  Thanks!  \r\nMiles",
      "post_time": "20240613T16:50:40-06:00",
      "timestamp": "1718319040"
    },
    {
      "post_id": "2441122",
      "post_title": "",
      "post_author_name": "4815162342",
      "post_content": "Welcome!  This is the Buy/Sell/Trade section, FYI.  \n\nFrom PSA’s FAQ:\n\n“I have added inventory and my cards are not being associated with any of my sets. What do I do?\n\nClick the link called \"Report a cert that should match this checklist\" which is located just above the set checklist in the set in MY SETS. Locate the missing card in the dropdown box, type in your certification number and submit. Allow one business day for the set to be updated by customer service.”",
      "post_time": "20240613T17:06:38-06:00",
      "timestamp": "1718319998"
    },
    {
      "post_id": "2441123",
      "post_title": "",
      "post_author_name": "mdmolyneaux",
      "post_content": "Thanks - and sorry, wrong place!",
      "post_time": "20240613T17:12:29-06:00",
      "timestamp": "1718320349"
    }
  ]
}