{
  "id": "277817",
  "forum_id": "39",
  "title": "FS: Elite 11 cards -  20/22 P350s & EPDGs - SOLD",
  "author": "ahumes13",
  "reply_count": 5,
  "view_count": 540,
  "created_date": null,
  "last_reply": "20200108T21:54:50-06:00",
  "posts": [
    {
      "post_id": "1944974",
      "post_title": "FS: Elite 11 cards -  20/22 P350s & EPDGs - SOLD",
      "post_author_name": "ahumes13",
      "post_content": "Hello,\r\n\r\nOver the past year or so I have thoroughly enjoyed learning about and chasing down the Elite 11 Piedmont 350 and EPDG cards. I've had the good fortune of acquiring 21 out of the 22 cards, including all 11 of the P350 cards. The majority of the cards I've traded for or purchased have been from members here, which has been a great experience across the board. I've been unable to track down the Ewing EPDG card and generally have run out of steam and figure it is time to pass these cards along to someone else, allowing me to pursue some new card interests I have. I'd much prefer doing this with a fellow member rather than consigning. In addition to the missing Ewing EPDG card I'm going to hold onto the Lundgren EPDG card.\r\n\r\nWilling to entertain offers for either: 1) the 20 total cards; or 2) the 11 P350 cards; or 3) the 9 EPDG cards, would prefer option 1. Not looking to sell individual cards at this time. I also have 8/10 Sovereign 150 (no Lundgren Sov 150 exists) Elite 11 subjects if anyone is interested in those. Shipping with insurance/registered mail will be included in any sale price for options 1-3, purchase price to be paid in money order or certified check- cards will be sent once deposited. I will be happy to provide references with those I've bought from or sold to on this site or elsewhere. \r\n\r\nI will have to post the remaining cards in the following reply posts. Thanks for looking and let me know if you have any questions!\r\n\r\nLOT OF 20 IS SOLD\r\n\r\nAndy",
      "post_time": "20200106T20:13:50-06:00",
      "timestamp": "1578366830"
    },
    {
      "post_id": "1944975",
      "post_title": "",
      "post_author_name": "ahumes13",
      "post_content": "The next bunch of scans...",
      "post_time": "20200106T20:18:20-06:00",
      "timestamp": "1578367100"
    },
    {
      "post_id": "1944976",
      "post_title": "",
      "post_author_name": "ahumes13",
      "post_content": "And the last two...",
      "post_time": "20200106T20:19:50-06:00",
      "timestamp": "1578367190"
    },
    {
      "post_id": "1945031",
      "post_title": "",
      "post_author_name": "Ronnie73",
      "post_content": "Impressive collection. I'm only missing Jones Piedmont 350, Lundgren Piedmont 350, and Dahlen EPDG.",
      "post_time": "20200107T07:23:15-06:00",
      "timestamp": "1578406995"
    },
    {
      "post_id": "1945127",
      "post_title": "",
      "post_author_name": "ahumes13",
      "post_content": "Thanks Ron, appreciate it! Have had a lot of interest and people reaching out, which is awesome. Will try to sort through it all tonight and get back to folks in order received.",
      "post_time": "20200107T12:52:06-06:00",
      "timestamp": "1578426726"
    },
    {
      "post_id": "1945581",
      "post_title": "",
      "post_author_name": "ahumes13",
      "post_content": "The lot of 20 has been sold. Appreciate the interest.\r\n\r\nHappy hunting!",
      "post_time": "20200108T21:54:50-06:00",
      "timestamp": "1578545690"
    }
  ]
}