{
  "id": "172981",
  "forum_id": "39",
  "title": "FT: Uzit - Pelty",
  "author": "DerekMichael",
  "reply_count": 4,
  "view_count": 460,
  "created_date": null,
  "last_reply": "20130725T23:45:09-06:00",
  "posts": [
    {
      "post_id": "1162878",
      "post_title": "FT: Uzit - Pelty",
      "post_author_name": "DerekMichael",
      "post_content": "Hi All.\n\nI am interested in making a trade should we be able to make a match.\n\nI figure this is one of the better pieces my Dad and I own, and although we did not figure to part with it when we first made a deal with a fellow net54 board member, we were curious as to whether or not anyone might be interested in a trade. We like the \"tough\" backs, as we find them to be pretty cool.\n\nAnyways, if you feel like making a deal, give us a holler, as it never hurts to try.\n\nThanks!\n\nDerek",
      "post_time": "20130725T15:22:49-06:00",
      "timestamp": "1374787369"
    },
    {
      "post_id": "1162885",
      "post_title": "",
      "post_author_name": "DerekMichael",
      "post_content": "i just wanted to add that the back does not necessarily have to be one of the rarest, and if the player is cool, i would be very interested. for example, brown hindu portraits are awesome and if you have cy young, walter johnson, nap lajoie etc. etc., that is awesome.\r\n\r\ni do not care about the technical grades to be honest, only that the card(s) look decent.\r\n\r\none combo in particular that i would love to add is a hughie jennings dancing with an american beauty 460 back.\r\n\r\nanyways, thank you for your time.\r\n\r\nDerek",
      "post_time": "20130725T15:45:48-06:00",
      "timestamp": "1374788748"
    },
    {
      "post_id": "1162889",
      "post_title": "",
      "post_author_name": "slipk1068",
      "post_content": "Beauty",
      "post_time": "20130725T15:48:52-06:00",
      "timestamp": "1374788932"
    },
    {
      "post_id": "1162918",
      "post_title": "",
      "post_author_name": "atx840",
      "post_content": "[quote name=\"slipk1068\" post=1162889]Beauty[/QUOTE]\n\n+1",
      "post_time": "20130725T16:54:05-06:00",
      "timestamp": "1374792845"
    },
    {
      "post_id": "1163060",
      "post_title": "",
      "post_author_name": "DerekMichael",
      "post_content": "thank you to everyone for all of their interest today. it is greatly appreciated, and to be honest, i was a bit surprised. \r\n\r\ni ask that if you contacted me via pm or email, that you please bare with me if i do not get back to you right away.\r\n\r\nalso, do not get too hung up about the technical grades of your cards, as it honestly does not matter to me. in all honesty, i am not all that hung up about the fact that the pelty/ uzit has an extra half point on it. in my eyes, it is just a pretty decent looking uzit, nothing more, nothing less. i have actually seen one other that was posted by a fellow board member, and his honestly looked as if he had just popped it out of a pack of smokes. it blows mine out of the water, in fact.\r\n\r\nanyways, thank you, and i will try to get back to you guys in a timely manner.\r\n\r\nfeel free to just email me at [url]lennondmh@yahoo.com[/url]\r\n\r\nthanks guys.\r\n\r\nDerek",
      "post_time": "20130725T23:45:09-06:00",
      "timestamp": "1374817509"
    }
  ]
}