{
  "id": "236328",
  "forum_id": "39",
  "title": "FS- two odd T206's",
  "author": "Blitzu",
  "reply_count": 12,
  "view_count": 707,
  "created_date": null,
  "last_reply": "20170305T19:54:23-06:00",
  "posts": [
    {
      "post_id": "1637755",
      "post_title": "FS- two odd T206's",
      "post_author_name": "Blitzu",
      "post_content": "One of these is clearly a fairly odd error with the color seeming to spill out of the card instead of shifting, and the other is even odder.  It appears to be a normal T206 but with what appears to be another piece of paper that got stuck to rear and then stamped again by the press.  It's definitely not another T206 since there's no front to the second piece of paper stuck to the original card.  It's also a very lighter piece of paper making me thing another sheet of some other type got caught onto it, but I could totally be wrong.  \n\nI have no clue how to price either of these, but I'm willing to entertain offers or any additional thoughts on these two.\n\nEmail or PM or posting offers works for me.  [url]Bliztu@yahoo.com[/url]\n\nI will be traveling next week and will be back at home Wednesday.  \n\nI also only posted the front of the McCormick, the rear is normal.  The Meyers is the card with the extra paper.",
      "post_time": "20170304T20:09:49-06:00",
      "timestamp": "1488683389"
    },
    {
      "post_id": "1637911",
      "post_title": "",
      "post_author_name": "Luke",
      "post_content": "I think the Meyers just has part of another back stuck to it.  The way this works is at some point, a card with a Piedmont 350 back was stuck in a scrapbook (or picture frame or something similar).  Then, it was torn out, which left a bit of the back on the scrapbook.  Then the Meyers was pasted right in the same spot and when it was removed, part of the first back came off with it.",
      "post_time": "20170305T12:26:30-06:00",
      "timestamp": "1488741990"
    },
    {
      "post_id": "1637952",
      "post_title": "",
      "post_author_name": "Blitzu",
      "post_content": "That's sounds very plausible, but the paper stuck to it is much thinner than the typical card stock and I would have thought that there would have been part of the front of the previous card showing somewhere, but there's no indications that the second piece stick to it had any color on it's reverse.  Does that make sense?   Unless you're saying that the the original card was practically split in half and this card picked up that other half. Thanks",
      "post_time": "20170305T14:31:13-06:00",
      "timestamp": "1488749473"
    },
    {
      "post_id": "1637970",
      "post_title": "",
      "post_author_name": "Luke",
      "post_content": "Just part of the back of the first card stayed on the scrapbook.  The other card may be floating around somewhere with most of the back torn off.",
      "post_time": "20170305T15:10:01-06:00",
      "timestamp": "1488751801"
    },
    {
      "post_id": "1638018",
      "post_title": "",
      "post_author_name": "PhillipAbbott79",
      "post_content": "That is impossible. The back would be on backwards. My guess would be that someone attempted to repair the card...maybe??? That or someone found out it was re-backed and attempted to remove the bogus back and wasn't able to get it all off.",
      "post_time": "20170305T17:00:11-06:00",
      "timestamp": "1488758411"
    },
    {
      "post_id": "1638029",
      "post_title": "",
      "post_author_name": "Blitzu",
      "post_content": "I thought the same thing perhaps with the rebacking theory but why would they choose the same piedmont back and not something else, especially when the original back appears to be undamaged.",
      "post_time": "20170305T17:21:25-06:00",
      "timestamp": "1488759685"
    },
    {
      "post_id": "1638030",
      "post_title": "",
      "post_author_name": "Blitzu",
      "post_content": "As for the scrap book thing, I still don't see how the additional piece of paper back went unaltered if it was in fact glued to a book?  There should be some type of evidence of glueing right?",
      "post_time": "20170305T17:23:21-06:00",
      "timestamp": "1488759801"
    },
    {
      "post_id": "1638033",
      "post_title": "",
      "post_author_name": "bnorth",
      "post_content": "What back is on the McCormick?",
      "post_time": "20170305T17:28:53-06:00",
      "timestamp": "1488760133"
    },
    {
      "post_id": "1638035",
      "post_title": "",
      "post_author_name": "Luke",
      "post_content": "[quote name=\"PhillipAbbott79\" post=1638018]That is impossible. The back would be on backwards. My guess would be that someone attempted to repair the card...maybe??? That or someone found out it was re-backed and attempted to remove the bogus back and wasn't able to get it all off.[/QUOTE]\r\n\r\nPlease explain how the back would be on backwards in my example.  And feel free to actually read what I wrote if you want to.",
      "post_time": "20170305T17:42:13-06:00",
      "timestamp": "1488760933"
    },
    {
      "post_id": "1638038",
      "post_title": "",
      "post_author_name": "Luke",
      "post_content": "Here are a couple before and after scans.  You can see that the specs of paper were aligned the same way as the back, which makes perfect sense since the first card (the Piedmont 350 in your instance) was pasted into the scrapbook in exactly the same way as the card above it (the Meyers).",
      "post_time": "20170305T17:49:39-06:00",
      "timestamp": "1488761379"
    },
    {
      "post_id": "1638047",
      "post_title": "",
      "post_author_name": "PhillipAbbott79",
      "post_content": "[quote name=\"Luke\" post=1638035]Please explain how the back would be on backwards in my example.  And feel free to actually read what I wrote if you want to.[/QUOTE]\r\n\r\nGotcha. My brain interpreted what you wrote wrong.",
      "post_time": "20170305T18:03:23-06:00",
      "timestamp": "1488762203"
    },
    {
      "post_id": "1638051",
      "post_title": "",
      "post_author_name": "Mikehealer",
      "post_content": "Meyers is a 460 only subject, by the looks of the card it looks like it's holding the card together. The Meyers is one of my favorite pre-war cards.  As for price I would say $10 each.",
      "post_time": "20170305T18:12:35-06:00",
      "timestamp": "1488762755"
    },
    {
      "post_id": "1638096",
      "post_title": "",
      "post_author_name": "frankbmd",
      "post_content": "Card doctors should not drink in the operating room.;)",
      "post_time": "20170305T19:54:23-06:00",
      "timestamp": "1488768863"
    }
  ]
}