{
  "id": "318012",
  "forum_id": "39",
  "title": "FS: T206 Powers w/McAvoy (No Longer Available)",
  "author": "benge610",
  "reply_count": 5,
  "view_count": 736,
  "created_date": null,
  "last_reply": "20220420T22:11:56-06:00",
  "posts": [
    {
      "post_id": "2214090",
      "post_title": "FS: T206 Powers w/McAvoy (No Longer Available)",
      "post_author_name": "benge610",
      "post_content": "One of a Kind.\r\n\r\n'Wickey' McAvoy, an 18 yr-old catcher from Rochester, NY; after his team had a series with the Baltimores; is signed by Connie Mack's A's, as a back-up catcher. Subsequently is sent to Baltimore for seasoning. While there, McAvoy catches a young pitcher named Ruth; undoubtedly is reporting analysis of this young pitcher back to Philly. When Mack begins negotiations with Dunn of Baltimore, Mr. Mack feels $10K is a bit steep for his liking; prolly thinking negotiations will follow. The rest is history as Boston came a calling. My guess is that after the passing of Powers and ATC pulling his card from the 350 run; someone from the A's office acquired this card from the printer (nameplate removed, no shadow); inserted it into the ol' typewriter\r\n(anyone remember those? lol) and gave Wickey his own 'card'; this was a big deal to some back then, having your own baseball card. \r\n\r\nNO LONGER AVAILABLE\r\n\r\n[IMG]https://www.net54baseball.com/picture.php?albumid=1364&pictureid=32630[/IMG]\r\n\r\n[IMG]https://www.net54baseball.com/picture.php?albumid=1364&pictureid=32311[/IMG]\r\n\r\n[IMG]https://www.net54baseball.com/picture.php?albumid=1172&pictureid=31106[/IMG]\r\n\r\nBen\r\n\r\n\"I love baseball history backstory; especially when it involves cards.\"\r\n\r\nSuccessful transactions with: Casey2296, Jacklitsch, wolf441, shepbuckman, seablaster, Bridwell. brianp-beme, hatchetman325, quinnsryche, joejo20, Brian Van Horn, Thromdog, Webster, shammus, asphaltman, old baseball, obcmac, sb1, tiger8mush, BKaufmann, 53toppscollector.",
      "post_time": "20220410T20:39:18-06:00",
      "timestamp": "1649644758"
    },
    {
      "post_id": "2214455",
      "post_title": "",
      "post_author_name": "benge610",
      "post_content": "Price reduction, bump to move.",
      "post_time": "20220411T21:24:08-06:00",
      "timestamp": "1649733848"
    },
    {
      "post_id": "2214489",
      "post_title": "",
      "post_author_name": "tiger8mush",
      "post_content": "Neat card and backstory Ben!",
      "post_time": "20220412T03:56:06-06:00",
      "timestamp": "1649757366"
    },
    {
      "post_id": "2214537",
      "post_title": "",
      "post_author_name": "benge610",
      "post_content": "[quote name=\"tiger8mush\" post=2214489]Neat card and backstory Ben![/QUOTE]\n\nThank you Rob.\nWhen these things find me, I enjoy diving and researching for pieces to assemble; creating a footprint of historical baseball backstory. I keep crossing paths with Rochester, NY right now; on multiple projects, so cool.\nI just wanted to share this piece and curious if there may be others; i.e. other \"McAvoy\" cards.\nBen\n\n\"I love baseball history backstory; especially when it involves cards.\"",
      "post_time": "20220412T07:20:25-06:00",
      "timestamp": "1649769625"
    },
    {
      "post_id": "2216636",
      "post_title": "",
      "post_author_name": "mullinsm",
      "post_content": "Hi Ben,\r\n\r\nYou mentioned that you were curious if there were other cards like this one. \r\n\r\nFor what it's worth, this Powers card was one of 10-20ish \"renamed\" t206 cards listed at the same time on eBay a number of years ago. All were listed by the same seller, so I presume they came from the same collector/collection. The renamed cards were listed individually with Buy It Now prices of around $25-45, except for one HOFer, I think a Cy Young, which was offered at a higher price (I don't remember how much, something in the low hundreds iirc). The seller also had a large assortment of normal, lower grade, ungraded t206s for sale via BIN. I do not remember the seller's eBay id nor know if they are still active.\r\n\r\nAll the renamed cards shared much in common. The original name had been carefully removed (erased?), and a new name and team had been typed over it. Based on the typeface and inking, the same typewriter appears to have been used on all the cards. I say that the original names were removed because on some cards, remnants of the original name could still be read under the new typing. Depending on how much white border was on bottom, the typing was either all on the white or overlapping onto the picture.\r\n\r\nI did some research into these cards and the renamed players at the time they were listed. If I remember correctly, the renamed players were players who were active in ~1914-15 but not 1909-11, or otherwise had not been included in the t206 set. It's been a while but iirc, whoever made the changes tried to use a card featuring the same team and similar position as the new player so they looked about right - similar pose, equipment, and uniform. \r\n\r\nMy guess, and it is purely a guess, is that these cards were \"updated\" in the mid 19-teens by a period collector who wanted their cards to reflect updated team rosters. Given the quality of the edits - old names carefully removed, new names typed to fit and be centered along the bottom - I'd say an adult did the typing, be it for themselves or for a child requesting updated cards.\r\n\r\nI had most of the seller's renamed cards in my watch list and watched as they slowly, over a period of more than a year, were purchased. I got tired of seeing some of them come around again and again in my watch list and I removed them; I don't know if these sold or not. I did just look through over 1000 BIN t206 listings on eBay but unfortunately I did not find another one of these. I will continue to look.\r\n\r\nI almost bought some because I found them interesting, clever, and unique, and also because I needed a few of the (original name) cards for my growing set, but I never pulled the trigger on any of them. I needed (and still need) a Powers for my set but couldn't decide if I wanted this particular example, so I let it slide. Another card from this collection in particular caught my eye as well, and I hemmed and hawed about it for months, but eventually someone else bought it. To this day I regret not buying it and I scour eBay regularly in case it reappears. \r\n\r\nI hope you find this information useful. I'm sorry my recollection isn't more clear and I apologize in advance for anything I've misremembered. Unfortunately, I don't have any of the card images saved on my computer or in my eBay watch list anymore. All the above is based on my recollections of the cards, which I viewed frequently and studied closely at the time they were available.\r\n\r\nPlease let me know if you have any questions. I've tried to provide all the information I can remember.\r\n\r\nBest,\r\n\r\nMike Mullins",
      "post_time": "20220419T07:06:37-06:00",
      "timestamp": "1650373597"
    },
    {
      "post_id": "2217283",
      "post_title": "",
      "post_author_name": "benge610",
      "post_content": "No Longer Available",
      "post_time": "20220420T22:11:56-06:00",
      "timestamp": "1650514316"
    }
  ]
}