{
  "id": "228581",
  "forum_id": "39",
  "title": "SGC Graded T206 - Hundreds available",
  "author": "PEEK enterprises",
  "reply_count": 7,
  "view_count": 819,
  "created_date": null,
  "last_reply": "20160917T17:19:27-06:00",
  "posts": [
    {
      "post_id": "1584833",
      "post_title": "SGC Graded T206 - Hundreds available",
      "post_author_name": "PEEK enterprises",
      "post_content": "I will be breaking up a very large T206 collection.  ONLY SGC cards are being made available at this time.  There are over (375) SGC graded cards, including HOF'ers and Southern Leaguer's.  The vast majority are SGC 60/50 but there are a few higher and a few lower.  A good mixture of backs are included (and will be priced accordingly).  Most of the \"big\" names are PSA graded - no Cobb, Johnson, Speaker, but many others are included.  \r\n\r\nSome info on this collection - the vast majority of these cards were graded well over a decade ago and purchased via Ebay over a period of five to six years.  This very astute female collector, yes there are some, was named \"Betty Dragon\".  Betty was very advanced in T206, and other vintage baseball card sets.  She completed nearly two full T206 sets, a nearly complete T207 \"master set\", a T201 set, and had began tackling T205's before her untimely and unfortunate passing.  While SGC's parameters have stayed mostly consistent, you may see some variances in grading from then and now (any variances are not my problem or concern).\r\n\r\nYou are welcome to email me for a list (Excel spreadsheet) - [url]ppgustafson@yahoo.com[/url]\r\n\r\n\r\nTerms:\r\n\r\n1) Email only - [url]ppgustafson@yahoo.com[/url] - no other forms of communication will be utilized.\r\n\r\n2) No cards are priced, I have not had the time.  If you ask, I will get you a price rather quickly.  If you see the price and want to see a scan, just ask.  Please don't waste your time or mine asking for a scan if the price is not what you're looking to pay.  All who know me can attest that I price very fairly, no games or hassles.  However, if you're looking for a bargain, you're best to look elsewhere.  \r\n\r\n3) Payment is via Paypal only (unless I know you then a check is fine).  I don't gouge buyers extra $$ to pay via Paypal and make my job simple/safe (what a concept...).\r\n\r\n4) Payment & shipment outside of the USA - it's not for me.  However, Ebay has made is quite simple and efficient via their \"global shipping program\", it's just costly to the seller.  If you want the card bad enough, I will raise the price by 18% and put it on Ebay buy-it-now where you can purchase and pay via Paypal.  Otherwise, no shipments will be made outside of the USA.\r\n\r\n5) Cards will not be \"held\" for review.  First to pay closes the deal.\r\n\r\nThanks,\r\n\r\nPete Gu$taf$0n",
      "post_time": "20160914T09:34:31-06:00",
      "timestamp": "1473867271"
    },
    {
      "post_id": "1585554",
      "post_title": "",
      "post_author_name": "Qiot",
      "post_content": "Email Sent, Thx Pete!",
      "post_time": "20160916T14:09:12-06:00",
      "timestamp": "1474056552"
    },
    {
      "post_id": "1585582",
      "post_title": "Dealing with Pete is great",
      "post_author_name": "Howe’s Hunter",
      "post_content": "just in case anyone is not familiar with him or his pricing. Always fair. Really enjoy doing business with Pete.",
      "post_time": "20160916T15:48:28-06:00",
      "timestamp": "1474062508"
    },
    {
      "post_id": "1585727",
      "post_title": "",
      "post_author_name": "TheBigRedOne",
      "post_content": "EMAIL sent as well.  Looking forward to seeing what's available.",
      "post_time": "20160917T07:57:10-06:00",
      "timestamp": "1474120630"
    },
    {
      "post_id": "1585748",
      "post_title": "Awesome !!",
      "post_author_name": "Gradedcardman",
      "post_content": "Great stuff as usual. Great prices too.",
      "post_time": "20160917T09:38:53-06:00",
      "timestamp": "1474126733"
    },
    {
      "post_id": "1585821",
      "post_title": "",
      "post_author_name": "brob28",
      "post_content": "Email sent Pete.",
      "post_time": "20160917T12:29:36-06:00",
      "timestamp": "1474136976"
    },
    {
      "post_id": "1585832",
      "post_title": "",
      "post_author_name": "ronniehatesjazz",
      "post_content": "[quote name=\"StuckInOmaha\" post=1585582]just in case anyone is not familiar with him or his pricing. Always fair. Really enjoy doing business with Pete.[/QUOTE]\r\n\r\nI've only dealt with Pete on eBay but yeah I agree; very fair. I've bought several cards from him over the last year and could not have been happier.",
      "post_time": "20160917T13:02:34-06:00",
      "timestamp": "1474138954"
    },
    {
      "post_id": "1585928",
      "post_title": "Pete",
      "post_author_name": "Kingcobb",
      "post_content": "Pete is great to deal with bought a card Thursday it arrived today don't get any better. Thanks Daryl",
      "post_time": "20160917T17:19:27-06:00",
      "timestamp": "1474154367"
    }
  ]
}