{
  "id": "279347",
  "forum_id": "39",
  "title": "SOLD T206 Ritchey Yellow Belt Variation PSA 2 - now with red belt comparison scan",
  "author": "brianp-beme",
  "reply_count": 2,
  "view_count": 630,
  "created_date": null,
  "last_reply": "20200218T12:49:51-06:00",
  "posts": [
    {
      "post_id": "1955310",
      "post_title": "SOLD T206 Ritchey Yellow Belt Variation PSA 2 - now with red belt comparison scan",
      "post_author_name": "brianp-beme",
      "post_content": "I have the following PSA 2 T206 Ritchey yellow belt variation card (belt is normally red - missing ink pass) available for purchase. Scanned poorly...looks very presentable (and not blurry!) in person, and the belt is about the same yellow color as his bat.  The regular red belt Ritchey is for comparison purposes and not for sale.  Shipping will be $3.00. Accepting Paypal only.\r\n\r\nThe discounts below will be based upon the overall amount of cards purchased from my numerous listings, not just within this listing.\r\n\r\nLooking to sell the cards in my various listings I am posting, so I am offering the following discounts for larger purchases: Buy 3 or more cards, free shipping, 6 or more cards, 10% off, buy 12 or more, 15% off. Commitment to buy snags these cards, and I will ship promptly and securely in a padded envelope. PM's preferred.\r\n\r\nBrian\r\n\r\n\r\nT206 Ritchey PSA2 (Yellow Belt color variation) $107  SOLD",
      "post_time": "20200214T16:32:48-06:00",
      "timestamp": "1581723168"
    },
    {
      "post_id": "1955709",
      "post_title": "",
      "post_author_name": "brianp-beme",
      "post_content": "Bumping this, and adding to the first post a comparison regular red belt Ritchey (you are only purchasing the PSA2 yellow belt).\r\n\r\nBrian",
      "post_time": "20200216T17:39:15-06:00",
      "timestamp": "1581899955"
    },
    {
      "post_id": "1956178",
      "post_title": "",
      "post_author_name": "brianp-beme",
      "post_content": "Giving this yellow belter one more bump.\r\n\r\nBrian",
      "post_time": "20200218T12:49:51-06:00",
      "timestamp": "1582055391"
    }
  ]
}