{
  "id": "243394",
  "forum_id": "39",
  "title": "At Bat, On Deck, In the Hole - RAIN DELAY",
  "author": "KMayUSA6060",
  "reply_count": 6,
  "view_count": 1085,
  "created_date": null,
  "last_reply": "20170907T07:01:07-06:00",
  "posts": [
    {
      "post_id": "1688782",
      "post_title": "At Bat, On Deck, In the Hole - RAIN DELAY",
      "post_author_name": "KMayUSA6060",
      "post_content": "** Rain Delay **\n\nAt Bat\n- T206 Cy Young (SGC 20/1.5 or less)\n\nOn Deck\n- T206 Chance - either pose (graded by SGC)\n\nIn the Hole\n- T206 Fred Merkle - Throwing (raw or graded)\n\n--------------------------------------------------------------------------------------\n\nThis will be a running post that I will bump every so often. Above, in between 2 sets of asterisks, I will post if I am buying, or in a rain delay. If PLAY BALL is up, I am buying, and below it will be the card \"at bat\" that I am buying at that point in time. Below will be my want list. I will have an On Deck and an In the Hole that will move up to replace the spot of the card that I knock off (buy). This should help me stay focused and on budget. The conditions I am looking for are lesser conditions - creases and rounded corners are ok, but paper loss and writing is not. I'm looking for Raw unless noted otherwise. Feel free to message me about the cards On Deck and In the Hole if you have them and are willing to move them. Can't promise I'd be in the market at that point in time, but maybe we can work something out - I will always have a pinch hitter ready to go if need be.",
      "post_time": "20170808T20:58:12-06:00",
      "timestamp": "1502247492"
    },
    {
      "post_id": "1688902",
      "post_title": "",
      "post_author_name": "mybuddyinc",
      "post_content": "Kyle,\r\n\r\nGreat idea.  As I've said like your collecting approach.\r\n\r\nFun, fun, Scott :rolleyes:",
      "post_time": "20170809T09:15:51-06:00",
      "timestamp": "1502291751"
    },
    {
      "post_id": "1688986",
      "post_title": "",
      "post_author_name": "KMayUSA6060",
      "post_content": "Updated. Found a Murphy Horizontal (thank you J3ff), so we are now in a Rain Delay. Now At Bat, however, is T206 Flick, On Deck is T206 Chase w/ Trophy, and In the Hole is T206 Marquard Arms at Side.",
      "post_time": "20170809T12:10:51-06:00",
      "timestamp": "1502302251"
    },
    {
      "post_id": "1693378",
      "post_title": "",
      "post_author_name": "KMayUSA6060",
      "post_content": "The most recent rain delay resulted in a rain out. We hadn't quite gotten past the 5 1/2 inning mark, so the game was rendered incomplete. Therefore the lineup has changed. \r\n\r\nPLAY BALL!",
      "post_time": "20170822T11:31:41-06:00",
      "timestamp": "1503423101"
    },
    {
      "post_id": "1695249",
      "post_title": "",
      "post_author_name": "KMayUSA6060",
      "post_content": "Still looking for Flick!",
      "post_time": "20170827T12:03:32-06:00",
      "timestamp": "1503857012"
    },
    {
      "post_id": "1696287",
      "post_title": "",
      "post_author_name": "KMayUSA6060",
      "post_content": "My birthday is Friday. Nothing would make me happier than y'all SHOWING & SELLING me what I want! ;)",
      "post_time": "20170830T17:25:43-06:00",
      "timestamp": "1504135543"
    },
    {
      "post_id": "1698720",
      "post_title": "",
      "post_author_name": "KMayUSA6060",
      "post_content": "Finally snagged a Flick, so I have updated the current batting order. \r\n\r\nCy Young is a partial rain delay, meaning I would like to see what Cy Young's y'all have for sale, but am not as actively seeking one out. I am not buying anything else at the moment, however. \r\n\r\nRain rain, go away. I need more money today.",
      "post_time": "20170907T07:01:07-06:00",
      "timestamp": "1504789267"
    }
  ]
}