{
  "id": "299586",
  "forum_id": "39",
  "title": "FS: t206 low grade P, SC, one PB... last 6",
  "author": "tonyo",
  "reply_count": 6,
  "view_count": 494,
  "created_date": null,
  "last_reply": "20210331T18:16:25-06:00",
  "posts": [
    {
      "post_id": "2087738",
      "post_title": "FS: t206 low grade P, SC, one PB... last 6",
      "post_author_name": "tonyo",
      "post_content": "Well it's been a fun ride.  I started consolidating my entire card collection in July 2018. Working from the bottom, \"keeping my favorites\",  re-evaluating my favorites at several steps along the way.  I've been at it steadily almost 3 years now.  Pre-war thru modern, baseball, football, basketball, hockey.   Very very very few found the trash can.  Many many many went for a few cents a piece.  It was great re-discovering my cards and I believe I truly enjoyed sending them to new homes as much as I enjoyed collecting them in the first place\r\n\r\nI knew all along my raw 520 set in a binder would be the last of any value to be consolidated.  Fall of 2020 I had met my goal of fitting my \"surviving\" cards into various vintage boxes, drawers, and cabinets around my home.   The last major effort - selling my fairly extensive Barry Larkin collection - was starting to slow to a crawl, and I was down to relisting a few stragglers from the 90's over and over on eBay.\r\n\r\nIn October Morrie Mullins posted a WTB on the BST  for a PB Demmitt and O'Hara. Those were the last two cards I acquired for my 520 so it seemed fitting that they were the first two to go.  I decided it was time.  I reached out to Morrie and had a short pleasant PM conversation over 2 or 3 days.   I learned the meaning of the word magnanimous, and at the end sent my Demmitt and O'Hara onto Morrie to keep for a while.  \r\n\r\nIt's been a steady five months..... My monster number is now 184 and I have 6 remaining of those I identified to sell.   I love these little cards and am happy that most of my former 520 now resides in net54 collections.   As I described in most of my eBay listings,  I enjoyed these in my collection for a few years, and am passing them on for someone else to do the same..\r\n\r\n\r\nHere are the remaining 6.  \r\n\r\nPriced individually.  Paypal preferred.  add $3 shipping for any number of cards.\r\n\r\n[STRIKE]$70Ames (Hands above Head)[/STRIKE]\r\n$35Camnitz (Hands above Head)\r\n[STRIKE]$35Hemphill[/STRIKE]SOLD\r\n[STRIKE]$70Lattimore[/STRIKE]SOLD\r\n[STRIKE]$25Milligan[/STRIKE] SOLD\r\n$35Smith F. (Chicago, F. Smith)",
      "post_time": "20210331T04:36:02-06:00",
      "timestamp": "1617186962"
    },
    {
      "post_id": "2087813",
      "post_title": "",
      "post_author_name": "Kevin",
      "post_content": "Tony - hold Milligan for me - if someone already hasn’t laid claim. I’ll be back to comment on your thoughtful post in a bit. With the 4 year old and we are installing new windows In The dining room",
      "post_time": "20210331T08:46:16-06:00",
      "timestamp": "1617201976"
    },
    {
      "post_id": "2087874",
      "post_title": "",
      "post_author_name": "Usc1",
      "post_content": "I've bought many cards off Tony and he is a stand up guy.",
      "post_time": "20210331T10:43:48-06:00",
      "timestamp": "1617209028"
    },
    {
      "post_id": "2087892",
      "post_title": "",
      "post_author_name": "Kevin",
      "post_content": "[quote name=\"usc1\" post=2087874]i've bought many cards off tony and he is a stand up guy.[/quote]\r\n\r\n100%",
      "post_time": "20210331T11:06:31-06:00",
      "timestamp": "1617210391"
    },
    {
      "post_id": "2087976",
      "post_title": "",
      "post_author_name": "unamuzd1",
      "post_content": "Tony, you're what my grandfather would have called \"good people.\" I'm honored to have helped you start the process, and really happy to have added several more cards from the \"TonyO\" collection along the way. Demmit and O'Hara are now hanging out with Ty, Christy, and WaJo in a Secure and Undisclosed Location - but I'm gonna go visit pretty soon, I think. =)",
      "post_time": "20210331T14:08:07-06:00",
      "timestamp": "1617221287"
    },
    {
      "post_id": "2088020",
      "post_title": "",
      "post_author_name": "wazoo",
      "post_content": "Thanks for everything Tony! You've been an absolute pleasure to work with.",
      "post_time": "20210331T16:00:09-06:00",
      "timestamp": "1617228009"
    },
    {
      "post_id": "2088083",
      "post_title": "",
      "post_author_name": "Kevin",
      "post_content": "Yes, Tony. Some great dealing with you. Very much appreciated. Some great cards that I’m happy to have on my collection...",
      "post_time": "20210331T18:16:25-06:00",
      "timestamp": "1617236185"
    }
  ]
}