{
  "id": "273054",
  "forum_id": "39",
  "title": "SOLD: T206 Christy Mathewson PSA 5 (MC) - Now $550",
  "author": "robw1959",
  "reply_count": 2,
  "view_count": 410,
  "created_date": null,
  "last_reply": "20190908T08:02:28-06:00",
  "posts": [
    {
      "post_id": "1913186",
      "post_title": "SOLD: T206 Christy Mathewson PSA 5 (MC) - Now $550",
      "post_author_name": "robw1959",
      "post_content": "SOLD - There is a bit of border at the top, so it's not totally styled like a Topps '54 card. Other than centering, it's hard to find much wrong with this card, as the print is vibrant and bold on both front and back. No print spots, creases, wrinkles, scuffing, or anything else that doesn't show readily in the scans. No worries about possible trimming either, as it used to reside in an SGC 40 holder until I decided to cross it over to PSA. The resulting grade from them just seemed more accurate with regard to the overall condition and presentation. Asking [STRIKE]$600[/STRIKE] $550 net delivered, PayPal preferred, but I am flexible to other types of payment as well.\r\n\r\nSuccessful transactions with: Sean1125, 39special, Ericc22, asoriano, Econteachert205, oldcardboard, tolstoi, Jobu, simas7173, espomario, jmb, Charlie Faust III, Paul S, quitcrab, avalanche2006, Beatles Guy, Banjo, tjenkins, botn, trdcrdkid, jtschantz, longstreet766, greenmonster66, edjs, jb67, rhotchkiss, Puckettfan, mybuddyinc, frankbmd, Baseball*Collections, btcarfagno, Luke, vintageonlybb, bigfish, Luke, t206collector, marvymelvin, benginino9, bigedmachine, Stampsfan, Moonlight Graham, Rebublicaninmass, Gradedcardman, Tigerden, Smanzari, t206kid",
      "post_time": "20190831T15:33:43-06:00",
      "timestamp": "1567287223"
    },
    {
      "post_id": "1915260",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "Weekend bump with a discount . . .",
      "post_time": "20190907T23:28:02-06:00",
      "timestamp": "1567920482"
    },
    {
      "post_id": "1915299",
      "post_title": "",
      "post_author_name": "Knoxy24",
      "post_content": "I will take it. Sold.",
      "post_time": "20190908T08:02:28-06:00",
      "timestamp": "1567951348"
    }
  ]
}