{
  "id": "200426",
  "forum_id": "39",
  "title": "FB/DNA for sale - Only 4 left DNA optional",
  "author": "frankbmd",
  "reply_count": 1,
  "view_count": 388,
  "created_date": null,
  "last_reply": "20150126T21:11:27-06:00",
  "posts": [
    {
      "post_id": "1371226",
      "post_title": "FB/DNA for sale - Only 4 left DNA optional",
      "post_author_name": "frankbmd",
      "post_content": "I'm entering a crowded field on the T206 BST board, but I am offering the only cards here with FB/DNA certification.  What's that you ask?  The five cards, all ungraded, have been handled by me (FB) and therefore contain traces of my DNA.  The cards are priced individually and whether you want one of more than one, feel free to make an offer.  I will either wiggle (work with you) or squirm when I see it.\r\n\r\nCard #1 - Fred Clarke Portrait HOF (G) - with nice corners and color interrupted by right upper quadrant crease with visible paper loss in the rich red backqround,  SC350 NY reverse.  Asking $48 shipped.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10787/clarke-f-portrait-hof[/IMG]\r\n\r\nCard #2 - Kid Elberfeld Fielding (VG) - solid VG card with slight diamond cut and SC350 VA reverse. SOLD.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10861/elberfeld-fielding[/IMG]\r\n\r\nCard #3 - Hal Chase Blue Portrait (F/G) - this card makes up for its condition with two anomalies, a double-double if you will.  The card is a two namer (both Chase top and bottom) and the factory overstrike on reverse missed the mark leaving both Fact 30 & 42 exposed.  Asking $68 shipped.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10929/chase-blue[/IMG]\r\n\r\nCard #4 - Chief Meyers Batting  (G/VG) - this card has a less prominent right upper quadrant crease than the Clarke card but is otherwise intact with a Piedmont 350 reverse.  Asking $28 shipped.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10852/myers-batting[/IMG]\r\n\r\nClass #5 - Hub Perdue SL (VG) - A nice card that has been replaced in my collection with a graded copy (SGC 40) that is no better than this one.  The Piedmont 350 reverse is clean except for one smudge (a soaker's dream).  Asking $68 shipped.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/10800/perdue-sl[/IMG]\r\n\r\nAll forms of no fee payment accepted.  If you want to use regular Paypal, a modest surcharge will be added (<3%).  Thanks for looking at this extraordinary opportunity to add a FB/DNA card to your collection.  All inquiries and offers to buy will be handled in the order received.  PM is fine as well as email or the doorbell.  Which doorbell is a problem though.\r\n\r\nNote also that the cards will not be shipped in the holders shown in 4 of the scans.  They slide around too much in these.  I will send the holder though if you would like it for display purposes.",
      "post_time": "20150124T13:04:57-06:00",
      "timestamp": "1422129897"
    },
    {
      "post_id": "1372275",
      "post_title": "",
      "post_author_name": "frankbmd",
      "post_content": "Forget the DNA.  I'll wipe it off if you like.\r\n\r\nElberfeld is no longer available.",
      "post_time": "20150126T21:11:27-06:00",
      "timestamp": "1422331887"
    }
  ]
}