{
  "id": "288337",
  "forum_id": "39",
  "title": "WTB poor condition T206s - ungraded, marked, torn, etc.",
  "author": "Wrigleyville",
  "reply_count": 2,
  "view_count": 322,
  "created_date": null,
  "last_reply": "20200905T16:32:15-06:00",
  "posts": [
    {
      "post_id": "2013655",
      "post_title": "WTB poor condition T206s - ungraded, marked, torn, etc.",
      "post_author_name": "Wrigleyville",
      "post_content": "I’m new to vintage card collecting this pandemic and with a background in early American history I have slowly started to concentrate on prewar. While my personal collection is focused on select trophy cards, I am also using the hobby to bond with my 8-year-old son (and teach him about early baseball). We just listened to The Monster Podcast episode with Dean Kiekhefer talking about his T206 “beater binder” and we thought it was the perfect idea for a father-son project. We can slowly learn about and appreciate the T206 cards by building a binder of poor condition, raw cards. Plus, it makes the daunting T206 set a little more approachable for us. That said, does anyone have a small lot of badly beat-up T206 cards they’d be interested in selling to help us kickstart this journey? Please PM with details and thank you all for creating a fantastic community for this hobby! Cheers!",
      "post_time": "20200831T19:23:35-06:00",
      "timestamp": "1598923415"
    },
    {
      "post_id": "2013710",
      "post_title": "",
      "post_author_name": "jjp3rd",
      "post_content": "I have some that would be good for this project. I will take pics and post later. Please PM if you don’t hear from me. \n\n\nSent from my iPhone using Tapatalk",
      "post_time": "20200901T05:01:16-06:00",
      "timestamp": "1598958076"
    },
    {
      "post_id": "2015056",
      "post_title": "just",
      "post_author_name": "mintacular",
      "post_content": "Just listed a low grade t206 lot on bst auctions w/stars",
      "post_time": "20200905T16:32:15-06:00",
      "timestamp": "1599345135"
    }
  ]
}