{
  "id": "316781",
  "forum_id": "39",
  "title": "WTB - Help me fill my binder - Letter A",
  "author": "53toppscollector",
  "reply_count": 2,
  "view_count": 352,
  "created_date": null,
  "last_reply": "20220331T14:00:38-06:00",
  "posts": [
    {
      "post_id": "2206526",
      "post_title": "WTB - Help me fill my binder - Letter A",
      "post_author_name": "53toppscollector",
      "post_content": "As I was going forward with my portraits project, I realized that I had already collected about 25% of the full 520 set, so I decided I may as well just put together the 520 anyway. Always pivoting into new directions with T206\n\nI am sure this has been done before, but this board has been very helpful in me growing my T206 collection, so I figured I would ask for more help here. I am going to go letter by letter to try and fill my binder, skipping around a bit as needed. I will likely be saving some of the tougher/expensive cards till the end, but we'll see how it goes. I will continue looking to buy cards to fill my set from other avenues (and other letters), but I figured keeping my want list more manageable here would be a good thing.\n\nI am mostly looking for lower grade raw cards, but I am also fine with PSA/SGC/BVG/GAI 1s and 2s, and I am definitely fine with trimmed/As if they have nice eye appeal. I have to be cost conscious, as this is obviously a big project and prices for commons have really shot up. I want to avoid cards missing big chunks/cut off corners, and cards with destroyed backs. Minor paper loss I can live with, marks/backstamps are mostly fine.\n\nAs I am filling in the gaps in my set, I am also going to be interested in potentially upgrading my Piedmonts/SweetCaps to off backs. For each letter of my binder, I will post what I need (in any back) and then cards I'd potentially be interested in upgrading, depending on the price. I'd prefer to obviously buy an off back copy of the cards I am missing, but it is all price dependent, obviously.\n\nIf you have anything to sell from my list below, please reach out via PM. Thanks in advance.\n\nWe will start with the letter A\n\nNeed the following, in any back:\n\nAbbaticchio (brown sleeves)\nAmes (Hands Above Head)\nAmes (Hands At Chest)\n\nI would be interested in upgrading these cards to Sovereign/Polar Bear/Old Mill/EPDG where available/depending on price\n\nAbstein\nAmes Portrait\nArellanes\nArndt",
      "post_time": "20220317T08:35:46-06:00",
      "timestamp": "1647527746"
    },
    {
      "post_id": "2210598",
      "post_title": "",
      "post_author_name": "53toppscollector",
      "post_content": "Still looking for letter A guys. Thanks",
      "post_time": "20220331T11:41:51-06:00",
      "timestamp": "1648748511"
    },
    {
      "post_id": "2210631",
      "post_title": "",
      "post_author_name": "chlankf",
      "post_content": "I'm working on a binder set as well.  Do you have any dup's for some trading?\r\n\r\nCheers Craig",
      "post_time": "20220331T14:00:38-06:00",
      "timestamp": "1648756838"
    }
  ]
}