{
  "id": "246789",
  "forum_id": "39",
  "title": "Marquard raw $52",
  "author": "Luke",
  "reply_count": 1,
  "view_count": 383,
  "created_date": null,
  "last_reply": "20171029T12:13:51-06:00",
  "posts": [
    {
      "post_id": "1714735",
      "post_title": "Marquard raw $52",
      "post_author_name": "Luke",
      "post_content": "Here are three raw cards with high eye appeal and low technical grades.  Planning to send Cobb to PSA but figured I'd try here first.\n\nShipping and insurance are included in these prices.  These prices are for \"no fee\" payment methods.  If you want to pay with Paypal Goods we can add the fee and I'm fine with that. \n\nCobb off to PSA  \n\nPretty much the perfect card for a raw collection.  It's going to grade 1.5 in all likelihood with some chance of a 1 and some chance of a 2.  The postive attributes are obvious.  No creases, great color, nice centering.  The flaws are:  A few small spots of paper loss on the reverse.  The bottom left corner of the front has paper loss which luckily is confined to the border.  There are a couple scratches on the surface, and there are two indents that you can only see at an angle, but will affect the technical grade.  As a bonus, has the tougher Piedmont 350 back.\n\nBaker Old Mill Off to PSA\n\nLooks like a \"4\" except for the little spot on the right border.  But, on closer inspection that spot is a little cut.  It doesn't go all the way through the card, but kind of pushes the paper out on the back.  Another great card for a raw collection. \n\nMarquard $52\n\nNice looking card with obvious issues on all 4 corners.  Great colors and no creases though, and the image is unaffected.",
      "post_time": "20171028T13:28:45-06:00",
      "timestamp": "1509218925"
    },
    {
      "post_id": "1715015",
      "post_title": "",
      "post_author_name": "thenavarro",
      "post_content": "That's a nice looking Cobb for the tech grade.",
      "post_time": "20171029T12:13:51-06:00",
      "timestamp": "1509300831"
    }
  ]
}