{
  "id": "232012",
  "forum_id": "39",
  "title": "Your Thumb is Big Enough...CARD SOLD WITHOUT THUMB",
  "author": "frankbmd",
  "reply_count": 2,
  "view_count": 583,
  "created_date": null,
  "last_reply": "20161206T09:21:41-06:00",
  "posts": [
    {
      "post_id": "1607438",
      "post_title": "Your Thumb is Big Enough...CARD SOLD WITHOUT THUMB",
      "post_author_name": "frankbmd",
      "post_content": ".... to make this Willis throwing card Near Mint.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/z-folder/46217/nm-willis[/IMG]\r\n\r\nWhen viewing the reverse, place your thumb over the upper right portion of the card and bingo, you have a NM Hall of Famer.\r\n\r\nYou wont be paying for a NM Hall of Famer though.  It is truly your lucky day.\r\nAsking $70 shipped for Vic professionally graded by PSA in Good (2) condition.\r\n\r\nI anticipate that one of you who professes to care only about the presentation of the front to snap this up in a hurry.  I am going to the Post Office Tuesday morning.  Will your address be on one of the packets I am shipping?\r\n\r\nDid you know that only 1 out of 256 PSA cert numbers contains only \"even\" numbers?  This fact alone makes adding 26482286 to your collection a no brainer, even if you don't have a thumb.:eek:\r\n\r\nDespite the defect, every word on the reverse is legible.\r\n\r\nEnough suspense.  Here it is.\r\n\r\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/duplicates/45900/willis-throwing[/IMG]\r\n\r\nAny form of payment net to me suffices.  Thanks for taking a peek.",
      "post_time": "20161203T18:37:22-06:00",
      "timestamp": "1480815442"
    },
    {
      "post_id": "1607472",
      "post_title": "",
      "post_author_name": "Peter_Spaeth",
      "post_content": "You sound more like a chiropractor than an MD -- you made an adjustment for a bad back.  :eek:",
      "post_time": "20161203T21:09:29-06:00",
      "timestamp": "1480824569"
    },
    {
      "post_id": "1608123",
      "post_title": "",
      "post_author_name": "frankbmd",
      "post_content": "The next buyer of this card must have missed this listing three days ago, so I am extending the courtesy of bumping it to the top in hopes that he will not miss it again.  I am also reducing the asking price to an even $70, so he can purchase both the card and his favorite beverage at Starbucks today.  I sincerely hope that he isn't wasted away again in Margaritaville. :D",
      "post_time": "20161206T09:21:41-06:00",
      "timestamp": "1481041301"
    }
  ]
}