{
  "id": "321432",
  "forum_id": "39",
  "title": "FS: 20+ Graded T206 Cards (SGC&PSA)",
  "author": "Herpolsheimer",
  "reply_count": 0,
  "view_count": 311,
  "created_date": null,
  "last_reply": "20220624T17:45:21-06:00",
  "posts": [
    {
      "post_id": "2236961",
      "post_title": "FS: 20+ Graded T206 Cards (SGC&PSA)",
      "post_author_name": "Herpolsheimer",
      "post_content": "Aloha...\r\n\r\nTurning my attention to another set and these cards are now available.  Prices are net to me and include tracked shipping. I am trying to buy a mid-grade 1934 WWG Gehrig.  I had one years ago but sold it and it is the one card I wish I still had.  I was selective about registration and centering when I originally bought these cards.  More detailed scans are available upon request.  \r\n\r\nT206 Red Ames Portrait Piedmont 150 Back SGC 45 – New York – Partial Double Name$160\r\n[STRIKE]T206 Johnny Bates Piedmont 150 Back PSA 3 – ToledoSOLD[/STRIKE]\r\nT206 Johnny Bates Piedmont 150 Back SGC 40 – Toledo$140\r\nT206 Ginger Beaumont Portrait Piedmont 150 Back SGC 30 – Boston$160\r\nT206 Chief Bender (HOF) Portrait Piedmont 150 Back SGC A (Looks NM)$360\r\nT206 Howie Camnitz Arms Folded Piedmont 150 Back SGC 35 – Pittsburgh$120\r\nT206 Fred Clarke (HOF) Portrait Sweet Caporal 150 Fac 25 Back SGC 45$800\r\nT206 Hal Chase Throwing Sweet Caporal 350 Back SGC A (Looks EX) – New York$200\r\n[STRIKE]T206 Doc Crandall Portrait No Cap Piedmont 150 Back PSA 3 – New YorkSOLD[/STRIKE]\r\nT206 Bill Dahlen Portrait Piedmont 150 Back SGC 40 – Boston$700\r\nT206 Bill Donovan Portrait Sweet Caporal 350 Factory 30 Back - SGC 40 – Detroit$180\r\nT206 Mickey Doolin Portrait Sweet Caporal 350 Factory 30 Back - SGC 40$180\r\nT206 Larry Doyle with Bat Polar Bear Back SGC 40 – New York$200\r\nT206 Hobe Ferris Piedmont 150 Back PSA 2 – St. Louis$110\r\nT206 Billy Gilbert Piedmont 150 Back SGC 40 – St. Louis$150\r\nT206 Clark Griffith (HOF) Portrait Piedmont 150 Back - SGC 40$400\r\nT206 Tim Jordan Batting Polar Bear Back SGC A (Looks EX) – Brooklyn$110\r\nT206 Tommy Leach Bending Over Sweet Caporal Factory 42 Overprint Back SGC A$160\r\nT206 Fred Mitchell - Sweet Caporal 350 Factory 25 SGC 2.5 (1 of 1) Front/Back$2000\r\nT206 Rube Oldring Piedmont 150 Back - SGC 40 – Philadelphia$140\r\nT206 Fred Parent Portrait Piedmont 150 Back SGC 60 – Chicago$280\r\nT206 Jim Pastorius Piedmont 150 Back SGC 30 – Brooklyn$100\r\n[STRIKE]T206 Nap Rucker Throwing Polar Bear Back PSA 2 – BrooklynSOLD[/STRIKE]\r\nT206 Spike Shannon Piedmont 350 Back SGC 40 – Kansas City$120\r\nT206 Frank Smith Piedmont 150 Back SGC 30 – Chicago$100\r\n[STRIKE]T206 Bob Spade Portrait Piedmont 150 Back PSA 3 – CincinnatiSOLD[/STRIKE]\r\nT206 Bob Spade Portrait Piedmont 150 Back PSA 3.5 – Cincinnati$160\r\nT206 Harry Steinfeldt Portrait Piedmont 150 Back SGC 3 – Chicago$250",
      "post_time": "20220624T17:45:21-06:00",
      "timestamp": "1656114321"
    }
  ]
}