{
  "id": "268088",
  "forum_id": "39",
  "title": "Trade: T206 Green Cobb SGC 2 Good",
  "author": "t206madman",
  "reply_count": 6,
  "view_count": 1041,
  "created_date": null,
  "last_reply": "20190526T09:31:37-06:00",
  "posts": [
    {
      "post_id": "1870830",
      "post_title": "Trade: T206 Green Cobb SGC 2 Good",
      "post_author_name": "t206madman",
      "post_content": "1",
      "post_time": "20190416T23:29:11-06:00",
      "timestamp": "1555478951"
    },
    {
      "post_id": "1872050",
      "post_title": "",
      "post_author_name": "scottglevy",
      "post_content": "Chris\n\nI have done many trades sales and purchases. Most folks are good - a few are not.  If you have questions about someone’s integrity, ask for hobby references.  Folks that buy multi-thousand dollar cards have them from known hobbyists and auction houses.  It’s very unlikely that someone with a stellar rep will try to pull a fast one.  If you’re uncomfortable with a situation for any reason whatsoever just pass and don’t look back.  I wish I had trusted my gut on questionable deals a few times.   \n\nI hope this helps.  \n\nBest,\nScott",
      "post_time": "20190421T22:05:23-06:00",
      "timestamp": "1555905923"
    },
    {
      "post_id": "1872058",
      "post_title": "",
      "post_author_name": "t206madman",
      "post_content": "1",
      "post_time": "20190421T23:10:10-06:00",
      "timestamp": "1555909810"
    },
    {
      "post_id": "1872094",
      "post_title": "",
      "post_author_name": "Leon",
      "post_content": "Being safe is great. You can always PM me if you want to know about a user. I don't know everyone but I can pick up the phone and call them to help ease the situation. Caveat Emptor - which looks like you take to heart anyway. \r\n\r\nNot sure about your photos but after I played around with them a bit I got them right side up...\r\n\r\n\r\n[quote name=\"t206madman\" post=1872058]I understand that most if not all the sellers on here have good intentions.  I've never had any issues.  I'm just overly paranoid about losing something of value.  When I make purchases on here, at least I'm covered with a credit card chargeback or some type of bank intervention if something goes bad.  \r\n\r\nNot to sound crazy, but when I upgraded my Green Cobb from someone here, I made sure to open the package on my security cameras.  It's no disrespect to the seller at all, it's just me being paranoid and wanting proof of what's in the package, because it was really expensive and if something was missing, I could show the video to my bank and go from there.  \r\n\r\nAs for a trade, that seems like there isn't any type of insurance you'll get what you're supposed to get.  If I were to make a trade, I would probably video record myself packaging it and mailing it at FedEX.  If someone were to steal from me or send me the wrong item, I don't even know how I would proceed.  My wealth isn't established enough to just take $4-5k losses just yet.  I guess I would try to sue them, I really have no clue what you do in that situation. \r\n\r\nAlso about my sideways photos, if I click on them and open the photo in a new tab, they are the correct side up.  The original file is also the correct side up on my pc.  Something about the upload preview is turning them and if someone knows how to fix that please let me know.[/QUOTE]",
      "post_time": "20190422T08:47:46-06:00",
      "timestamp": "1555944466"
    },
    {
      "post_id": "1873657",
      "post_title": "",
      "post_author_name": "t206madman",
      "post_content": "1",
      "post_time": "20190429T10:42:55-06:00",
      "timestamp": "1556556175"
    },
    {
      "post_id": "1875973",
      "post_title": "",
      "post_author_name": "t206madman",
      "post_content": "1",
      "post_time": "20190508T08:28:29-06:00",
      "timestamp": "1557325709"
    },
    {
      "post_id": "1881239",
      "post_title": "Bump",
      "post_author_name": "t206madman",
      "post_content": "1",
      "post_time": "20190526T09:31:37-06:00",
      "timestamp": "1558884697"
    }
  ]
}