{
  "id": "190483",
  "forum_id": "39",
  "title": "cards are sold",
  "author": "the 'stache",
  "reply_count": 3,
  "view_count": 471,
  "created_date": null,
  "last_reply": "20140718T00:41:58-06:00",
  "posts": [
    {
      "post_id": "1294887",
      "post_title": "cards are sold",
      "post_author_name": "the 'stache",
      "post_content": "Hello all,\r\n\r\nI am selling two Hall of Famers from the T206 set, portraits of Fred Clarke and Clark Griffith. Both have been graded PSA 3.\r\n\r\nThe Clark Griffith is sold.\r\nThe Fred Clarke is sold.\r\n\r\nThese prices are firm, and I will cover the costs of mailing and shipping supplies. Cards will be sent in bubble mailers with cardboard backing. These are pretty nice cards. I am just upgrading my T206 collection to higher grades. Edit: preferred method of payment is Paypal friends & family. If you prefer to do Paypal goods & services instead, please add $3.74 to the payment. If you don't do Paypal, please contact me. We can work something out.  \r\n\r\nThe Clark Griffith has strong eye appeal. The centering left to right is quite good, but it is shifted downward from he top. I'd say the top to bottom centering is closer to 70/30. The back centering is off down and to the right. There is a fair amount of corner and edge wear consistent with the grade. The surface is relatively clean. There is a minor wrinkle across the lower-right corner that runs into both sides of the white border. There is another very minor wrinkle under his right collar that extends up slightly into the white border. Both are very difficult to see, and may not be visible on the scans. \r\n\r\nThe Fred Clarke similarly exhibits even corner and edge wear, consistent with the 3 grade it received. There are no creases visible under bright light and magnification. The card front has some very minor speckling where the red background appears to have chipped. The centering is outstanding. \r\n\r\nThe main issue with this card appears at the upper left hand corner. It is more easily seen when viewing the back scan (it will appear in the upper right). It looks as if the top edge running to the right corner has worn down somewhat, creating an indentation of about 1 centimeter. This indentation runs about 1/4 of an inch on the top edge. I am providing front and back scans of both cards , and links to front and back scans of each card at 600 dpi. Please look over these carefully. If you have any questions, please feel free to message me. I will check my messages sometime tomorrow, though it might be in the evening.\r\n\r\nThank you for looking!!! \r\n\r\n[IMG]http://imageshack.com/a/img850/6116/o74r.png[/IMG][IMG]http://imagizer.imageshack.us/a/img829/1842/l144.png[/IMG]\r\n\r\n\r\n600 dpi scans\r\n[URL=\"http://imageshack.com/a/img856/1084/4ny1.png\"]Clark Griffith front[/URL]\r\n[URL=\"http://imageshack.com/a/img840/750/w0ko.png\"]Clark Griffith back[/URL]",
      "post_time": "20140707T01:57:42-06:00",
      "timestamp": "1404719862"
    },
    {
      "post_id": "1298053",
      "post_title": "",
      "post_author_name": "the 'stache",
      "post_content": "Price has been lowered to $110.00.",
      "post_time": "20140715T06:11:05-06:00",
      "timestamp": "1405426265"
    },
    {
      "post_id": "1298958",
      "post_title": "",
      "post_author_name": "drazz5",
      "post_content": "How is this only graded a 3? great card. best of luck",
      "post_time": "20140717T13:02:03-06:00",
      "timestamp": "1405623723"
    },
    {
      "post_id": "1299176",
      "post_title": "",
      "post_author_name": "the 'stache",
      "post_content": "Thanks, Daniel. I don't know, to be honest. The only flaw I really see in the card is a very light crease in the lower right corner. But you really have to look for it to see it. I guess that and the centering top to bottom being shifted a bit was enough to grade it a 3.\r\n\r\nOh well. I'll give it a few more days.",
      "post_time": "20140718T00:41:58-06:00",
      "timestamp": "1405665718"
    }
  ]
}