{
  "id": "278709",
  "forum_id": "39",
  "title": "My \"Honus Wagner\" / Art Fletcher Card",
  "author": "REDSOX_1969_LIVERPOOL FC",
  "reply_count": 1,
  "view_count": 261,
  "created_date": null,
  "last_reply": "20200128T19:58:38-06:00",
  "posts": [
    {
      "post_id": "1950992",
      "post_title": "My \"Honus Wagner\" / Art Fletcher Card",
      "post_author_name": "REDSOX_1969_LIVERPOOL FC",
      "post_content": "I thought some of you might enjoy this unique \"card\" in my collection.  \r\n\r\nFirst, some background.  I purchased the majority of my T206 cards from an older gentleman (he's @ 85 yrs. old) who grew up in North Carolina.  I believe he got his cards from his father or another family member.  I understand that his family owned a small dry goods store, and I assume he was able to collect the cards from folks who purchased Piedmont cigarettes at the store. Anyhow, this card really exemplifies how hard it has always been to find a Honus Wagner.\r\n\r\nMy card is a \"Honus Wagner\" / Art Fletcher.  My best guess is that some boy, maybe the man I purchased the card from, was frustrated about not having a Honus Wagner T206 so he decided to take matters into his own hands.  The card is really an Art Fletcher, N.Y. Giants, but with a photograph of Honus Wagner pasted onto it.  Pretty smart!  Kids are so creative. \r\n\r\nThat much I knew.  But I had no idea about the photo or where it came from. So I researched and dug and dug, but I couldn't find anything.  After a few months of casually searching the internet, I looked at the card again.  I read the caption under the photo of Hans Wagner: \"The man who for the past twelve years has batted the Spalding National League Ball with an average never lower than .305.\"  After reading that line dozens of times, it struck me.  Why Spalding National League Ball?  And capitalized.  Hmmm.  Why would someone write it that way?  Who would care so much?  Then I got it.  Spalding.  It was something related to Spalding.  \r\n\r\nTwenty minutes later, I found it!  The photo of Hans Wagner pasted onto the Art Fletcher card was cut out directly from the 1909 Spalding Catalogue.  I sat there staring at my computer screen, thinking how over a 100 years ago a boy picked up scissors and cut that paper out of a Spalding Catalogue and pasted it onto his Art Fletcher card (glad it wasn't pasted on a HOF card).  \r\n\r\nAttached are some photos of the card, my other Art Fletcher card, and photos of the 1909 Spalding Catalogue.\r\n\r\nI get a real kick out of the backstory behind this card.  I doubt it's worth anything much, but I love it all the same.  \r\n\r\nThat's the story behind my \"Honus Wagner\" card.  :)",
      "post_time": "20200128T16:51:45-06:00",
      "timestamp": "1580255505"
    },
    {
      "post_id": "1951049",
      "post_title": "",
      "post_author_name": "luciobar1980",
      "post_content": "Ha, that's cool.",
      "post_time": "20200128T19:58:38-06:00",
      "timestamp": "1580266718"
    }
  ]
}