{
  "id": "349411",
  "forum_id": "39",
  "title": "What is the best way to sell my T-206 set (520 cards)?",
  "author": "FFIMARRIOTT",
  "reply_count": 13,
  "view_count": 1826,
  "created_date": null,
  "last_reply": "20240516T11:25:24-06:00",
  "posts": [
    {
      "post_id": "2434616",
      "post_title": "What is the best way to sell my T-206 set (520 cards)?",
      "post_author_name": "FFIMARRIOTT",
      "post_content": "It took me 30 years to collect this set (520 cards - not including \"The Big Four\"), and I have enjoyed having the complete set for the past 4 years. It has been sitting in a safe deposit box for a while, and I am considering selling it, so someone else can enjoy it. I have painstakingly used several methods to track and update pricing of all 520 cards in an excel spreadsheet (using this site, Beckett, Tuff Stuff, PSA, and more), and it has an estimated value of $45,000.00-$48,000.00, based on the condition of the cards (about 30 are graded, including HOF'ers).\r\n\r\nWhat is the best way to sell this, so I can get the most $ for it? I know auction houses/companies can take quite a bit of commission. \r\n\r\nAny legitimate, helpful answers will be considered.",
      "post_time": "20240515T10:50:10-06:00",
      "timestamp": "1715791810"
    },
    {
      "post_id": "2434632",
      "post_title": "To maximize value",
      "post_author_name": "Cory",
      "post_content": "The best way to maximize value to you is going to be to sell it card by card through a combination of here, facebook and ebay.  \r\n\r\nBut that is A LOT of work. Is it worth it? You have to decide.\r\n\r\nYou can consign to a large auction house like Heritage or REA and they will likely sell it as a complete collection where it nets less.  Plus fees.\r\n\r\nYou can consign to a smaller auction house that may piece it out and sell individually.  Net prices may be less given smaller audiences, but overall may net more.\r\n\r\nYou can consign to an ebay seller like probstein or greg morris which will likely yield the highest gross prices as it gets pieced out on ebay, but not sure about net.  It seems lik GM fees were pretty high (25%?) And I think probsteins recently went up.\r\n\r\nAnother option may be to sell the highest value cards yourself (Cobbs, Mattys, Youngs, WaJos, short prints etc) then lot the others into southern leaguers, minor leaguers, commons, other HoF etc.  \r\n\r\nMy thought.  Curious what others think.",
      "post_time": "20240515T12:17:49-06:00",
      "timestamp": "1715797069"
    },
    {
      "post_id": "2434634",
      "post_title": "Top Heavy",
      "post_author_name": "Cory",
      "post_content": "By my simple calculations, for my set the top 20 cards are roughly 55% of the value(cost).  \r\n\r\nSo to maximize what you net and minimize the hassle - that's probably your best bet - sell the top 20 or so cards yourself with no fees.  Then consign the rest to someone that will sell them individually.",
      "post_time": "20240515T12:28:35-06:00",
      "timestamp": "1715797715"
    },
    {
      "post_id": "2434635",
      "post_title": "",
      "post_author_name": "T206Collector",
      "post_content": "[quote name=\"Cory\" post=2434632]The best way to maximize value to you is going to be to sell it card by card through a combination of here, facebook and ebay.  \r\n\r\nBut that is A LOT of work. Is it worth it? You have to decide.\r\n\r\nYou can consign to a large auction house like Heritage or REA and they will likely sell it as a complete collection where it nets less.  Plus fees.\r\n\r\nYou can consign to a smaller auction house that may piece it out and sell individually.  Net prices may be less given smaller audiences, but overall may net more.\r\n\r\nYou can consign to an ebay seller like probstein or greg morris which will likely yield the highest gross prices as it gets pieced out on ebay, but not sure about net.  It seems lik GM fees were pretty high (25%?) And I think probsteins recently went up.\r\n\r\nAnother option may be to sell the highest value cards yourself (Cobbs, Mattys, Youngs, WaJos, short prints etc) then lot the others into southern leaguers, minor leaguers, commons, other HoF etc.  \r\n\r\nMy thought.  Curious what others think.[/QUOTE]\r\n\r\n+1",
      "post_time": "20240515T12:28:38-06:00",
      "timestamp": "1715797718"
    },
    {
      "post_id": "2434695",
      "post_title": "",
      "post_author_name": "SDGsports",
      "post_content": "You may be under valuing your collection ... \r\n(Condition Pending)\r\nI started this set 13 months ago.  \r\nI currently have 461/520\r\n\r\nI have spent $40,613\r\n\r\nOf the 59 cards I'm missing, 39 are Short Prints or HOFers and I calculate I'll still have to spend another $20-25K to reach 520 / 520 with anything better than a Beater.\r\n\r\n\r\nPM me before you sell.",
      "post_time": "20240515T16:37:54-06:00",
      "timestamp": "1715812674"
    },
    {
      "post_id": "2434696",
      "post_title": "",
      "post_author_name": "SDGsports",
      "post_content": ".",
      "post_time": "20240515T16:39:55-06:00",
      "timestamp": "1715812795"
    },
    {
      "post_id": "2434707",
      "post_title": "",
      "post_author_name": "rand1com",
      "post_content": "You will clearly get the most cash by consigning to a major auction house. You will be able to get a favorable consignment rate of zero for a consignment of this value so you would get the hammer price. Some houses would even give a small portion of the buyer premium for a $50K consignment.\r\n\r\nMy opinion is that selling as a set will yield the most because there are plenty of collectors who do not have the patience to put a set together but would pay more for a complete set minus the big 4 and would pay more for not having to put forth any effort other than spending cash. But, the auction houses may have other opinions depending on condition of the better HOFers.\r\n\r\nSets rarely come up for auction and are usually pieced out so selling a complete set would be an oddity.\r\n\r\nBased on your valuation, the set has to be in lower grade condition. If the Cobbs, Mathewsons, Youngs, Johnsons, and the other key cards are graded higher than 1 or 2, then breaking the set might make sense. \r\n\r\nEven on Ebay, you are giving up 12.35% of the hammer so using an auction house with no fees easily surpasses selling it yourself on Ebay with no effort required on your part.\r\n\r\nJust one opinion of course. I'm sure there will be plenty of dissenters.",
      "post_time": "20240515T17:39:59-06:00",
      "timestamp": "1715816399"
    },
    {
      "post_id": "2434723",
      "post_title": "",
      "post_author_name": "Rhotchkiss",
      "post_content": "Can you post a pic of maybe a few Cobbs, a few HOF portraits and the PB Demmett and O’Hara?  I think condition makes a big difference.  You may want to have them all graded, as the set will certainly bring more that way, but only if the biggies are worth grading",
      "post_time": "20240515T18:47:04-06:00",
      "timestamp": "1715820424"
    },
    {
      "post_id": "2434737",
      "post_title": "",
      "post_author_name": "Lucas00",
      "post_content": "I can't see a better way of selling than posting a big list with higher end comps (or even more expensive based on rarity) each card Individually. There's just no conceivable way I can see them doing better as a 520 card lot. \n\nIf a Cobb goes for $5000 that you have, selling it for $5000 is far better than selling the 520 card lot and the Cobb coming out to an estimated price of $4200. That's my mindset at least. And can be applied to them all imo. Eye appeal is also huge (obviously) if you see a recent sale of a same grade lajoie for $400 and it has a small crease or something and yours looks just as good with no crease  you could easily ask for several hundred more. These kinds of things just aren't taken into account when you're talking about 520 card lots. And the numbers can really add up. It's just a lot of work and a ton of typing. Which it seems like you already did a good bit of. People will value the time it takes heading to the post office once vs 300 times and a single payment far more and happily take $5000 (or whatever the number may be) less. It's just what suits you, just my thoughts.",
      "post_time": "20240515T19:28:39-06:00",
      "timestamp": "1715822919"
    },
    {
      "post_id": "2434738",
      "post_title": "",
      "post_author_name": "bbcard1",
      "post_content": "I can't imagine a 520 being worth less than 80K-100K...I mean presentable low grade commons are fetching in the $40 range now.",
      "post_time": "20240515T19:32:16-06:00",
      "timestamp": "1715823136"
    },
    {
      "post_id": "2434767",
      "post_title": "",
      "post_author_name": "Kidnapped18",
      "post_content": "Post them here and sell on the BST\nI know I would certainly be interested in looking at a few and prefer buying direct on net54",
      "post_time": "20240515T21:26:55-06:00",
      "timestamp": "1715830015"
    },
    {
      "post_id": "2434796",
      "post_title": "",
      "post_author_name": "rjackson44",
      "post_content": "I have 221 different and love buying from dave bergin ,hi dave..i will never sell only to upgrade,,me and my pup love looking at them .thats why i love net 54.anyway good luck with sale octavio",
      "post_time": "20240516T05:08:09-06:00",
      "timestamp": "1715857689"
    },
    {
      "post_id": "2434856",
      "post_title": "",
      "post_author_name": "bbcard1",
      "post_content": "You know, sooner or later one of the breaks is going to do a T206 set. I would not be surprised at a $175-200 per slot price point...I bought a slot in a 1952 Topps break and it was exciting to watch, even though I only ended up with a common. You might check with some of the breakers like Burls. I know he'd love to do it.",
      "post_time": "20240516T10:23:31-06:00",
      "timestamp": "1715876611"
    },
    {
      "post_id": "2434870",
      "post_title": "",
      "post_author_name": "unamuzd1",
      "post_content": "This is a great question, and one that I ponder sometimes. I won't hold my 520 forever, but it's not a \"standard\" 520 because I have a fondness for oddball/unique cards. Backstamps, funky registration errors, double names, visible portions of a second back - I hope Net54 is still around and as helpful for me when the time comes as folks are being for you!\r\n\r\nAnd even though I know most of my \"big\" cards aren't going to grade more than a 1 (if that, in several cases!), I'm probably sending a bunch to SGC shortly, because it'll just feel that much safer to have Cobb et al. in slabs. Around 120 are currently in slabs, according to my spreadsheet.",
      "post_time": "20240516T11:25:24-06:00",
      "timestamp": "1715880324"
    }
  ]
}