{
  "id": "298197",
  "forum_id": "39",
  "title": "SOLD: T206 Sweet Cap Frank Chance Portrait",
  "author": "robw1959",
  "reply_count": 2,
  "view_count": 254,
  "created_date": null,
  "last_reply": "20210307T16:31:14-06:00",
  "posts": [
    {
      "post_id": "2077973",
      "post_title": "SOLD: T206 Sweet Cap Frank Chance Portrait",
      "post_author_name": "robw1959",
      "post_content": "SOLD: Orange background portrait version, no creases. Asking $350 net delivered, PayPal preferred.\r\n\r\nSuccessful transactions with: Sean1125, 39special, Ericc22, asoriano, Econteachert205, oldcardboard, tolstoi, Jobu, simas7173, espomario, jmb, Charlie Faust III, Paul S, quitcrab, avalanche2006, Beatles Guy, Banjo, tjenkins, botn, trdcrdkid, jtschantz, longstreet766, greenmonster66, edjs, jb67, rhotchkiss, Puckettfan, mybuddyinc, frankbmd, Baseball*Collections, btcarfagno, Luke, vintageonlybb, bigfish, t206collector, marvymelvin, benginino9, bigedmachine, Stampsfan, Moonlight Graham, Rebublicaninmass, Gradedcardman, Tigerden, Smanzari, t206kid, clydepepper, Scott L., Brian Van Horn, t206whiteborder, polakoff, GoCubsGo32, Hxcmilkshake, Scott Garner, Goudey77, rdixon1208, Pat R, Bram99, bks14sr, Haybag, charlietheexterminator, fusorcruiser, Mutton Chap Yaz, ncinin, rootsearcher60, GoldenAge50s, thecomebacker, Kryksir, T206.org, seattlebaseball, banksfan14, slantycouch, forceplay sport, niembre, nickers, Kris19, bounce, aloondilana, lrush, fusorcruiser, cardsagain74, aronbenabe, JollyElm, Charger74, Cooper1972, ainmon, Gorditadogg, AWGreen, chadeast, ahumes13",
      "post_time": "20210307T12:44:23-06:00",
      "timestamp": "1615146263"
    },
    {
      "post_id": "2078018",
      "post_title": "",
      "post_author_name": "griffon512",
      "post_content": "really nice card.  looks like there is a small break in the cardboard stock extending from the right edge of the card to the middle of the card.  it's near the top of the yellow if trying to pinpoint what I'm looking at vertically.  \r\n\r\nI asked because you said there are no creases and I'm trying to figure out what that is if not a wrinkle/crease.",
      "post_time": "20210307T13:29:33-06:00",
      "timestamp": "1615148973"
    },
    {
      "post_id": "2078115",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "It just looks like a series of dots along the top portion to me. Definitely not a crease since I can't feel it at all.",
      "post_time": "20210307T16:31:14-06:00",
      "timestamp": "1615159874"
    }
  ]
}