{
  "id": "319523",
  "forum_id": "39",
  "title": "Sold",
  "author": "53toppscollector",
  "reply_count": 7,
  "view_count": 700,
  "created_date": null,
  "last_reply": "20220524T20:49:25-06:00",
  "posts": [
    {
      "post_id": "2224219",
      "post_title": "Sold",
      "post_author_name": "53toppscollector",
      "post_content": "Please read the caveats section below before buying. Thanks\r\n\r\nFor Sale:\r\n\r\n\r\n\r\nCaveats\r\n\r\n1. I have included the images here as attachments. The images are very large, so hopefully they are sufficient. If you require more images, please PM me.\r\n\r\n2. If a card I am selling was cracked out of a PSA/SGC/BVG/GAI holder, I will note that in the listing. If the person I bought the card from told me it was trimmed or altered in any way, I will note that.\r\n\r\n3. If you are concerned a card might be altered or trimmed, I'd suggest passing on the listing. I don't have a ruler to measure cards, and I am only concerned that they are authentic. Your mileage may vary.\r\n\r\n4. All listed prices include shipping. I ship in cardsavers in a bubble mailer, USPS first class. Because I do not trust the blue dropboxes (and the mail is broken here), I drop off every package at the post office in person and I receive an acceptance scan. If the post office loses it after that, I obviously can't control that, but I can assure you that your mailer is being handed to someone in a post office, not dropped into a box outside.\r\n\r\n5. Due to COVID worries, I usually only go to the post office once per week, usually on Tuesdays. Subject to change.\r\n\r\n6. I only accept Paypal FF.\r\n\r\n7. Offers always welcome, and I will almost always counteroffer at a minimum.\r\n\r\n8. If you have questions, please send a PM. Thanks",
      "post_time": "20220512T11:51:37-06:00",
      "timestamp": "1652377897"
    },
    {
      "post_id": "2224247",
      "post_title": "",
      "post_author_name": "bb206",
      "post_content": "PM sent",
      "post_time": "20220512T13:29:25-06:00",
      "timestamp": "1652383765"
    },
    {
      "post_id": "2225080",
      "post_title": "",
      "post_author_name": "53toppscollector",
      "post_content": "Sovereign and Tolstoi have sold, the rest are still available. Debating pulling the Old Mill back and sending it to SGC for grading, but haven't decided yet, so I will keep it listed for now.",
      "post_time": "20220515T10:21:31-06:00",
      "timestamp": "1652631691"
    },
    {
      "post_id": "2225931",
      "post_title": "",
      "post_author_name": "53toppscollector",
      "post_content": "price drops on the remaining. post office tomorrow, if you buy and pay before 3pm tomorrow, your cards will ship out this week. thanks for looking",
      "post_time": "20220518T07:30:17-06:00",
      "timestamp": "1652880617"
    },
    {
      "post_id": "2226484",
      "post_title": "",
      "post_author_name": "53toppscollector",
      "post_content": "price reductions posted",
      "post_time": "20220520T07:03:28-06:00",
      "timestamp": "1653051808"
    },
    {
      "post_id": "2227275",
      "post_title": "",
      "post_author_name": "53toppscollector",
      "post_content": "Cycle sold, first post updated.",
      "post_time": "20220522T19:27:15-06:00",
      "timestamp": "1653269235"
    },
    {
      "post_id": "2227700",
      "post_title": "",
      "post_author_name": "53toppscollector",
      "post_content": "prices reduced to rock bottom. if you pay by 3pm today, I will get your package in the mail this afternoon.\r\n\r\nIf these don't sell at these prices, to ebay they will go.",
      "post_time": "20220524T07:05:33-06:00",
      "timestamp": "1653397533"
    },
    {
      "post_id": "2227959",
      "post_title": "",
      "post_author_name": "53toppscollector",
      "post_content": "only the Piedmont and Polar Bear remain. They are priced to sell.",
      "post_time": "20220524T20:49:25-06:00",
      "timestamp": "1653446965"
    }
  ]
}