{
  "id": "262889",
  "forum_id": "39",
  "title": "FS: \"The T206 Collection - The Players & Their Stories\" NEW SECOND EDITION",
  "author": "DerekMichael",
  "reply_count": 0,
  "view_count": 395,
  "created_date": null,
  "last_reply": "20181203T15:38:29-06:00",
  "posts": [
    {
      "post_id": "1832662",
      "post_title": "FS: \"The T206 Collection - The Players & Their Stories\" NEW SECOND EDITION",
      "post_author_name": "DerekMichael",
      "post_content": "Hello Everyone.\n\nI wanted to announce that for anyone who is interested the brand new Second Edition of the book \"The T206 Collection - The Players & Their Stories\" by Tom & Ellen Zappala is now available for purchase. The book is a collection of biographies and statistics as shown through the timeless and truly beautiful 1909-11 T206 Collection as well as three additional chapters relating to the set. Tom and Ellen along with Joe Orlando, (as well as other wonderful contributors) have written several great books for lovers of baseball and baseball collectibles.\n\nThe new second edition of the T206 Collection features brand new imagery with all reproduction images now removed. The book features only genuine T206 now with many very spectacular and highly graded examples throughout. This was made possible due to wonderful contributors who sacrificed time and resources through the process. Without them this would not have been possible and I owe them an immense amount of gratitude.\n\nAdditionally, the book offers two new chapters featuring the absolutely spectacular \"Lucky 7 Find\" of rare Ty Cobb \"King Of The Smoking Tobacco World\" cards as originally told by Joe Orlando with all EIGHT examples present, as well as a chapter paying tribute to the various backs of the set.\n\nIf you are interested in purchasing a copy or learning more please click the link below or feel free to contact us at t206society@gmail.com\n\nThank you very much for taking the time to read this post and thank you to net54 for allowing me to share this.\n\nRespectfully,\n\nDerek Hogue\nT206 Society\n\nLink To Book: [url]http://t206society.com/product/the-t...ellen-zappala/[/url]\n\nT206 For Sale:  [url]http://t206society.com/product-tag/for-sale/[/url]\n\nT206 Society - Starting 9: [url]http://t206society.com/product/t206-society-collection/[/url]\n\nHome Page: [url]http://t206society.com/[/url]",
      "post_time": "20181203T15:38:29-06:00",
      "timestamp": "1543876709"
    }
  ]
}