{
  "id": "201680",
  "forum_id": "4",
  "title": "FS: 1913 Pyle & Allen Cleveland Naps advertising postcard - Fred Carisch",
  "author": "Rob D.",
  "reply_count": 1,
  "view_count": 588,
  "created_date": null,
  "last_reply": "20150716T04:09:26-06:00",
  "posts": [
    {
      "post_id": "1380615",
      "post_title": "FS: 1913 Pyle & Allen Cleveland Naps advertising postcard - Fred Carisch",
      "post_author_name": "Rob D.",
      "post_content": "Here's the description from when REA sold this postcard:\n\nExtremely scarce example of Fred Carisch from the 1913 Pyle & Allen postcard series. These postcards, which measure 3.5 x 7 inches, feature the portrait image of a member of the Cleveland Naps team on front and advertising for home games on the reverse. The offered example depicts Fred Carisch and advertises a Labor Day double header against the Chicago White Sox, as well as a two-game series against the Detroit Tigers, billed as \"the last chance to see Ty Cobb, Sam Crawford and Hughie Jennings this season.\" Tickets for each of these games were available for sale at the Pyle & Allen Co.'s cigar store in Cleveland. Presenting as Vg-Ex, with even wear to the corners and faint one-inch creases at the top and bottom edges, the postcard has been encapsulated by SGC and has been harshly graded (POOR 10) solely due to a typewritten address on front. Interestingly, we have only ever seen five other examples from this series, each of which is addressed similarly to one of two people at the Sherwin Williams Company in Cleveland. The offered example also displays a very faint stamp on front, which reads \"Printing & Sampling Dept/ Aug 28 1913,\" suggesting the possibility that Sherwin Williams may have been involved in the production of these postcards. The reverse is boldly printed with only the faint pencil erasure of \"1913\" in the top right corner. This is an outstanding example of this rare regional advertising postcard which would be a worthy addition to any Cleveland Naps or sample-card collection.\n\nPrice is $870 delivered within the United States.\n\nPayPal is fine. No need to \"gift\" your payment. (Check, cash, money order also OK and preferred).\n\nA commitment to buy takes precedence over an ongoing negotiation. :rolleyes: \n\n[URL=\"wolfie51sb@aol.com\"]Feel free to email any questions.[/URL]\n\nThanks,\n\nRob\n\n[URL=\"wolfie51sb@aol.com\"]wolfie51sb at aol dot com[/URL]\n\n[IMG]http://photos.imageevent.com/ineedanap/otherphotos/carisch.jpg[/IMG]\n\n[IMG]http://photos.imageevent.com/ineedanap/otherphotos/carisch-rev.jpg[/IMG]\n\n[IMG]http://www.robertedwardauctions.com/auction/2014_springimages/item_31937_1.jpg[/IMG]\n\n[IMG]http://www.robertedwardauctions.com/auction/2014_springimages/item_31937_2.jpg[/IMG]",
      "post_time": "20150215T11:25:51-06:00",
      "timestamp": "1424024751"
    },
    {
      "post_id": "1431839",
      "post_title": "",
      "post_author_name": "Rob D.",
      "post_content": "Thought this was sold, then *poof* the buyer disappeared. Hence, this bump.\n\nThanks,\n\nRob\n\nVP Sports Cards",
      "post_time": "20150716T04:09:26-06:00",
      "timestamp": "1437041366"
    }
  ]
}