{
  "id": "252953",
  "forum_id": "4",
  "title": "Whitney w/ Dog Old Judge n172 (LOTG)",
  "author": "HolyGrail",
  "reply_count": 4,
  "view_count": 851,
  "created_date": null,
  "last_reply": "20180327T07:15:56-06:00",
  "posts": [
    {
      "post_id": "1760579",
      "post_title": "Whitney w/ Dog Old Judge n172 (LOTG)",
      "post_author_name": "HolyGrail",
      "post_content": "Closing tonight in Love of the Game Auctions.\n\n[url]http://loveofthegameauctions.com/1887_N172_Old_Judge_Cigarettes_Art_Whitney_w_Dog__-LOT14801.aspx[/url]\n\nI wonder if the back is Whitney's signature, but it's impossible to tell.",
      "post_time": "20180324T11:44:21-06:00",
      "timestamp": "1521913461"
    },
    {
      "post_id": "1760690",
      "post_title": "Story About Whitney w/ Dog (Love of the Game Auctions)",
      "post_author_name": "HolyGrail",
      "post_content": "Excerpt from 3/21 Forbes story highlighting Whitney and Dog.\n\nThe Rich History of Dogs and Baseball Cards\n\n“Like all dogs, they probably worshipped their human companion and didn’t know or care whether he was an all-star or a bench warmer,” wrote the late baseball card historian Bob Lemke  about the many pooch-owning baseball players. “The dogs waited at home each night for the big guy to come home, sensing whether he’d gone 4-for-4 and would be up for a game of fetch.”\n\nImages of dogs have been collectors’ and investors’ best friends since the beginning of baseball cards. And they fit any budget.\n\nLet’s start out with one of the most popular baseball cards in history. In 1887 Old Judge cigarettes issued a tobacco card of a small dog named Midget putting his precious paw on the knee of iourneyman infielder Art Whitney.\n\n\nThis delightful card is believed to have been a commentary on Midget’s loyalty to his master versus Whitney’s to his teams. During the course of his career, from 1880 to 1891, Whitney bounced between ten clubs in six cities, though he may have simply been released due to his good-field, no-hit reputation.\n\n\nThe original owner of this Midget and Whitney, now for sale, was so proud that he wrote the date on the back when he acquired it. They sure don't write like that anymore.\n\nWhatever the case, Midget and his master are pure cardboard gold. In 2016, an extremely rare oversized cabinet card version sold for a tail-wagging $18,000 in an Robert Edward auction. Last, September, a standard, smaller copy sold in a Mile High auction for $1,372, almost five times its historic average in an “Authentic” grade.\n\nWhitney and Midget bring prices that dwarf all but the biggest stars among the Hall of Famers in the set.  Although there are probably fewer than 100 copies in existence, as with other common poses from the set, you’re not too late to jump into the market. Heritage has one of the best copies, in excellent condition, up for auction starting March 28th. The pre-sale estimate is more than $4,000.\n\nA more affordable alternative, about $1200 in good condition, is in a Love of the Game auction ending on March 24. The first owner of this very handsome example was so happy that he wrote the date of his acquisition—12/21/87— on the back. “Speculating about what the writing might be, and from where it may have originated, only adds to its appeal!” declares the auction house.",
      "post_time": "20180324T18:16:25-06:00",
      "timestamp": "1521936985"
    },
    {
      "post_id": "1761464",
      "post_title": "well",
      "post_author_name": "1880nonsports",
      "post_content": "it's my only old judge baseball player card. I have it in my type collection as the idea of the pairing interested me. Hope you did well in the auction.",
      "post_time": "20180326T22:58:21-06:00",
      "timestamp": "1522126701"
    },
    {
      "post_id": "1761466",
      "post_title": "",
      "post_author_name": "RedsFan1941",
      "post_content": "i thought someone got a bargain based on the popularity of that card and what they usually sell for (with apologies to the OP :)",
      "post_time": "20180326T23:32:46-06:00",
      "timestamp": "1522128766"
    },
    {
      "post_id": "1761505",
      "post_title": "",
      "post_author_name": "Leon",
      "post_content": "[quote name=\"RedsFan1941\" post=1761466]i thought someone got a bargain based on the popularity of that card and what they usually sell for (with apologies to the OP :)[/QUOTE]\n\nI paid about that for mine (since sold) several years ago and it didn't look any better. I thought the price was spot on for that card.",
      "post_time": "20180327T07:15:56-06:00",
      "timestamp": "1522156556"
    }
  ]
}