{
  "id": "240218",
  "forum_id": "4",
  "title": "Two Old Judges for Sale or Trade",
  "author": "kkkkandp",
  "reply_count": 1,
  "view_count": 529,
  "created_date": null,
  "last_reply": "20170530T10:50:24-06:00",
  "posts": [
    {
      "post_id": "1664567",
      "post_title": "Two Old Judges for Sale or Trade",
      "post_author_name": "kkkkandp",
      "post_content": "Available are two cards - Hanrahan and Swartzel - from a recent  Heritage lot. [url]https://sports.ha.com/itm/baseball/1887-90-n172-old-judge-sgc-graded-collection-10-/a/7190-80017.s?ic4=GalleryView-Thumbnail-071515[/url]\n\nThey are both Western Association players, which, as you know from the recent posts on the board, are less common teams.\n\nThe Swartzel is, as you can tell from the grade, is a fine specimen. The Hanrahan would likely have gotten that good a grade as well, if not for a  1/4\" x 2 1/2\" scuff mark on the rear of the card where it was likely affixed to a scrapbook. The fronts of both cards are gorgeous - square corners, well centered, no foxing or cracking, nice images. The scans attached do not do the cards justice. Use the Heritage link above to blow up the images and see better for yourself.\n\nHanrahan - $300\nSwartzel - $600 \n\nWould also entertain trade requests for N172 players on my want list: Walter Bogart, John Carney, Tom Forster (Milwaukee or Hartford); Pete Hotaling (pose 236-2), Joe Miller (not pose 324-2 stooping, hands at ankles), Sam Moffett, Dave Rowe, Frank Scheibeck,  Daniel Shannon, Bill Sowders (pose 431-5 ball behind head), William Van Dyke, William Weaver, Jimmy Williams\n\nInterested parties can email me at [url]kkkkandp@aol.com[/url]",
      "post_time": "20170525T11:00:49-06:00",
      "timestamp": "1495731649"
    },
    {
      "post_id": "1665950",
      "post_title": "",
      "post_author_name": "kkkkandp",
      "post_content": "Bump for trade option addition...",
      "post_time": "20170530T10:50:24-06:00",
      "timestamp": "1496163024"
    }
  ]
}