{
  "id": "279344",
  "forum_id": "4",
  "title": "SOLD 19th Century Woodcut Collection ~25 Pieces!",
  "author": "mouschi",
  "reply_count": 3,
  "view_count": 636,
  "created_date": null,
  "last_reply": "20200531T10:09:59-06:00",
  "posts": [
    {
      "post_id": "1955299",
      "post_title": "SOLD 19th Century Woodcut Collection ~25 Pieces!",
      "post_author_name": "mouschi",
      "post_content": "FS: Civil War Era 1865-1890s Baseball Original Woodcut Collection! $SOLD shipped. Here is a video of them all: \n\n[url]https://www.youtube.com/watch?v=3lCiYMXy6O4[/url]\n\nIncludes roughly 25 pieces!\nA few facts:\n- 1865 to 1890s\n- At least one player is pictured who was in the Civil War\n- 1865 Brooklyn team\n- the first championship team ... and the first sports team invited to the white house.\n- 1869 Red Stockings - the first professional championship team (includes the entire publication!)\n- Loads of hall of famers like: Buck Ewing, Cap Anson, Mike King Kelly, Old Hoss Radbourn, Timothy Keefe, Harry Wright, George Wright, Monte Ward and more. These guys were the Babe Ruths / Cy Youngs / etc. of their generation - not just because of what they did on the field, but because they were true pioneers - many of whom are responsible for how the game of baseball is played today!\n- Also included are among the earliest professional baseball photographs that were printed!\n\nI'll remove the framed piece from the frame for better shipping, unless someone local picks these up.\n\n\n[img]http://mycollectionofcards.com/baseballcards/021420/20200214_152941.jpg [/img]\n\n[img]http://mycollectionofcards.com/baseballcards/021420/20200207_115351.jpg [/img]\n\n[img]http://mycollectionofcards.com/baseballcards/021420/20200207_115442.jpg [/img]",
      "post_time": "20200214T15:26:08-06:00",
      "timestamp": "1581719168"
    },
    {
      "post_id": "1983398",
      "post_title": "List of all Harper's Weekly",
      "post_author_name": "dougscats",
      "post_content": "Oops, this was posted on the wrong thread.  See 19th Century Woodcut Collection, under my name.  Apologies to Moushi; hope I didn't bother you.\n\nHarper's Weekly, Vol. XIII.--No. 653, New York, Saturday, July 3, 1869:  Entire issue, featuring \"The Picked Nine of the 'Red Stocking' Base-Ball Club, Cincinnati. Ohio,\" p. 421.  This is a team picture/woodcut of the first professional championship team, which covers the top half of the page.\n\nHarper's Weekly, July 25, 1874, p. 624, \"... The Philadelphia Athletics,\" Full-page woodcuts of nine individual players, featuring J. D. McBride, Civil War veteran, and a young Cap Anson, batting. \n\nHarper's Weekly, September 12, 1874, p. 761, \"The Maple-Leaf Base-ball Club of Guelph, Ontario, Canada,\"  Woodcut of team of ten, covering top half of page. \n\nHarper's Weekly, August 5, 1882, p. 493, featuring \"The Metropolitan Base-ball Nine,\" 12 NY, N players.\n\nHarper's Weekly, September 30, 1882, p. 621, featuring \"The Providence Base-Ball Club,\" with Harry and George Wright, Charles Radbourne, and J. M. Ward.\n\nHarper's Weekly, Vol. XXVII.--No. 1381, June 9. 1883, p. 364, \"Base-Ball of the Future.\"  Full-page fantasy with players on horseback.  Doubles of this one.\n\nHarper's Weekly, Vol. XXXII.--No. 1662, August 27 1888, p.820, featuring full-figured woodcuts of Charles Comiskey and W.A. Latham on bottom half of page.  Doubles of this one.\n\nHarper's Weekly, Vol. XXXII.--No. 1649, New York, Saturday, July 28, 1888, featuring \"A Ball or a Strike, Which?\"  Full-length woodcut of batter, catcher, umpire, with dugout and stands in background.  Classic and frame-worthy.\n\nHarper's Weekly, October 20, 1888, p. 793, \"The Winning Battery of the New York Baseball Club,\" featuring full-length woodcuts of Tim Keefe and Buck Ewing, covering bottom half of page.  Doubles of this one.\n\nHarper's Weekly, Vol. XXXIII.--No. 1716, New York, Saturday, November 9, 1889: Front page, featuring \"William Ewing, Captain of the New York Base-ball Club.\"  Full-Length woodcut of Buck Ewing in catcher's gear.  Frame-worthy.\n\nHarper's Weekly, package of 18 pages compiled from the 1890's featuring photos of Collegiate baseball.",
      "post_time": "20200523T07:38:52-06:00",
      "timestamp": "1590241132"
    },
    {
      "post_id": "1985989",
      "post_title": "Both guys",
      "post_author_name": "rjackson44",
      "post_content": "Have very cool stuff i enjoyed looking ,,love net 54",
      "post_time": "20200531T08:15:01-06:00",
      "timestamp": "1590934501"
    },
    {
      "post_id": "1986013",
      "post_title": "",
      "post_author_name": "mouschi",
      "post_content": "[quote name=\"rjackson44\" post=1985989]Have very cool stuff i enjoyed looking ,,love net 54[/QUOTE]\n\nThanks!  I personally only have 2 left in my collection right now, but if you want to buy some, Doug is now the seller which can be found here:  [url]https://www.net54baseball.com/showthread.php?t=283138[/url]",
      "post_time": "20200531T10:09:59-06:00",
      "timestamp": "1590941399"
    }
  ]
}