{
  "id": "68076",
  "forum_id": "4",
  "title": "Price Reduced 1883 Philadelphia Athletics AA Champs Imperial Cabinet Photo",
  "author": "Archive",
  "reply_count": 1,
  "view_count": 530,
  "created_date": null,
  "last_reply": "20060831T17:14:00-06:00",
  "posts": [
    {
      "post_id": "372188",
      "post_title": "Price Reduced 1883 Philadelphia Athletics AA Champs Imperial Cabinet Photo",
      "post_author_name": "Archive",
      "post_content": "Posted By: prewarsports\nHistorically significant Imperial Cabinet photo of the 1883 Philadelphia Athletics.  Measures about 12X10\".  Of significance are AA Rookies named Harry Stovey and Bobby Mathews.  Previously unknown photo and most likely unique to the hobby.  I do not want to sell this piece but my wife and I are completing our Home Study to hopefully adopt a Foster child who needs a home, so the cause is good.  There is a chip at the top right corner of the mount, but the piece is otherwise fantasic with a nice clear photo and the players pictured and the team itself are VERY significant to the history of the AA and baseball in general.\n\nREDUCED to $2950 until the end of the week.  If it does not sell for that, I will just tuck it away with the rest of the old stuff.\n\nThanks\nRhys Yeakley\n\n\n[IMG]http://www.network54.com/Realm/tmp/1156887155.JPG[/IMG] [IMG]http://www.network54.com/Realm/tmp/1156887137.JPG[/IMG] \n\n\nPLAYERS ARE\n\nTop Row L to R, Harry Stovey-George Bradley-Mike Moynahan-Lon Knight\n\nMiddle Row L to R, Bob Blakiston-Cub Striker-Judd Birchall-Bill Crowley-Unknown\n\nBottom Row L to R, Bobby Matthews-John O'Brien-Fred Corey-Ed Rowen\n\n\nHere is a closer picture of the players faces that a few people have asked for.[IMG]http://www.network54.com/Realm/tmp/1156893954.JPG[/IMG]",
      "post_time": "20060830T15:36:00-06:00",
      "timestamp": "1156973760"
    },
    {
      "post_id": "372189",
      "post_title": "Price Reduced 1883 Philadelphia Athletics AA Champs Imperial Cabinet Photo",
      "post_author_name": "Archive",
      "post_content": "Posted By: Joe_G.\nGreat piece Rhys and not a bad price for an attractive imperial cabinet, just the wrong team for me.\n\nBest Regards,\nJoe Gonsowski",
      "post_time": "20060831T17:14:00-06:00",
      "timestamp": "1157066040"
    }
  ]
}