{
  "id": "67869",
  "forum_id": "4",
  "title": "New items for sale",
  "author": "Archive",
  "reply_count": 2,
  "view_count": 320,
  "created_date": null,
  "last_reply": "20051107T16:56:00-06:00",
  "posts": [
    {
      "post_id": "371587",
      "post_title": "New items for sale",
      "post_author_name": "Archive",
      "post_content": "Posted By: Rhys\nHere are a few items which I will offer for 24 hours before they might hit ebay.  I will be listing many, many items over the next few days but wanted to offer a few of the \"card\" issues to the board first.  No need to post \"e mail sent\" here, the first e mails I receive on a particular item gets the card.\n\n\n\n1899 Sporting News Supplement complete set.  33 Different supplements which constitutes the entire 1899 set minus one common(John O'Conner).  These have been neatly trimmed and glued into an album.  Includes True \"rookie\" cards of Wagner, Lajoie etc.  Includes 20 Hall of Famers like Delehanty, Cy Young etc, etc.  Extremely Rare item.  $995\n\n\n\nStar Player candy cards of the following players.\n\nTris Speaker VG $550\n\nEverett Purdy VGEX $275\n\nChas Jamieson VG+ $275\n\n\nWilliam Patterson Irish Meusel GVG, Horizontal great photo looks awsome  $135\n\n\n1914 Billy Sunday Meeting Ticket, Rare, $75\n\n\n1923 Curtis Ireland SGC graded 40 (VG 3) $300\n\n\nT200 \"The Red Sox\" First ever card of the Boston Red Sox.  VG $100\n\n\n1937 OPC Jack Haynes VGEX, $75\n\n\nT204 Ramly Mitchell, VG $135\n\n\nE121 Series of 80 Schalk, Beautiful but measures a touch short.  $65 Bill Donovan RARE CARD close up face shot, VG $75\n\n\n1926 Sports Co of America, Aaron Ward NMMT (small spotting) $75.\n\n\nR311 Yankees Team with Gehrig $100, Tigers Team $65\n\n\n1926 Sporting News Premium George Uhle (rare) $50\n\n1911 Sporting News Supplements Harry Davis $40, George Mullin $30\n\n\n Circa 1905 Atlanta Georgia Professional Baseball Team Imperial Cabinet Photo.  Not sure who the players or team are, mount has light damage, Atlanta Photographer, looks great.  $250.\n\n\n8X10 Original 1917 Smokey Joe Wood original Greeley photo.  Beautiful item!  $250.\n\n\n That is good for now, the rest I will throw on ebay under the screen name Prewarsports.  Thanks for looking.",
      "post_time": "20051107T16:24:00-06:00",
      "timestamp": "1131405840"
    },
    {
      "post_id": "371588",
      "post_title": "New items for sale",
      "post_author_name": "Archive",
      "post_content": "Posted By: zach\nHey, can you please email me the scan of the Moore cut autograph ?\nThanks",
      "post_time": "20051107T16:28:00-06:00",
      "timestamp": "1131406080"
    },
    {
      "post_id": "371589",
      "post_title": "New items for sale",
      "post_author_name": "Archive",
      "post_content": "Posted By: Brian C Daniels\nCardknowledge@earthlink.net   thanks",
      "post_time": "20051107T16:56:00-06:00",
      "timestamp": "1131407760"
    }
  ]
}