{
  "id": "261130",
  "forum_id": "4",
  "title": "More Scarce Old Judges and Gypsy Queens for Sale",
  "author": "oldjudge",
  "reply_count": 1,
  "view_count": 543,
  "created_date": null,
  "last_reply": "20181020T11:40:48-06:00",
  "posts": [
    {
      "post_id": "1820749",
      "post_title": "More Scarce Old Judges and Gypsy Queens for Sale",
      "post_author_name": "oldjudge",
      "post_content": "Based on the strong response to my first listing I am listing a few more scarce Old Judges, including an amazing group of Chicago Maroon cards, and some very rare Gypsy Queens. If interested, please email me at [url]oldjudge@gmail.com[/url].\n\nThanks--Jay\n\n1. Orator Shafer--Rare pose of a very scarce player. This pose was unknown when the Old Judge book was published----$7500\n2. Jumbo Schoeneck--Scarce Chicago Marion card--$1500\n3. Fred Lange--Scarce Chicago Maroon card of the man who later authored a seminal work on the history of baseball on the West Coast---GONE\n4. William Hanrahan-Scarce Chicago Maroon card--$900\n5. Dell Darling Gypsy Queen-incredibly rare card. Chicago GQs are the toughest in the GQ universe. This card has some faults--miscut left side, paper loss front and back--but it still presents well and is truly rare--$2700\n6. Farmer Vaughn--Very scarce Old Judge card. Oval of paper disturbance from scrapbook removal on back--$2500\n7. John Crogan-Another scarce Chicago Maroon card--$860\n8. John Crogan-batting--Yet another scarce Chicago Maroon card. Top layer of paper missing from back of card but otherwise beautiful--$600\n9. Al Myers Gypsy Queen-Rare Washington GQ---$1850\n10. Roger Connor Gypsy Queen-The photograph was apparently torn during the production process of the card, but that didn't stop its' issuance. This card came from a period scrapbook find. A true rarity, albeit condition challenged---GONE",
      "post_time": "20181018T15:29:50-06:00",
      "timestamp": "1539898190"
    },
    {
      "post_id": "1821108",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "A few cards gone, many still available. Reasonable bids considered.\n\nThanks--Jay",
      "post_time": "20181020T11:40:48-06:00",
      "timestamp": "1540057248"
    }
  ]
}