{
  "id": "169388",
  "forum_id": "4",
  "title": "Cabinet Card",
  "author": "nameless",
  "reply_count": 17,
  "view_count": 1048,
  "created_date": null,
  "last_reply": "20130603T17:17:54-06:00",
  "posts": [
    {
      "post_id": "1136647",
      "post_title": "Cabinet Card",
      "post_author_name": "nameless",
      "post_content": "Picked this thing up. Not super into 19th century cabinets. Charles J. \"Charlie\" Ferguson. SOLD.\n[url]https://docs.google.com/file/d/0B-bGsTH5ueiQc1Vwc0F2aENwejg/edit?usp=sharing[/url]",
      "post_time": "20130525T21:20:06-06:00",
      "timestamp": "1369538406"
    },
    {
      "post_id": "1136649",
      "post_title": "",
      "post_author_name": "nameless",
      "post_content": "Its not trimmed/cropped on top. Just my scanner being lame. Would provide more scans to anyone interested.",
      "post_time": "20130525T21:21:44-06:00",
      "timestamp": "1369538504"
    },
    {
      "post_id": "1136716",
      "post_title": "",
      "post_author_name": "Matthew H",
      "post_content": "I think that's Jim Tyng.",
      "post_time": "20130525T23:07:03-06:00",
      "timestamp": "1369544823"
    },
    {
      "post_id": "1137081",
      "post_title": "",
      "post_author_name": "prewarsports",
      "post_content": "Get a money back guarantee.",
      "post_time": "20130526T16:10:45-06:00",
      "timestamp": "1369606245"
    },
    {
      "post_id": "1137136",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Good call Rhys. This image from NYPL collection. Same \nChip on left",
      "post_time": "20130526T18:12:43-06:00",
      "timestamp": "1369613563"
    },
    {
      "post_id": "1137187",
      "post_title": "",
      "post_author_name": "nameless",
      "post_content": "Thanks for bringing this to my attention. Again I am not a cabinet expert and I have had this thing for a few months. Not trying to scam anyone.",
      "post_time": "20130526T19:24:06-06:00",
      "timestamp": "1369617846"
    },
    {
      "post_id": "1137209",
      "post_title": "Ebay",
      "post_author_name": "nameless",
      "post_content": "I picked up this one from a lot of 12. I know a dealer who has appeared to have put them on ebay. He got his from the same source I did. I didnt pay anything really for mine so I hope he didnt get owned. I will inform him.\n[url]http://www.ebay.com/itm/BARNES-BOSTON-RED-STOCKINGS-WARREN-STUDIOS-/121113750549?pt=US_Baseball&hash=item1c32f12c15[/url]",
      "post_time": "20130526T19:44:15-06:00",
      "timestamp": "1369619055"
    },
    {
      "post_id": "1137214",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "As soon as I get the Paypal refund I am fine.",
      "post_time": "20130526T19:49:39-06:00",
      "timestamp": "1369619379"
    },
    {
      "post_id": "1137217",
      "post_title": "",
      "post_author_name": "nameless",
      "post_content": "You've been refunded. Go chillax and have a beer bro.",
      "post_time": "20130526T19:56:59-06:00",
      "timestamp": "1369619819"
    },
    {
      "post_id": "1137220",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "All is good--thanks.",
      "post_time": "20130526T20:00:15-06:00",
      "timestamp": "1369620015"
    },
    {
      "post_id": "1137222",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Hopefully, the guy who is making these gets nabbed.",
      "post_time": "20130526T20:01:40-06:00",
      "timestamp": "1369620100"
    },
    {
      "post_id": "1137312",
      "post_title": "",
      "post_author_name": "Matthew H",
      "post_content": "FYI, JJ\n\nRegarding studio cabinets, the photo should be mounted, not printed on.  If its the latter, it's fake.",
      "post_time": "20130527T00:12:43-06:00",
      "timestamp": "1369635163"
    },
    {
      "post_id": "1137351",
      "post_title": "Exert",
      "post_author_name": "nameless",
      "post_content": "This is the question/warning I gave to the ebay person selling them;\nFrom: gorehawg\nTo: johnshawcards\nSubject: Other: gorehawg sent a message about BASEBALL CABINET? JOHN EDGAR CLAPPE PHILADELPHIA ATHLETIC EARLY PLAYER #111081714128\nSent Date: May-26-13 05:46:01 PDT\n\nDear johnshawcards,\n\nHello, \nSandra sold me one of the cards from the collection a few months back. I was wondering what you thought in regards to their authenticity? I have a buyer on hold who has offered me a nice amount of money. I have taken high res scans and provided them to him. He is one of the top experts on 19th century baseball and I would hate to sell him a counterfeit. Please let me know what ya think.\nSincerely,\n-John\n\n- gorehawg",
      "post_time": "20130527T07:14:12-06:00",
      "timestamp": "1369660452"
    },
    {
      "post_id": "1137353",
      "post_title": "Response",
      "post_author_name": "nameless",
      "post_content": "Here is his response;\nDear gorehawg,\n\nThank you for your question, difficult to answer!!! I will try my best, it is not a photo that is taken and then fixed to the board, the image appears to be formed on the board, as such you could not peel or remove from board, i have had a friend who deals in images for a living, i.e archives them and then sells them, he is not sure how it is done, he eliminates a computer due to the pixel arrangment, we both think they are old, he tested with uv also.\nI also know the originals are all in a New York Musuem, they were loaned out to various studios, photographed and them returned, hence they all have the same hand writing on, possibly an early copy of those?? I have found similar on Wikipeadia and seen a couple on EBAY similar to mine fetching between $50-£2000. \n\nI have held on to them for awhile, fearful of misleading anyone, best to treat them as copies, possibly early though, but not as the 1874 Studio issues, how much after that they were done i cannot tell i do not think that to far off the mark, they are certainly interesting, but in my opinion would not be graded, given the little I know regarding grading.\n\nI trust you appreciate i have answered as honestly as I can, happy to try and answer if you feel you need more info.\n\nThe above is the same answer i gave when asked a similar question on one of the others i listed, my best advise is to err on the side of caution, treat them as not originals, i sincerely do not want to mislead anybody, nor disappoint anybody, it is not worth my business reputation for a short term gain.\n\nWhat i can say is I do think they are old, they are certainly very interesting.\nNot sure who Sandra is though, can you clarify for me?\nThank you\n\nBest regards\n\nJohn",
      "post_time": "20130527T07:16:01-06:00",
      "timestamp": "1369660561"
    },
    {
      "post_id": "1137360",
      "post_title": "Person",
      "post_author_name": "nameless",
      "post_content": "From the person who had them originally. This is from an email thread back in Sept 2012.;\n\nhi john,they are all authentic you could not copy the board they are on l have just found one more a team group so 16 in total but 2 of them are on ebay so you would have to bid on them as l can not end the listing because they have less than 12 hours to go.\n\nThis is when I first inquired about this cabinet photo. I guess two were sold on ebay. I am going to follow up with this because my buddy out in AU knows this person well. I was introduced to this person through a boxing deal and I have never had issues with my guy in AU. We will see what I can turn up.",
      "post_time": "20130527T07:24:25-06:00",
      "timestamp": "1369661065"
    },
    {
      "post_id": "1137467",
      "post_title": "",
      "post_author_name": "Matthew H",
      "post_content": "That eBay seller gave me the same word for word response when I asked him if the card had a real photo mounted.  A simple yes or no would have worked fine :)\n\nI'm guessing he knows they're fake.  There's a myriad of sellers that use similar wording \"not selling as original but looks old\".  Either way he researched the stuff and has carefully worded his auctions and responses accordingly.",
      "post_time": "20130527T11:25:37-06:00",
      "timestamp": "1369675537"
    },
    {
      "post_id": "1140628",
      "post_title": "",
      "post_author_name": "autograf",
      "post_content": "Have bought a lot of stuff from the seller in the past--nonsports tobacco cabinets that ARE real and I think he should know the difference.  Just my opinion.  All the cabinets he has SHOULD have albumen photos attached to mounts.  Not sure I buy the 'pixel arrangement' argument.  I'd love to see a 600DPI picture of one of them.  If I were a betting man, I'd say they are printed on a laser or some type of recent printer and adhered to some form of cardboard.  The person who did it should be drawn and quartered.........or eighthed.......",
      "post_time": "20130603T09:09:36-06:00",
      "timestamp": "1370272176"
    },
    {
      "post_id": "1140884",
      "post_title": "",
      "post_author_name": "nameless",
      "post_content": "A bunch of these sold last night and are still up. One sold for over $160.",
      "post_time": "20130603T17:17:54-06:00",
      "timestamp": "1370301474"
    }
  ]
}