{
  "id": "143220",
  "forum_id": "4",
  "title": "SOLD=FS/FT 1874 Harper's Weekly Woodcut",
  "author": "familytoad",
  "reply_count": 1,
  "view_count": 433,
  "created_date": null,
  "last_reply": "20111105T21:14:35-06:00",
  "posts": [
    {
      "post_id": "935917",
      "post_title": "SOLD=FS/FT 1874 Harper's Weekly Woodcut",
      "post_author_name": "familytoad",
      "post_content": "Thanks Dan!\n\nAs many of you know, there is a pictorial checklist of many Harper's woodcuts in issue #14 of the Vintage & Classic Baseball Collector (VCBC) from Jan/Feb 1998. \n\nI am offering one of mine up for sale or trade.\n\nIt's approximately the 15th oldest woodcut that Harper's used in their weekly magazine.\nThis one pictures the Guelph, Ontario Maple Leaf team and is dated September 12, 1874.\n\nIn nice condition, you can see a tape stain on the left border and a small tear affecting Left Fielder W.Smiley's nose :)\n\nObviously handcut from the magazine as they all tend to be, this measures 8X10 3/4 inches.\n\nIt also has a neat advertisement section on the back of the page featuring Peck & Snyder's. \"The only house that manufactures and deals exclusively in Base-Ball, Cricket, and Sorting Goods, and authorized Designer, Manufacturers, and Leaders of Base-Ball Fashions\"\n\nPretty Cool, historical item.\nI can do larger, more detailed scans if needed.\n(and I can scan the back too, if anyone is interested...even if not interested in buying/trading for the piece...cuz its history!)\n\nAnyway, I am asking $100 delivered. See the thread below for a unique discount opportunity!!\n\nPaypal is preferred with no extra fees...I will pay them.  The item is fragile so I will ship extra carefully. (Since this is a Canadian item, and shipping to Canada is sometimes a bit of a difficulty on odd packages (and expensive), if you are a friend from the North and you would like the item, let's talk about the  best way to get it to you)\n\nI'd also be interested in trading if you have any caramel cards to deal.\nLet's talk it over:p",
      "post_time": "20111030T22:54:13-06:00",
      "timestamp": "1320036853"
    },
    {
      "post_id": "937512",
      "post_title": "Discount opportunity",
      "post_author_name": "familytoad",
      "post_content": "The 1874 woodcut above is now available for a discounted price.\nAll you need to do is to indicate your favorite baseball team to me in either IM or email while also saying \"I'll take it\"...and I will take 15% off the price!!!\n\n(85 dollars includes free shipping in the USA and paypal regular accepted!)",
      "post_time": "20111105T21:14:35-06:00",
      "timestamp": "1320549275"
    }
  ]
}