{
  "id": "120797",
  "forum_id": "4",
  "title": "Pre-War Milwaukee player cards (and memorabilia) wanted",
  "author": "wolf2039",
  "reply_count": 6,
  "view_count": 611,
  "created_date": null,
  "last_reply": "20100222T20:33:45-06:00",
  "posts": [
    {
      "post_id": "782755",
      "post_title": "Pre-War Milwaukee player cards (and memorabilia) wanted",
      "post_author_name": "wolf2039",
      "post_content": "Hello -\n\nI am new to Net54, but a long-time card and memorabilia collector.  I was born and bred in Wisconsin and am keenly interested in any pre-war (especially 19th century material) cards or memorabilia of Milwaukee players or teams.  I have the Milwaukee T206s, a few Old Judges, the Buchner Gold Coin Morissy (need the Forster and Hart) and the Colgan's Chips Ludwig and Schardt, as well as a few pieces of memorabilia.  Would be happy to trade (I have a large multi-sport collection focused on the 1950s-1980s) or pay cash.  Also curious what issues are out there that I am unaware of.  \n\nThanks!\n\nBrian",
      "post_time": "20100214T22:04:37-06:00",
      "timestamp": "1266210277"
    },
    {
      "post_id": "782761",
      "post_title": "",
      "post_author_name": "Kawika",
      "post_content": "Welcome to Net54, Brian. Although I was present at Yankee Stadium for Game 2 of the 1957 World Series and thus have first-hand knowledge of prehistoric Milwaukee baseball, I can't be of much help to you as far as specific pre-war items go. However I would like to draw your attention to this link to a similar Net54 thread from last year. The borchertfield.com reference  is definitely worth checking out-it's a pretty amazing blog about the old Brewers-and John Effenheim's photo site has lots of cards.\nhttp://tinyurl.com/ycc46oa\n[IMG]http://photos.imageevent.com/kawika_o_ka_pakipika/bbbofsfirstclass/holygrailcards/websize/1957%20WS%20prgrm.jpg[/IMG]",
      "post_time": "20100214T23:28:26-06:00",
      "timestamp": "1266215306"
    },
    {
      "post_id": "782890",
      "post_title": "",
      "post_author_name": "Jay Wolt",
      "post_content": "[QUOTE]the Buchner Gold Coin Morissy (need the Forster and Hart)[/QUOTE]\n\nI believe there are 4 Milwaukee players in the Buchner Gold set the missing one from your list, Joe Strauss",
      "post_time": "20100215T13:36:01-06:00",
      "timestamp": "1266266161"
    },
    {
      "post_id": "782932",
      "post_title": "Thanks for the tip!",
      "post_author_name": "wolf2039",
      "post_content": "Thanks for the tip!\n\nOther than the Gold Coins, Old Judges, Colgan's Chips, Grand Studios, T206s and the 1933 Goudey card of O'Rourke, do you know of any other Milwaukee players featured on pre-war cards?\n\nI appreciate the help.  \n\nBrian",
      "post_time": "20100215T15:56:43-06:00",
      "timestamp": "1266274603"
    },
    {
      "post_id": "782941",
      "post_title": "",
      "post_author_name": "Jay Wolt",
      "post_content": "Brian, the only set you've listed that I collect and have info on, is the N284 Buchner's\n\nHere's what the Jim Hart looks like (not for sale, sorry!)\n\n[IMG]http://www.qualitycards.com/pictures/1233772151.jpg[/IMG]",
      "post_time": "20100215T16:57:13-06:00",
      "timestamp": "1266278233"
    },
    {
      "post_id": "784395",
      "post_title": "Old Milwaukee Brewers Schedule SOLD",
      "post_author_name": "buymycards",
      "post_content": "Hi Brian,\nI have an old Brewers schedule.  This is a framed Milwaukee Sentinel poster.  I believe that it dates from the late 19-teens to the early 1920's, although I have been to lazy to verify the dates.  I have had this poster for a few years, but I have never taken the poster out of the frame to give it a close inspection.  The poster itself is about 11\" wide by 13 1/2\" wide.\n\nI would sell it for $50 shipped, and if you like I can send it to you to check it out yourself before you pay me so that you can see it up close and verify it's authenticity.  \n\nI live in Wisconsin and I frequently go to the card shows in Madison, and occasionally to the Milwaukee Gonzaga show, so if you are interested I could meet you at one of the shows so you can look it over before you purchase it.  \n\nThanks,\nRick",
      "post_time": "20100221T07:59:09-06:00",
      "timestamp": "1266764349"
    },
    {
      "post_id": "784828",
      "post_title": "",
      "post_author_name": "wolf2039",
      "post_content": "Thanks for the note and for the offer.  I am probably going to pass on the schedule poster at this time.  I am more focused on cards and photos right now.  I do get to Milwaukee often and could get to Gonzaga Hall; if I change my mind, I will let you know.\n\nBrian",
      "post_time": "20100222T20:33:45-06:00",
      "timestamp": "1266896025"
    }
  ]
}