{
  "id": "290180",
  "forum_id": "4",
  "title": "SOLD Boston Beaneaters & Boston Americans HOFer Jimmy Collins",
  "author": "Shoeless Moe",
  "reply_count": 2,
  "view_count": 428,
  "created_date": null,
  "last_reply": "20201010T11:31:44-06:00",
  "posts": [
    {
      "post_id": "2024389",
      "post_title": "SOLD Boston Beaneaters & Boston Americans HOFer Jimmy Collins",
      "post_author_name": "Shoeless Moe",
      "post_content": "From VintageBall.com Site:\n\nMost puzzling in the Red Belt set is this card, entitled \"Safe,\" which clearly captures an in-action pose of a Boston Red Sox player, leaping for a throw at second base. The word \"Boston\" appears across his chest and Boston's Huntington Avenue Grounds is evident in the background.\n\nEven more intersting than the Boston locale is the player, himself, who has been definitively identified as Hall of Fame Red Sox third baseman, Jimmy Collins, who played for the team from 1901 to 1907 (and with the Boston Beaneaters before that). And, strangely, the image shows Collins in dress footwear, not baseball spikes. Even more strange is the fact that Collins played third base, not second in his illustrious career, yet this shot is clearly posed at second base.\n\nThe original black and white photograph from which this card was made (below), was taken by renowned local photographer, Edmunds E. Bond, whose photo collection currently resides in the Boston Public Libarry. Curiously, this photo is from 1901 or 1905 depending on if you believe the identification in book \"The Red Sox Century\" or from the Boston Public Library. Why Morgan Stationery chose to use this image years later in an Ohio-themed postcard series is an unresolved mystery.\n\n\nOne sold recently at Love of the Game Auctions for $461\n[url]http://loveofthegameauctions.com/lot-17910.aspx[/url]\n\nGet a deal here!\n\n\n$200 or Best Offer Shipped photo not included just taken from internet, only postcard is for sale",
      "post_time": "20201009T19:17:21-06:00",
      "timestamp": "1602292641"
    },
    {
      "post_id": "2024495",
      "post_title": "",
      "post_author_name": "Shoeless Moe",
      "post_content": "and SOLD!",
      "post_time": "20201010T07:59:23-06:00",
      "timestamp": "1602338363"
    },
    {
      "post_id": "2024544",
      "post_title": "",
      "post_author_name": "Shoeless Moe",
      "post_content": "[quote name=\"Shoeless Moe\" post=2024495]and SOLD![/QUOTE]\n\nand have to say, one of the BEST looking postcards....like Mrs H......it's GORGEOUS!!!!",
      "post_time": "20201010T11:31:44-06:00",
      "timestamp": "1602351104"
    }
  ]
}