{
  "id": "187245",
  "forum_id": "4",
  "title": "No longer available",
  "author": "aelefson",
  "reply_count": 1,
  "view_count": 390,
  "created_date": null,
  "last_reply": "20140505T18:48:41-06:00",
  "posts": [
    {
      "post_id": "1271404",
      "post_title": "No longer available",
      "post_author_name": "aelefson",
      "post_content": "Hi-\n       For sale are two full teams of 1888 McLoughlin Baseball cutouts for sale.  One team is Chicago, and it has all 10 players plus the umpire.  The second is New York, and it has all 10 players, the umpire, and a little cutout piece with New York on it.\n        These were cut from strips for kids to play with.  Below is a link to the Getty Image showing a full strip, and a link to a Net54 post about these recently.\n         I only have a few of the backs scanned, but I will scan the rest and post them in this thread later tonight.  I can also provide better scans if needed.  These all came from a scrapbook, and the glue had all but dissolved (probably water/flour) by the time I got the pages.  All came out effortlessly (no tears or significant paper loss).\n         I am looking for 650.00 for either team, or 1150 combined for both teams.  If you are a regular forum contributor, I will gladly mail these to you before you send payment to ensure the condition is exactly as you expect.  If you are not a regular contributor, let me know and I am sure we can work something out.\n          Please email me if interested at [url]aelefson@hotmail.com[/url]\n\nThanks for looking,\nAlan Elefson\n[url]http://www.gettyimages.com/detail/nyhetsfoto/in-the-late-1880s-the-mcloughlin-company-of-new-york-nyhetsfoto/96357492[/url]\n[url]http://www.net54baseball.com/showthread.php?t=175103[/url]",
      "post_time": "20140501T18:02:23-06:00",
      "timestamp": "1398988943"
    },
    {
      "post_id": "1272965",
      "post_title": "Price Reduction",
      "post_author_name": "aelefson",
      "post_content": "No longer available",
      "post_time": "20140505T18:48:41-06:00",
      "timestamp": "1399337321"
    }
  ]
}