{
  "id": "127054",
  "forum_id": "4",
  "title": "SOLD: 1879-80 New York Clipper Woodcuts - Tim Keefe HOF Rookie (BGS)",
  "author": "bcbgcbrcb",
  "reply_count": 2,
  "view_count": 533,
  "created_date": null,
  "last_reply": "20100831T05:41:56-06:00",
  "posts": [
    {
      "post_id": "832264",
      "post_title": "SOLD: 1879-80 New York Clipper Woodcuts - Tim Keefe HOF Rookie (BGS)",
      "post_author_name": "bcbgcbrcb",
      "post_content": "Good Evening, Collectors:\n\nUp for sale tonight is an extremely rare 1879-80 New York Clipper Woodcut picturing HOF'er, Tim Keefe, and represents his earliest professional baseball image on any type of collectible. This impossible to find set of woodcuts is listed in Bob Lemke's 2010 Standard Catalogue of Baseball Cards with no prices as these are so rare that documented sales are impossible to find. This beauty has been authenticated and encapsulated by Beckett Grading Services, the industry leader in third-party grading. Miticulously trimmed from an original New York Clipper newspaper, this Keefe woodcut has been mounted onto scrapbook paper with the back side showing professiuonal baseball boxscores from the same time period, ie- Cincinnati, Cleveland, Baltimore, etc. Please review scan of the item for condition details. Sale price on this beauty is $SOLD dlvd. and the first person to e-mail me and state \"I'll take it\" is the new owner. My e-mail address is: [url]vguerrerobb@yahoo.com[/url]",
      "post_time": "20100826T18:04:10-06:00",
      "timestamp": "1282867450"
    },
    {
      "post_id": "832467",
      "post_title": "PRICE REDUCED: 1879-80 New York Clipper Woodcuts - Tim Keefe HOF Rookie (BGS Auth)",
      "post_author_name": "bcbgcbrcb",
      "post_content": "BUMP due to price reduction.",
      "post_time": "20100827T15:37:21-06:00",
      "timestamp": "1282945041"
    },
    {
      "post_id": "833131",
      "post_title": "FINAL PRICE REDUCTION: 1879-80 New York Clipper Woodcuts - Tim Keefe HOF Rookie (BGS)",
      "post_author_name": "bcbgcbrcb",
      "post_content": "BUMP due to final price reduction.",
      "post_time": "20100831T05:41:56-06:00",
      "timestamp": "1283254916"
    }
  ]
}