{
  "id": "237256",
  "forum_id": "4",
  "title": "SOLD: N172 Old Judge Harry Wright HOF Manager Red Stockings",
  "author": "teza11",
  "reply_count": 4,
  "view_count": 859,
  "created_date": null,
  "last_reply": "20170407T08:03:49-06:00",
  "posts": [
    {
      "post_id": "1643787",
      "post_title": "SOLD: N172 Old Judge Harry Wright HOF Manager Red Stockings",
      "post_author_name": "teza11",
      "post_content": "** SOLD **\n\nHi. Exceedingly rare 1889 N172 Old Judge Harry Wright HOF card. Portrait looking right variation.\n\nHarry Wright is often referred to as the \"Father of Professional Baseball.\" He was instrumental in helping transform the game from a weekend activity for amateurs, to an organized league of professional clubs. He is credited with many innovations, including the use of hand signals, as well as devising an intricate scoring system to keep track of games and statistics. In late 1868, Wright was chosen by the owners of the Cincinnati Red Stockings club to head baseball's first salaried, all-professional team. He assembled an unbeatable team which went undefeated in 57 club matches in 1869. Wright would continue to manage some of the best teams in the game for the next 25 years. \n\nThe card is condition challenged with fading, chipping, and creasing evident. Hi-res scans provided for your consideration.\n\nAccepting reasonable offers. Payment to be made by PayPal friends and family or personal check only.\n\nFeel free to email or pm me direct with any questions. Email address is [url]teza11@cox.net[/url].\n\nJeff",
      "post_time": "20170322T20:43:37-06:00",
      "timestamp": "1490237017"
    },
    {
      "post_id": "1643814",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Jeff-FYI, this is an 1889 card. If an Old Judge says \"Cigarette Factory\" at the bottom it is 1889 or 1890; this one is 1889.",
      "post_time": "20170322T23:52:26-06:00",
      "timestamp": "1490248346"
    },
    {
      "post_id": "1647687",
      "post_title": "Offer Follow-thru?",
      "post_author_name": "teza11",
      "post_content": "Hi. This has been an interesting process to say the least.  I thought I'd share what has happened since my posting to see if other \"listers\" have experienced similar results (or the lack thereof) on this site.\n\nWithin days of my listing I received somewhere between 5-10 offers on the card.  They ranged from $200 on the low end to close to $900 on the high end.  After a couple days I sent notice to the high bidder accepting his offer and asking how he intended to complete payment.  His response was something to the effect of “My offer has expired”.  I told him that I wasn’t aware that he had given me an expiration date.  He came back to say that \"he did not want me to use his offer against him”.  I’m not sure how that would work since I never asked him to raise or change his original offer.  Unfortunately I turned down a couple other solid offers based on this guy’s offer.\n\nSo I circle back to the next remaining best offer.  Guy 2 goes through the motions of what are my payment options (even though I clearly stated that in my listing), asks for new conditions i.e. “Will you give my money back if it does not grade at least Auth?”…I agreed, and then even more “I’m busy with work” delays in sending payment.  The next pm I get says, “I’m still deciding if I want to buy the card”.  Shouldn’t that decision have be made before making me an offer?  Maybe it’s just me.\n\nAnyway, it’s been interesting and has left me wondering how many flaky buyers are lurking on this site.  Have you experienced something similar?\n\nAs for the card, I’ve decided to move it over to eBay.\n\nJeff",
      "post_time": "20170404T20:07:38-06:00",
      "timestamp": "1491358058"
    },
    {
      "post_id": "1648391",
      "post_title": "",
      "post_author_name": "Leon",
      "post_content": "You took your time answering and I don't blame the first guy.\n I would probably do the same thing. As for the second guy, if he backed out you should PM me his user id and he might get an infraction or at minimum some questioning as to what his issues are....There shouldn't be too much flakiness in the BST area....LL\n\n\n[quote name=\"teza11\" post=1647687]Hi. This has been an interesting process to say the least.  I thought I'd share what has happened since my posting to see if other \"listers\" have experienced similar results (or the lack thereof) on this site.\n\nWithin days of my listing I received somewhere between 5-10 offers on the card.  They ranged from $200 on the low end to close to $900 on the high end.  After a couple days I sent notice to the high bidder accepting his offer and asking how he intended to complete payment.  His response was something to the effect of “My offer has expired”.  I told him that I wasn’t aware that he had given me an expiration date.  He came back to say that \"he did not want me to use his offer against him”.  I’m not sure how that would work since I never asked him to raise or change his original offer.  Unfortunately I turned down a couple other solid offers based on this guy’s offer.\n\nSo I circle back to the next remaining best offer.  Guy 2 goes through the motions of what are my payment options (even though I clearly stated that in my listing), asks for new conditions i.e. “Will you give my money back if it does not grade at least Auth?”…I agreed, and then even more “I’m busy with work” delays in sending payment.  The next pm I get says, “I’m still deciding if I want to buy the card”.  Shouldn’t that decision have be made before making me an offer?  Maybe it’s just me.\n\nAnyway, it’s been interesting and has left me wondering how many flaky buyers are lurking on this site.  Have you experienced something similar?\n\nAs for the card, I’ve decided to move it over to eBay.\n\nJeff[/QUOTE]",
      "post_time": "20170406T21:24:51-06:00",
      "timestamp": "1491535491"
    },
    {
      "post_id": "1648460",
      "post_title": "A Flaky Buyer",
      "post_author_name": "bigfish",
      "post_content": "I was the flaky buyer who made an offer of 875.00 on this card.  I thought my offer was really strong consider it's ghost image.  I assumed my offer would be accepted right away or atleast the same day.  A few days pass and the seller contacts me saying it's yours.  I did say my offered had expired and it did.  I generally don't do this but you missed the boat on value of this card.  I am sorry for any angst I have created for you.  I do wish the best with this card.\n\nEdit:  I was the first buyer...",
      "post_time": "20170407T08:03:49-06:00",
      "timestamp": "1491573829"
    }
  ]
}