{
  "id": "68057",
  "forum_id": "4",
  "title": "For Trade: 1860s Baseball Stereoview",
  "author": "Archive",
  "reply_count": 7,
  "view_count": 483,
  "created_date": null,
  "last_reply": "20060810T11:50:00-06:00",
  "posts": [
    {
      "post_id": "372120",
      "post_title": "For Trade: 1860s Baseball Stereoview",
      "post_author_name": "Archive",
      "post_content": "Posted By: Joe D.\nsince my collecting 'want list' has switched over (almost exclusively) to \"Fatima\"-land....\n\nI am moving my 1860s baseball stereoview over to 'tradeable' for T200 Fatima team cards or T222 fatima player cards.\n\nThe stereoview shows what looks like a pick-up baseball game in front of a building and a nice size crowd.  Pitcher ready to deliver as the batter and catcher wait for the ball.\n\nAll trade offers considered... even those where I would have to add cash.\n\nStereoview is not available for sale - trade only.\n\n\nThanks,\nJoe\n\n\n[IMG]http://www.internetville.com/stuff/1860bball.jpg[/IMG]",
      "post_time": "20060807T11:46:00-06:00",
      "timestamp": "1154972760"
    },
    {
      "post_id": "372121",
      "post_title": "For Trade: 1860s Baseball Stereoview",
      "post_author_name": "Archive",
      "post_content": "Posted By: Joe D.\nthis is a general board type inquiry, but since the item is up for trade on the b/s/t --- I thought the general board was no longer an appropriate place to discuss the item - so here goes.....\n\n(I would love any comments.  I don't care if you trash the item or praise it... I am in no hurry to get rid of it, and I consider this fair game for any comment.)\n\n\n1) Value?  I have been asked to give this item a value (more than one inquiry).   Quite honestly, I was just looking for an intriguing trade... but I think value info might be helpful to myself and to others who are looking into baseball stereoviews.  I am a rookie on baseball stereoviews.  It seems from other threads in the 19c b/s/t that values can be all over the place.  Any opinions on value would be appreciated.  All comments are fair game.\n\n2)  Photography in general took hold in the 1840s-ish (I believe)... and this particular stereoview most likely dates to 1860s (possibly early 1870s).  I have not seen an earlier photograph of the game of baseball being played.  I am not going to proclaim this the earliest (I am not that brash nor am I that learned)... \nbut are there other known -earlier- photographs of the game of baseball being played?  Is this 'one' of the earliest examples?  Again, I realize I am opening myself up to negative comments about the item.  I don't mind and appreciate anything that is posted.\n\nRegards,\nJoe\n\n\nP.S. --- if this type of post goes against rules - please delete and accept my apologies.",
      "post_time": "20060810T10:14:00-06:00",
      "timestamp": "1155226440"
    },
    {
      "post_id": "372122",
      "post_title": "For Trade: 1860s Baseball Stereoview",
      "post_author_name": "Archive",
      "post_content": "Posted By: George H. Counter\nI think the $200 you paid for it was a good price.\nMaybe add $50-75 for a fair resale price.\n\nYes, there are a lot of earlier \"in action\" photographs in various formats including stereo views.",
      "post_time": "20060810T11:28:00-06:00",
      "timestamp": "1155230880"
    },
    {
      "post_id": "372123",
      "post_title": "For Trade: 1860s Baseball Stereoview",
      "post_author_name": "Archive",
      "post_content": "Posted By: Jim Manos\nThe one with the photo of the stadium earlier post. Hope this helps.",
      "post_time": "20060810T11:36:00-06:00",
      "timestamp": "1155231360"
    },
    {
      "post_id": "372124",
      "post_title": "For Trade: 1860s Baseball Stereoview",
      "post_author_name": "Archive",
      "post_content": "Posted By: Joe D.\nGeorge,\n\nVery cool to know.  Thank you for that pricing info.  I bought it without knowing if I overpaid or was getting a steal.  Looks like it was just about right with a little room to the upside.\n\nI completely believe you when you say there are plenty of earlier baseball action shots (like I said I am new to early photography stuff)... but at the same time I would love to see some.\n\nAgain - thanks for the post!\n\nRegards,\nJoe",
      "post_time": "20060810T11:36:00-06:00",
      "timestamp": "1155231360"
    },
    {
      "post_id": "372125",
      "post_title": "For Trade: 1860s Baseball Stereoview",
      "post_author_name": "Archive",
      "post_content": "Posted By: Joe D.\nJim,\n\nYes... thanks for that info.\n\nEdit to say:  Yours was from the late 1880s, mine from the 1860s.  But then again, depending on the buyer: yours with a stadium (not a pickup game) may have had more appeal (completely subjective I guess).\n\nRegards,\nJoe",
      "post_time": "20060810T11:37:00-06:00",
      "timestamp": "1155231420"
    },
    {
      "post_id": "372126",
      "post_title": "For Trade: 1860s Baseball Stereoview",
      "post_author_name": "Archive",
      "post_content": "Posted By: George H. Counter\nJoe- I don't think yours is 1860s material. \nHard to put a date by looking at the image itself, but stereo view card mount isn't that early.\nThere are others here that can elaborate a lot more on this I'm sure.\n\nI have in action scans on my computer drive but the originals belong to some board members, and others I found on the web.\n\nWhy not post your question on the general forum?",
      "post_time": "20060810T11:47:00-06:00",
      "timestamp": "1155232020"
    },
    {
      "post_id": "372127",
      "post_title": "For Trade: 1860s Baseball Stereoview",
      "post_author_name": "Archive",
      "post_content": "Posted By: Joe D.\nGeorge,\n\nI would have posted the questions in the general forum... but I feared it would have looked as though I was trying to advertise and pump a b/s/t post on the general forum.\n\nI hear leon has a dungeon for such offendors.\n\n[IMG]https://www.net54baseball.com/images/happy.gif[/IMG]\n\n\nEdit to add: \nI did have a general board post on the topic when I first picked up the card.\n[url]http://www.network54.com/Forum/153652/message/1152396933/1860s+Baseball++-+my+first+19th+Century[/url]",
      "post_time": "20060810T11:50:00-06:00",
      "timestamp": "1155232200"
    }
  ]
}