{
  "id": "353291",
  "forum_id": "4",
  "title": "SOLD: 1906 W01 Sporting Life PC -- Ty Cobb's First Card",
  "author": "calvindog",
  "reply_count": 5,
  "view_count": 848,
  "created_date": null,
  "last_reply": "20240917T16:35:22-06:00",
  "posts": [
    {
      "post_id": "2461422",
      "post_title": "SOLD: 1906 W01 Sporting Life PC -- Ty Cobb's First Card",
      "post_author_name": "calvindog",
      "post_content": "Very rare, high grade Detroit Tigers Sporting Life team composite PC featuring Ty Cobb's first inclusion on a card. Earlier than any of the single subject Cobb \"rookie\" cards, this is Cobb's first official baseball card.  This is the third highest graded example in the combined PSA and SGC pop reports and is very rarely offered. Card is in great condition and not postally used. \n\nJust five sold publicly in the past 14+ years; the last one sold was a PSA A with a corner missing over a year ago for $11,100.  A PSA 2.5 sold for $21,600 two years ago.  __; if interested email or PM me, thanks. \n\n[url=https://flic.kr/p/2kMaakg][img]https://live.staticflickr.com/65535/51050500857_d2248fca63_c.jpg[/img][/url]",
      "post_time": "20240916T21:16:46-06:00",
      "timestamp": "1726543006"
    },
    {
      "post_id": "2461424",
      "post_title": "",
      "post_author_name": "3-2-count",
      "post_content": "Spectacular PC Jeff. \n\nTy was just a pup.",
      "post_time": "20240916T21:38:13-06:00",
      "timestamp": "1726544293"
    },
    {
      "post_id": "2461486",
      "post_title": "",
      "post_author_name": "Rhotchkiss",
      "post_content": "I bought/own the PSA 2.5.\n\nI think this is BY FAR one of the most under-valued cards in the hobby.  I look at this similarly to the 1915 Red Sox PC, with Ruth, albeit a little rarer.  Ruth beats Cobb, so lets say that the W601 is only 25% of the 1915 PC.  Well, a PSA A 1915 PC just sold for $114k, meaning the W601 A should be worth, at the absolute least, $25k+; as Jeff points out, it sold for $11,1k.  Tremendous upside with this card.",
      "post_time": "20240917T09:14:16-06:00",
      "timestamp": "1726586056"
    },
    {
      "post_id": "2461500",
      "post_title": "",
      "post_author_name": "calvindog",
      "post_content": "I feel the same way.  It's clearly the first time Cobb has ever been on a card, unlike the mess of 1907 \"rookie\" Cobb cards/PCs.  This is the one, first true card with Cobb on it with no other competitors.  And it came out right after he had a few games under his belt in 1905.  Really an amazing card for a Cobb collector.",
      "post_time": "20240917T09:40:19-06:00",
      "timestamp": "1726587619"
    },
    {
      "post_id": "2461525",
      "post_title": "",
      "post_author_name": "BeanTown",
      "post_content": "Have to agree with every post on this thread.  It’s his first appearance on a card from a known series.  I’m not a registry member, but I would be curious as to what the pop report on every team from the series.   Detroit seems to be the short print or the rarest of all the teams. You just don’t see this card come up for auction or sale much.  Another card I would compare it to is the 1925 Gehrig rookie exhibit.   Ten years ago you could buy one under 5k.   Now it’s 100k plus.",
      "post_time": "20240917T10:57:38-06:00",
      "timestamp": "1726592258"
    },
    {
      "post_id": "2461624",
      "post_title": "",
      "post_author_name": "bcbgcbrcb",
      "post_content": "Guess I should have held on to mine instead of selling it for $5K around 2010. :(",
      "post_time": "20240917T16:35:22-06:00",
      "timestamp": "1726612522"
    }
  ]
}