{
  "id": "68062",
  "forum_id": "4",
  "title": "Vintage Card Prices \"New Features\"",
  "author": "Archive",
  "reply_count": 1,
  "view_count": 423,
  "created_date": null,
  "last_reply": "20060819T19:00:00-06:00",
  "posts": [
    {
      "post_id": "372142",
      "post_title": "Vintage Card Prices \"New Features\"",
      "post_author_name": "Archive",
      "post_content": "Posted By: Bobby\nDon't want to get in trouble with the board and post this in the main thread and after the last post there I figured they rather have it posted here instead.\n\nWe now have \"Want List\" live, you add cards that you are looking for by grader and grade. And anytime that card becomes available in auction in your grade our higher you get notified via email with links to the auction. Great feature because now you don't have to search through eBay we do it for you.\n\nSoon to come:\n\nYou will be able to add entire sets to the \"Want List\" specified by grade and grader. If it is a hard to find card simple choose all 3 grades and put Authentic and every time a card from that set becomes available you get emailed.\n\n\"My collection\" will soon be available for the limited (Non paying) members. This way they can take adavantage of our check lists and enter their collection into the system. The values will not show but anytime they choose to upgrade to VIP then the values will come up for them.\n\nThere are a lot more things to come in the near future and will update you when they are in process of becoming a reality.\n\nRegards,\n\nBobby\nwww.vintagecardprices.com",
      "post_time": "20060806T11:10:00-06:00",
      "timestamp": "1154884200"
    },
    {
      "post_id": "372143",
      "post_title": "Vintage Card Prices \"New Features\"",
      "post_author_name": "Archive",
      "post_content": "Posted By: Bobby\nThe Want List feature is now free to all member levels..so you can join for FREE and create your on \"Want List\" and when a card form it becomes available in auction you get an email notice with links.\n\nAlso now available is the \"My Collection\" for all no paying member, You can use our extensive check lists to input you entire collection by grade and grader with you costs as well.\n\nMore to come in the next week.\n\nBobby",
      "post_time": "20060819T19:00:00-06:00",
      "timestamp": "1156035600"
    }
  ]
}