{
  "id": "113961",
  "forum_id": "4",
  "title": "For Sale: 1899-00 M101-1 Sporting News Supplement - Nap Lajoie HOF Rookie (BGS)",
  "author": "bcbgcbrcb",
  "reply_count": 2,
  "view_count": 1032,
  "created_date": null,
  "last_reply": "20090814T11:58:47-06:00",
  "posts": [
    {
      "post_id": "734867",
      "post_title": "For Sale: 1899-00 M101-1 Sporting News Supplement - Nap Lajoie HOF Rookie (BGS)",
      "post_author_name": "bcbgcbrcb",
      "post_content": "Good Afternoon, Collectors:\n\nUp for sale today is an extremely rare 1899-00 M101-1 Sporting News Supplement picturing HOF great, Nap Lajoie on his earliest catalogued collectible, thus making this his true Rookie. This beauty has been graded and encapsulated by Beckett Grading Services with a designation of \"Fair\" - 1.5 (minor creasing in a couple of spots on the top edge). Please look at the condition of the piece shown in my enlarged scans for yourself and you will agree that a better example is highly unlikely to ever be found despite the technical grade of \"Fair\" given by Beckett. I don't have a scan of the back of the supplement handy (I don't recall that there are any condition issues at all) but will certainly provide one for a serious buyer who is interested in purchasing this item. \n\nMy asking price on this beauty is $6,500 dlvd. and I will consider trades/partial trades and cash that will enable me to upgrade my collection. As many of you know, I collect the earliest collectible (individual or team photo) that I can afford for each BB Hall of Famer so that is what I would be looking for in trade. Anyone with interest, please e-mail me privately at: [url]vguerrerobb@yahoo.com[/url]",
      "post_time": "20090709T10:24:33-06:00",
      "timestamp": "1247156673"
    },
    {
      "post_id": "739490",
      "post_title": "PRICE REDUCED: 1899-00 M101-1 Sporting News Supplement - Nap Lajoie HOF Rookie (BGS)",
      "post_author_name": "bcbgcbrcb",
      "post_content": "BUMP due to price reduction.",
      "post_time": "20090802T12:38:12-06:00",
      "timestamp": "1249238292"
    },
    {
      "post_id": "742385",
      "post_title": "PRICE REDUCED: 1899-00 M101-1 Sporting News Supplement - Nap Lajoie HOF Rookie (BGS)",
      "post_author_name": "bcbgcbrcb",
      "post_content": "BUMP due to final price reduction",
      "post_time": "20090814T11:58:47-06:00",
      "timestamp": "1250272727"
    }
  ]
}