{
  "id": "251097",
  "forum_id": "4",
  "title": "SOLD Scarce 1906 New York Highlanders at Hilltop Park Postcard",
  "author": "Shoeless Moe",
  "reply_count": 2,
  "view_count": 467,
  "created_date": null,
  "last_reply": "20180209T17:54:23-06:00",
  "posts": [
    {
      "post_id": "1746614",
      "post_title": "SOLD Scarce 1906 New York Highlanders at Hilltop Park Postcard",
      "post_author_name": "Shoeless Moe",
      "post_content": "RARE 1906 New York Highlanders postcard with 1907 American League Schedule and advertisement of Chas. Wiener New York Tailor. Never mailed.\n\nThis postcard sports a photo of the Highlanders at their New York American League Grounds also known as Hilltop Park.\n\nNice graphics on the Base Ball Mail Card portion, if you look closely some of the letters comprised of Bats and Balls.\n\nMembers of the Highlanders 1906 team included Hall of Famers Manager Clark Griffith, Hal Chesbro and Wee Willie Keeler. Also on that team was Hal Chase, in just his second year with the team. I can not make out the players in the pix perhaps someone else can, but there is some fancy bunting and a packed crowd so wonder if the image was from Opening Day or a Special Game. \n\nIt measures 3-1/2\" x 10-1/2\" opened and has separated (although not completely) at the fold as its still hanging together at one point.\n\nThere is another version of this, or the same version, with foldouts of the players that goes from $700-$1000. So not sure if this is a smaller version or its missing those foldouts, but regardless I'm setting a very fair price for a very neat item. Someone will be happy when this one arrives.\n\nAny Yankee/Highlanders fans out there?\n\nAmazing team shot showing dugout, fans in stands, and stadium captured on a postcard circa 1907 WOW! (my crappy old cell phone pix don't do it justice)\n\n$150.00 or best offer shipped",
      "post_time": "20180209T16:04:44-06:00",
      "timestamp": "1518217484"
    },
    {
      "post_id": "1746627",
      "post_title": "",
      "post_author_name": "calvindog",
      "post_content": "I'll take it, thanks.",
      "post_time": "20180209T16:40:20-06:00",
      "timestamp": "1518219620"
    },
    {
      "post_id": "1746656",
      "post_title": "",
      "post_author_name": "Shoeless Moe",
      "post_content": "and Sold!",
      "post_time": "20180209T17:54:23-06:00",
      "timestamp": "1518224063"
    }
  ]
}