{
  "id": "323657",
  "forum_id": "4",
  "title": "FS: Shoeless Joe Jackson Supplement, Iron Horse Lou Gehrig Exhibit, other HOFers...",
  "author": "ABbaby",
  "reply_count": 4,
  "view_count": 1666,
  "created_date": null,
  "last_reply": "20230208T12:49:29-06:00",
  "posts": [
    {
      "post_id": "2253882",
      "post_title": "FS: Shoeless Joe Jackson Supplement, Iron Horse Lou Gehrig Exhibit, other HOFers...",
      "post_author_name": "ABbaby",
      "post_content": "I have a varied lot up for sale, although aesthetically they look similar. I have really enjoyed these but would like to sell them to pare down my collection to what I want to focus on in my display. \n\nI’ve done my best to add some context to the specific card you’re getting. I know most of you probably aren’t fans of graders but for those that rely on them, I’ve tried to add some useful PSA references. \n\nWill happily discuss offers. Group pricing available upon request. \n\nPlease view the photo albums on my profile for more pictures. I look forward to hearing from the community on these! \n\n1911 M101-2 Shoeless Joe Jackson PSA 1 - \nSharp early image from March 23, 1911 of this great player who is said to have influenced Ruth and Cobb alike. Presents extremely well with no real distraction to the subject of focus. Upper left corner damage is present. Appears it may have been rolled up, likely from when it was part of the broader supplement booklet. Overall, this is in the upper condition tier of the current PSA population of 9. Price: $8,000 OBO (or $8,240 PayPal Goods). Shipping Included. \n\n1939 Salutations Exhibit Lou Gehrig PSA 1 (MK) - \nThe cleanest looking “1” you’re likely to find and is surely visually superior to most others graded up through even a PSA 4. Minimal wear on the corners for its age and minuscule edge wear upon the left flank of the Iron Horse. A slight crease runs from left of bottom middle to just above ‘Sincerely’  but does not let into the likeness of the luckiest man on earth. Obvious marks include those solely present on the reverse of the exhibit. Done in pencil by the hand of a diligent fan closely tracking Gehrig’s achievements in his final season of play. Price: $3,000 (or $3,090 PayPal Goods). Shipping Included. \n\n1909 M101-2 Bancroft Johnson PSA Auth - \nDated October 14, 1909 presents its audience with the President of the American League. With a PSA population of only 1, its hardly worth focusing on the paper loss among the edges of this example since it doesn’t really detract from the portrait of one of the games earliest executives. Date appears to have been printed over by unknown source. Price: $150 (or $155 PayPal Goods) $15 (or lesser of actual cost) Shipping.\n\n1921 Exhibits Eddie Collins PSA 4 - \nA great portrait well into the career of Collins completely free of creasing or surface loss. Very little corner wear for its age. A great example of this inaugural HOFer with a PSA population of 6 and 11 higher. Price: $300 (or $310 PayPal Goods) $10 (or lesser of actual cost) Shipping.\n\n[IMG]https://www.net54baseball.com/picture.php?albumid=1478&pictureid=34212[/IMG]",
      "post_time": "20220817T13:12:53-06:00",
      "timestamp": "1660763573"
    },
    {
      "post_id": "2254004",
      "post_title": "",
      "post_author_name": "ABbaby",
      "post_content": "Bancroft and Collins SOLD",
      "post_time": "20220817T19:10:00-06:00",
      "timestamp": "1660785000"
    },
    {
      "post_id": "2255637",
      "post_title": "",
      "post_author_name": "ABbaby",
      "post_content": "Gehrig SOLD",
      "post_time": "20220822T13:35:22-06:00",
      "timestamp": "1661196922"
    },
    {
      "post_id": "2265276",
      "post_title": "Jackson Price Update",
      "post_author_name": "ABbaby",
      "post_content": "Hello Net54ers! Thank you for your interest in this piece. I have updated my pricing as this will no longer be available for the $8k price previously listed. Please inquire directly if you are interested. Thank you.",
      "post_time": "20220919T11:34:35-06:00",
      "timestamp": "1663608875"
    },
    {
      "post_id": "2312231",
      "post_title": "",
      "post_author_name": "ABbaby",
      "post_content": "Jackson SOLD",
      "post_time": "20230208T12:49:29-06:00",
      "timestamp": "1675885769"
    }
  ]
}