{
  "id": "188560",
  "forum_id": "4",
  "title": "FS: Immaculate Scrapps Die Cuts Including Unique Pairs",
  "author": "btcarfagno",
  "reply_count": 0,
  "view_count": 581,
  "created_date": null,
  "last_reply": "20140527T12:01:31-06:00",
  "posts": [
    {
      "post_id": "1281092",
      "post_title": "FS: Immaculate Scrapps Die Cuts Including Unique Pairs",
      "post_author_name": "btcarfagno",
      "post_content": "[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/scrapps2_zps0a9f2639.jpg[/IMG]\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/scrapps1_zps0b6d6793.jpg[/IMG]\n\n[IMG]http://i792.photobucket.com/albums/yy203/collectiblesgains/scrapps3_zps435b1f36.jpg[/IMG]\n\nThese have just come back from SGC. The technical grades can almost be thrown out the window, just as they would be for the OJ's. I have seen SGC 40's that have almost no back left, and my pair of 45's look nearly perfect. These seem to have been graded far differently over the years. What I can say about these is that they are obviously uncirculated. The backs are absolutely flawless. The fronts retain ALL OF THEIR ORIGINAL GLOSSY COATING(!!!!). With the lowest graded ones I have listed, you have to look fairly hard to find the slightest flaws. With the best of them, flaws are undetectible (though they must exist somewhere I suppose). Thus I must stress that the aesthetic value of these is infinitely greater than their technical grade.\n\nThere are only three intact pairs known to exist in the entire hobby. Two of them are presented for sale here. Only one of these pairs contains a HOF player, it is here for sale, and it has two of them! On that one (The Thompson/Hanlon), you can very faintly see two or three microscopic punctures on Thompson's shoulder just above ane to the right of the \"T\" in Detroit. Thus the low technical grade for the pair. The Hanlon looks flawless and could command four figures on his own.\n\nBelow are listed the cards, their technical grade, and my price for each:\n\nA.J. Bushong St Louis SGC 45 $400\nHardy Richardson Detroit SGC 45 $400\nCharles Comiskey St Louis (HOF) SGC 50 $1100\nArlie Latham St Louis SGC 60 $600\nJames O'Neill St Louis SGC 80 $750\nDave Foutz St Louis SGC 80 $750\n\nPanels\n\nWil Gleason/Yank Robinson St Louis SGC 60 $1500\nSam Thompson (HOF)/Ned Hanlon (HOF) SGC 20 $2500\n\nThe images provided will be the best I can get, though I will send pictures in current holders for anyone interested.\n\nTom C",
      "post_time": "20140527T12:01:31-06:00",
      "timestamp": "1401213691"
    }
  ]
}