{
  "id": "121934",
  "forum_id": "4",
  "title": "Card on EBay: Is it legit?",
  "author": "joe_44850",
  "reply_count": 7,
  "view_count": 1121,
  "created_date": null,
  "last_reply": "20100330T10:08:31-06:00",
  "posts": [
    {
      "post_id": "791986",
      "post_title": "Card on EBay: Is it legit?",
      "post_author_name": "joe_44850",
      "post_content": "Does anyone know anything about this card on Ebay? I have seen it up for auction for weeks, and he just re-listed it:\n[url]http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=290392758686&ssPageName=STRK:MEBOFFX:IT#ht_500wt_1182[/url]",
      "post_time": "20100321T10:44:32-06:00",
      "timestamp": "1269189872"
    },
    {
      "post_id": "791989",
      "post_title": "",
      "post_author_name": "Bicem",
      "post_content": "looks ok to me.",
      "post_time": "20100321T11:08:09-06:00",
      "timestamp": "1269191289"
    },
    {
      "post_id": "791991",
      "post_title": "",
      "post_author_name": "FUBAR",
      "post_content": "nothing jumps out at me that it may be fake.  The guy has perfect feedback and sells alot of old cards.  interested in know what others think",
      "post_time": "20100321T11:12:03-06:00",
      "timestamp": "1269191523"
    },
    {
      "post_id": "791993",
      "post_title": "",
      "post_author_name": "Jacklitsch",
      "post_content": "No doubt legit. Last one I sold for $20.00. :(",
      "post_time": "20100321T11:17:47-06:00",
      "timestamp": "1269191867"
    },
    {
      "post_id": "792011",
      "post_title": "",
      "post_author_name": "joe_44850",
      "post_content": "Well, I only ask because of how many times I've seen it with no bids. I guess if it's not Old Judge, maybe the demand is a lot lower.",
      "post_time": "20100321T12:44:09-06:00",
      "timestamp": "1269197049"
    },
    {
      "post_id": "792256",
      "post_title": "",
      "post_author_name": "GrayGhost",
      "post_content": "its just a trade card. Obviously, those won't go for big money like A and G, Old Judge, Mayo and the like.",
      "post_time": "20100322T11:53:07-06:00",
      "timestamp": "1269280387"
    },
    {
      "post_id": "792308",
      "post_title": "",
      "post_author_name": "fkw",
      "post_content": "When I bought Trade Cards, I used to buy that exact card for under $50 all the time,  the price is out of whack.  Its authentic but not rare,  its from an English Biscuit Co. and part of a sports series if I remember right.  Ive always thought the card its NOT from 1878, its more likely from the mid 1880s.  The back notes have a date that says 1878 but I believe its not when the card was issued  (Trade cards were all the rage in the 1880s-90s)\n\n\n\n\nIf you are new to Victorian Trade Cards....\n\n\nFrom Lew Lipset's Encyclopedia\n\n\"\"\"\"\"Brief History on \"Trade Cards\"\n\nby Walter Handelman (from Lew Lipset's \"Encyclopedia of Baseball Cards\" Volume One, 1983)\n\nDuring the period between the Civil War and the Turn of the Century, the major form of American Advertising was a small colorful card known today as a \"Trade Card\". The cards were high quality chromolithographs printed on thin cardboard stock. They pictured virtually every subject imaginable both related and unrelated to the advertisement. The cards advertised a specific product or business establishment or both. Some cards were produced as pictures only, with space left for advertising to be stamped on. Some had blank backs, and others had various forms of advertising, testimonials, business locations, etc., on the back. Some of the most outstanding American lithographers, including \"Currier and Ives\" produced these extremely interesting, historical and artistic cards.\n\nThe cards were distributed by jobbers and salesmen to general stores and left on counters as giveaways for customers. The cards were so attractive and popular, that people began to collect them and mount them in scrapbooks. By the year 1880, collecting Trade Cards was one of the nations leading hobbies. Most Trade Cards found today are mounted in scrapbook albums.\n\nBaseball Trade Cards make up an extremely small percentage of those found. Many albums containing hundreds of cards do not even have one card of baseball subject matter. They are, however, an interesting and important part of the Baseball Card Hobby, since they are the earliest know cards. Moreover, Baseball Trade Cards are historically significant since they provide pictorial comment on the National Game during its early development.''''''''",
      "post_time": "20100322T14:28:09-06:00",
      "timestamp": "1269289689"
    },
    {
      "post_id": "794870",
      "post_title": "",
      "post_author_name": "supacards",
      "post_content": "Issued in the uk in 1900 from a set of 12 sports cards including a nice golf card.",
      "post_time": "20100330T10:08:31-06:00",
      "timestamp": "1269965311"
    }
  ]
}