{
  "id": "144590",
  "forum_id": "4",
  "title": "WTB N172 Washington plus OJ question",
  "author": "Wahoowa",
  "reply_count": 4,
  "view_count": 358,
  "created_date": null,
  "last_reply": "20111206T22:24:23-06:00",
  "posts": [
    {
      "post_id": "944799",
      "post_title": "WTB N172 Washington plus OJ question",
      "post_author_name": "Wahoowa",
      "post_content": "Looking to acquire my first N172 and would definitely prefer a Washington player. Any condition is fine.\n\nI have the book but I am trying to familiarize myself with OJ grading/pricing. Thus far my vintage collection only consists of T206. From what I've read it sounds like SGC is preferred by OJ collectors because back damage doesn't automatically result in an Authentic. \n\nThe following card has been on eBay for a while and it seems like a fair price considering the photo quality. Besides the damage on the back is there something I'm missing? There might be an issue with the coloring on the right border, shoulder-level. Any insight would be appreciated, just trying to learn.\n\n[URL=\"http://www.ebay.com/itm/1887-N172-Myers-Al-Washington-Good-440924-/380383814345?pt=US_Baseball&hash=item5890a462c9\"]\nhttp://www.ebay.com/itm/1887-N172-Myers-Al-Washington-Good-440924-/380383814345?pt=US_Baseball&hash=item5890a462c9[/URL]",
      "post_time": "20111205T12:40:01-06:00",
      "timestamp": "1323114001"
    },
    {
      "post_id": "944829",
      "post_title": "Old Judge",
      "post_author_name": "36GoudeyMan",
      "post_content": "I know very little about OJs (which I shall now prove definitively), but I think the problems reflected by the price are the back damage and the inconsistency of the edges. While OJs may not all be cut cleanly, wavier edges suggest hand-cutting or trimming.  The discoloration on the right side is not bad nor terribly distracting, and the image is good.  I don't know how it would grade with the back damage and questionable edges, but with such a clear image, i think the price is probably about right.",
      "post_time": "20111205T13:57:03-06:00",
      "timestamp": "1323118623"
    },
    {
      "post_id": "945013",
      "post_title": "",
      "post_author_name": "ValKehl",
      "post_content": "Kyle - The seller is a well-known, long-time dealer who also does auctions (Steve Verkman).  Coincidentally, today, I received his Holiday sales catalog in the mail.  I see that this same card is listed for sale in his catalog for $150.00.  You can view his inventory online - here's the link to this particular card:  [url]http://www.csauctions.com/online_store/online_store.cgi?show_item=0000133170&level=0000002281&return_results=100&searchtext=&min_cond=&min_price=&max_price=&new_items=&search=&time=&starting_point=0&alt_search=&alt_searchtext=&alt_search_2=&alt_searchtext_2=&alt_search_3=&alt_searchtext_3=[/url]\n\nBest,\nVal",
      "post_time": "20111205T21:27:13-06:00",
      "timestamp": "1323145633"
    },
    {
      "post_id": "945094",
      "post_title": "",
      "post_author_name": "Wahoowa",
      "post_content": "Thanks, I'm sold. Still looking for some additional Nats though.\n\n@Val, Thanks for the information. While collecting Washington T206 I've been able to get by with just eBay and the BST here. I'm excited about the challenge that goes along with a Washington N172 collection but I think it's going to require some involvement with dealers/auctions. By the way I work in the Centreville area, the traffic is great.",
      "post_time": "20111206T09:32:47-06:00",
      "timestamp": "1323189167"
    },
    {
      "post_id": "945343",
      "post_title": "",
      "post_author_name": "ValKehl",
      "post_content": "Hi Kyle,\nYes, Centreville traffic is lotsa fun, especially during rush hour on Route 28.  But, being retired, fortunately, I don't have to deal with it!\n\nDo I correctly assume that you are an UVA grad?  So am I - Go 'Hoos!  I'm thinking about going to Atlanta with my sons and grandsons to see the 'Hoos play Auburn in the Chick-Fil-A Bowl.  I took my sons to UVA's first-ever bowl, the 1984 Peach Bowl.\n\nFYI, I collect OJs of Washington players only, and I have 60+ different cards(different poses of same player, etc.).  If you'd like to see them, let me know (send me a PM or email) and we'll get together - maybe for lunch or at the next Chantilly Show (which I assume you attend).\nbest,\nVal",
      "post_time": "20111206T22:24:23-06:00",
      "timestamp": "1323235463"
    }
  ]
}