{
  "id": "144143",
  "forum_id": "4",
  "title": "FS: Ultimate Display Case, Solid Oak, 300+ cards",
  "author": "biggies",
  "reply_count": 0,
  "view_count": 551,
  "created_date": null,
  "last_reply": "20111124T16:35:21-06:00",
  "posts": [
    {
      "post_id": "942023",
      "post_title": "FS: Ultimate Display Case, Solid Oak, 300+ cards",
      "post_author_name": "biggies",
      "post_content": "For sale\nI had these cases made for me 25 years ago by my best friend's Dad. Emory Frye was an incredible craftsman and with a very basic drawing and an explanation of what I wanted he created the perfect display cases.\n\nThe wall display case measures 85\"x54\". It has 2 sides with 9 rows each. Each row is grooved, beveled and angled so the display of the card is optimum. The top 2 rows are designed for the cards to lean forward. The case is designed to be mounted up to a 7-8 foot height at the top. The doors are glass and both lock independantly and the keys are present.\nThe case is solid oak. It is heavy and 3 people are needed to mount it. The mounting is very simple as Em designed the back perfectly.\nEach row will handle 14 \"modern\" type cards and 23 T cards. The case comfortably holds about 350 cards mixed.\nIt has been displayed in our home on 2 different walls and I have enjoyed changing up the line up every year.\nIt is in absolutely pristine condition and as clean and beautiful as the day I picked it up in Emory's shop. All fittings are solid brass.\n\nThe lower case he made me again by my design request. It is designed to hold 29 binders down below. The 3 top glass sections are designed to display autographs, tickets, etc. The top display sections are about 2 1/2\"s deep. They are lined with felt. All the fittings are solid brass. The case measures \n87\"x17\". Again, solid oak and fits underneath the top display perfectly.\n\nIt would cost about $5000 to have the top case made today. The materials alone in 1990 were over $2000.\n\nI would like to get $1500 for the wall case and $900 for the floor case. I would take $2000 for both. You would need to come to my house in CT to pick them up. I will assist of course. A truck or van will be required.\n\nAny questions please feel free to emial me.\n\nThanks, Bob",
      "post_time": "20111124T16:35:21-06:00",
      "timestamp": "1322177721"
    }
  ]
}