{
  "id": "247844",
  "forum_id": "4",
  "title": "FS: 1926 RPPC St. Louis Cardinals Pennant Winners -- Process Photo Studios",
  "author": "calvindog",
  "reply_count": 1,
  "view_count": 501,
  "created_date": null,
  "last_reply": "20180528T08:41:31-06:00",
  "posts": [
    {
      "post_id": "1722316",
      "post_title": "FS: 1926 RPPC St. Louis Cardinals Pennant Winners -- Process Photo Studios",
      "post_author_name": "calvindog",
      "post_content": "[img]https://farm5.staticflickr.com/4530/37658029015_9f9436215b_c.jpg[/img]\n\nFrom LOTG which also sold an SGC 20 example in 2013 for $384 (with multiple small pinholes):\n\nExceptional postcard featuring a composite image of the members of the 1926 NL Pennant-Winning St. Louis Cardinals.  The Cardinals, who also beat the Yankees in seven games in the 1927 World Series, were led by first baseman Jim Bottomley and pitcher Flint Rhem, along with second baseman/manager Rogers Hornsby.  The Series is famous for Grover Cleveland Alexander's performance in relief in Game 7, after a night of hard drinking.  Alexander was brought into the game in the seventh inning with the bases loaded and two outs to pitch to Tony Lazzeri with a 3-2 lead.  Alexander struck Lazzeri out, retired the Yankees in order in the eighth, and then walked Babe Ruth on a 3-2 pitch with two outs in the ninth.  With left fielder Bob Meusel at the plate, Ruth attempted to steal second on the first pitch, and was thrown out by catcher Bob O'Farrell to end the game - and the series.\n\nThe postcard, which is postally unused, is a composite image containing the members of the team, including Hornsby, O'Farrell, Alexander and Bottomley, along with fellow Hall of Famers Jesse Haines and Chick Hafey. \n\nThe one for sale here is in slightly better shape than the one which sold in LOTG five years ago and is also not postally used.  Just three graded by SGC.  Offered at $370 delivered.  Email or PM if interested.",
      "post_time": "20171120T19:58:43-06:00",
      "timestamp": "1511233123"
    },
    {
      "post_id": "1781296",
      "post_title": "",
      "post_author_name": "calvindog",
      "post_content": "Price lowered.",
      "post_time": "20180528T08:41:31-06:00",
      "timestamp": "1527518491"
    }
  ]
}