{
  "id": "245391",
  "forum_id": "4",
  "title": "FS - 1878 Buffalo Bisons Cabinet",
  "author": "h2oya311",
  "reply_count": 2,
  "view_count": 604,
  "created_date": null,
  "last_reply": "20171002T15:10:06-06:00",
  "posts": [
    {
      "post_id": "1704695",
      "post_title": "FS - 1878 Buffalo Bisons Cabinet",
      "post_author_name": "h2oya311",
      "post_content": "Up for sale is this incredibly unique 1878 Artistic Cabinet card featuring the Buffalo Bisons of the International Association.  This team would jump to the major leagues the next season when they joined the National League.  Led by an up-and-coming pitcher named Pud Galvin, the team played a 116 game schedule finishing with a record of 81-32 with three ties.  Incredibly, Galvin started 101 of those games and completed 96 of them with a record of 72-25 with three ties!!  It is estimated that he pitched 900+ innings that season!!\n\nThe card is 4.25\" x 6.5\" and is a combination of real photographs and drawings.  Among the players mentioned and/or pictured are Pud Galvin, Bill McGunnigle, and John O'Rourke (older brother of Jim and player for the Manchester Manchesters who led the league in hits and batting average that season).\n\nYes, you're eyes are not deceiving you.  The buffalo on the bottom of the image is actually eating a Manchester player!  The condition and clarity of this cabinet photo is simply outstanding.\n\n$1,750 (paypal f/f preferred)\n\nPM or email me at [url]h2oya311@yahoo.com[/url].\n\n[IMG]https://photos.imageevent.com/derekgranger/derekgrangerfirstalbum/websize/1878%20Buffalo%20Bisons%20Cabinet.jpg[/IMG][IMG]https://photos.imageevent.com/derekgranger/derekgrangerfirstalbum/websize/1878%20Buffalo%20Bisons%20Cabinet%20_back_.jpg[/IMG]",
      "post_time": "20170926T16:24:07-06:00",
      "timestamp": "1506464647"
    },
    {
      "post_id": "1705073",
      "post_title": "",
      "post_author_name": "h2oya311",
      "post_content": "more info: \n\nI believe the players pictured are Davy Force and Joe Hornung on top and then Bill McGunnigle and Joe Hornung (sans 'stache) on bottom.  It's possible, given the context of the artistic drawing that the top pictures John O'Rourke, but I'm not sure.",
      "post_time": "20170927T14:33:08-06:00",
      "timestamp": "1506544388"
    },
    {
      "post_id": "1706722",
      "post_title": "back on the market",
      "post_author_name": "h2oya311",
      "post_content": "This card is back on the market for those who had inquired.  The potential buyer backed out due to unexpected personal expenses.",
      "post_time": "20171002T15:10:06-06:00",
      "timestamp": "1506978606"
    }
  ]
}