{
  "id": "123713",
  "forum_id": "4",
  "title": "fs: large group of 21 N28's and N29's (non-baseball)",
  "author": "bcornell",
  "reply_count": 1,
  "view_count": 494,
  "created_date": null,
  "last_reply": "20100519T23:10:28-06:00",
  "posts": [
    {
      "post_id": "807461",
      "post_title": "fs: large group of 21 N28's and N29's (non-baseball)",
      "post_author_name": "bcornell",
      "post_content": "I have a group of 21 non-baseball athletes: 3 N28's and 18 N29's.  These came out of a recent REA lot.  I'd ask $525 ppd. (that's $25/card) or a best offer.  I'll pick up the insurance cost.  Any form of payment is okay, including PayPal.  PM me if interested or send an email to [url]bill@t207.com[/url].\n\nThe list of athletes and conditions from the REA description:\n\n1888 N28 Allen & Ginter (3 cards): Daly (billiards, Gd-Vg), Frey (pool, Vg), and Vignaux (billiards, corner chip in the lower right, otherwise Vg-Ex). \n\n1889 N29 Allen & Ginter (18 cards): Crist (cyclist, Gd - small piece of tape on back), East (oarsman, Vg), Ives (cyclist, Gd), Lange (walker, Gd), McGee (pugilist, Gd-Vg), J. Murphy (pugilist, Vg-Ex), Myers (runner, Vg), O'Connor (oarsman, Vg-Ex), Ross (all-around athlete, Vg-Ex), Webb (swimmer, Vg), and Wood (cyclist, Vg/Vg-Ex); \nseven cards are slightly trimmed: Albert (pedestrian), Barry (hammer thrower; owner's initial in ink on back at bottom), Daly (all-around athlete; small piece of tape on back), Ford (all-around athlete), Hill (club swinger), Ray (pole vaulter), and Stone (cyclist).\n\n[IMG]http://www.t207.com/images/rea/n29.jpg[/IMG] [IMG]http://www.t207.com/images/rea/n29-2.jpg[/IMG]",
      "post_time": "20100512T19:10:16-06:00",
      "timestamp": "1273713016"
    },
    {
      "post_id": "809873",
      "post_title": "",
      "post_author_name": "bcornell",
      "post_content": "I'm taking the liberty of bumping this thread once.  The asking price has been reduced to $525 ppd.  I'd like to sell this group, so if I'm (still) wildly off, feel free to make an offer.  Thanks.\n\n\nBill",
      "post_time": "20100519T23:10:28-06:00",
      "timestamp": "1274332228"
    }
  ]
}