{
  "id": "199449",
  "forum_id": "4",
  "title": "FS: 1859 English Cricket Tour CDV w/ baseball connectionSOLD",
  "author": "piecesofthegame",
  "reply_count": 0,
  "view_count": 358,
  "created_date": null,
  "last_reply": "20150105T20:11:34-06:00",
  "posts": [
    {
      "post_id": "1362961",
      "post_title": "FS: 1859 English Cricket Tour CDV w/ baseball connectionSOLD",
      "post_author_name": "piecesofthegame",
      "post_content": "A very rare and early cricket cdv from the 1859 English cricket tour of the US and Canada with an interesting connection to baseball and Harry and George Wright. The tour included cricket and baseball matches at the Elysian Fields in Hoboken played against Harry and George Wright. \nThere have been some past threads regarding this CDV but it was apparently produced as a souvenir for sale at the actual matches here in the US dating it to 1859. Fred Lillywhite, who traveled with the team as promoter of the tour, sold these photos to promote cricket in this country. SGC recently graded it on site for me. (The label conservatively dates it to the 1860s). Some have even speculated that the photo actually served as a ticket to the matches.\nFred Lillywhite's account of the tour along with box scores showing the Wrights stats has been preserved in his diary which was put into a book about 30 years ago, but its not very exciting to read. Luckily, there is a brand new book with new and interesting research on the tour that I just finished reading, a much more interesting read.\nI will include the new book as well as the older book along with the CDV.\nThis CDV represents an interesting connection between cricket and the roots of baseball today as well as the interesting connection to the Wrights (George started as a cricket player).\nOnly looking for what I have into it, including grading fees.\nSOLD shipped paypal f/f or we can split the fees. Plently of N54 references.",
      "post_time": "20150105T20:11:34-06:00",
      "timestamp": "1420513894"
    }
  ]
}