{
  "id": "248351",
  "forum_id": "4",
  "title": "1889 Athletic Sports in America",
  "author": "barrysloate",
  "reply_count": 4,
  "view_count": 543,
  "created_date": null,
  "last_reply": "20171227T17:27:39-06:00",
  "posts": [
    {
      "post_id": "1726132",
      "post_title": "1889 Athletic Sports in America",
      "post_author_name": "barrysloate",
      "post_content": "Athletic Sports in America, written by sportswriter Harry C. Palmer in 1889, is a 700+ page tome that is the definitive book on the 1888-89 world baseball tour. Palmer accompanied the players and had a birds-eye view of the year's events. This wonderful volume includes four color plates, as well as a few dozen B&W plates of all of the major league teams and players. It is one of the most beautiful early baseball books ever issued.\n\nCONDITION: Unfortunately, the first two pages of the introduction are missing (it should start on page 5), as well as one blank endpaper. Also, there appears to be a repair to the inside cover and first few pages. The book is otherwise entirely intact and easy to read, with a tight spine. Nice copies of this book usually sell for $300 or more, but given the condition issues I will offer this one for the low price of...book is SOLD.\n\nWill accept check, money order, or paypal at [url]bsloate@verizon.net[/url]. Would like to ship via UPS as the book weighs nearly 5 pounds. First one to say \"I'll take it\" gets it. Thanks for looking.",
      "post_time": "20171203T12:39:57-06:00",
      "timestamp": "1512329997"
    },
    {
      "post_id": "1726360",
      "post_title": "",
      "post_author_name": "doug.goodman",
      "post_content": "I'll take it.\n\nPlease.\n\nDoug",
      "post_time": "20171204T09:54:21-06:00",
      "timestamp": "1512406461"
    },
    {
      "post_id": "1726450",
      "post_title": "",
      "post_author_name": "barrysloate",
      "post_content": "Hey Doug- please email or PM me your address. Thanks.",
      "post_time": "20171204T15:04:48-06:00",
      "timestamp": "1512425088"
    },
    {
      "post_id": "1732982",
      "post_title": "",
      "post_author_name": "doug.goodman",
      "post_content": "Barry -\n\nI think I forgot to thank you for the quick shipping and excellent packaging of the book. It arrived in fine shape soon after we struck our deal.\n\nI could probably blame the holidays for my lapse, but it could also be because I'm kind of lazy at this time of the year. Which, I suppose, is another way of blaming the holidays.\n\nDoug",
      "post_time": "20171226T17:26:31-06:00",
      "timestamp": "1514334391"
    },
    {
      "post_id": "1733238",
      "post_title": "",
      "post_author_name": "barrysloate",
      "post_content": "You're very welcome Doug, and your thank you is right on time. Happy New year to you.\n\nBarry",
      "post_time": "20171227T17:27:39-06:00",
      "timestamp": "1514420859"
    }
  ]
}