{
  "id": "150121",
  "forum_id": "4",
  "title": "19th Century Baseball Themed Trade Cards et al",
  "author": "TMKenKen",
  "reply_count": 0,
  "view_count": 543,
  "created_date": null,
  "last_reply": "20120417T13:11:53-06:00",
  "posts": [
    {
      "post_id": "984795",
      "post_title": "19th Century Baseball Themed Trade Cards et al",
      "post_author_name": "TMKenKen",
      "post_content": "Hi...New here. I am an avid collector of 19th centuury Baseball Themed Trade Cards. I posted this in a thread in another forum, but Leon was kind enough to pioint out there is a specific forum to address these matters.  I appreciate his help.  \n\nAnyway, I have a great many cards that are duplicates in my collection and am looking to trade them for cards I don't have.  In my opinion, most of the extra cards are in VG+ or better condition, mostly better. I will be happy to provide a list and scan upon request. Some of them are from the Baby Talk Series and related series or themes, I have many of the Brownies cards (baseball), the baseball playing pigs (Lard), several other miscellaneous cards, an entire set of 4 of the the black player set, a set of the 4 Forbes, and several others. I can identify many by the Keetz catolgue for those who are interested.\n\nPlease understand that I am not a seller. I am looking to enhance my collection by trading with others with similar interests if possible. Condition is very important to me. \n\nI also collect publications, newspapers (Harper's Weekly, Leslies Weekly, American Weekly, New York Times, New York Herald and New York Tribune, New York Clipper (including the theater sports almanac), Wilkes, Spirt of the Times, Reach and Spalding Annuals etc etc) and other books from the 19th century that depict or discuss base, baseball, rounders, trap ball, stool ball etc So a possible swap can happen there as well. Again, condition is important to me, and I have duplicates of some of those I would consider trading etc. Also have an extra Cap Anson autobiography).\n\nI am open to discussion on these matters...Thanks...Tim",
      "post_time": "20120417T13:11:53-06:00",
      "timestamp": "1334689913"
    }
  ]
}