{
  "id": "331858",
  "forum_id": "4",
  "title": "FS: 1897 Original Western League Schedule with Owner Signatures",
  "author": "rholmes",
  "reply_count": 0,
  "view_count": 341,
  "created_date": null,
  "last_reply": "20230218T15:43:53-06:00",
  "posts": [
    {
      "post_id": "2315868",
      "post_title": "FS: 1897 Original Western League Schedule with Owner Signatures",
      "post_author_name": "rholmes",
      "post_content": "SOLD: 1897 Western League Original Schedule with signatures of four team owners. On 8.5\" x 13.5\" sheet that has been split (cut) at the upper 1/3.\n\nIn early March, 1897 the owners of the Western League teams met in Detroit to arrange the schedule for the 1897 season. What is for sale here is part of the original schedule that was finalized at these meetings. Typed on paper with ink corrections and signed by four of the league's eight owners, this sheet compromises half of the schedule. The other half, which would likely have been signed by Comiskey and Mack, is no longer with this half. \n\nThe four signers on the present half of the schedule are:\n\n- Jim Manning, Kansas City (Manning also played for the Boston Beaneaters, the Detroit Wolverines, and the KC Cowboys, and appears in N172)\n\n- CH Saulpaugh, Minneapolis\n\n- Robert Leadley, Grand Rapids (Former manager of the Detroit Wolverines and the Cleveland Spiders. Was a fugitive in Mexico for much of the first decade of the 1900's after embezzlement charges.)\n\n- GA Vanderbeck, Detroit\n\nThis piece was once sold by Heritage with PSA/DNA pre-certification on the autographs. Vanderbeck, however, appears to been signed on behalf of the club secretary.\n\nCondition is very good. A couple of old fold lines, and minor toning. As stated earlier the sheet is in two pieces. This would be an easy fix for a paper restorer if wanted. Reverse is blank.\n\nThis is an interesting piece of early baseball and Western League history, just a couple of years before it would become the American League.\n\nPrice: $SOLD\n\nPM with interest.\n\nThx,\nRay\n\nClick through for larger scans:\n\n[url=https://ibb.co/qnw2Vcp][img]https://i.ibb.co/n0SKtYj/1897-WL-s.jpg[/img][/url]\n\nCloser look at signatures:\n<b>\n[url=https://ibb.co/Qpbg5DP][img]https://i.ibb.co/S5sjLft/1897-WL-d-s.jpg[/img][/url]",
      "post_time": "20230218T15:43:53-06:00",
      "timestamp": "1676760233"
    }
  ]
}