{
  "id": "248880",
  "forum_id": "4",
  "title": "1890-91 Long John Ewing Cabinet SGC 40",
  "author": "nolemmings",
  "reply_count": 7,
  "view_count": 684,
  "created_date": null,
  "last_reply": "20171219T11:53:42-06:00",
  "posts": [
    {
      "post_id": "1729724",
      "post_title": "1890-91 Long John Ewing Cabinet SGC 40",
      "post_author_name": "nolemmings",
      "post_content": "$975 shipped. \nBuck Ewing's brother, this Rembrandt Studios cabinet is beautiful, but is marked down for slight paper loss or surface abrasions on the blank back.  When I won this auction from Heritage, their description pegged it at 1891 because that was the only year John pitched for the Giants.  However, he also pitched for New York in the ill-fated Player's League during its lone season of 1890.  I have not been able to locate any photos showing either of those New York teams wearing the distinctive laced-up jersey, so I can't say either way.  Poor John passed at age 31 in 1895, so there is not a lot of collectible material of him.\n[IMG]http://photos.imageevent.com/imoverhere/prewar/various/large/img442.jpg[/IMG][IMG]https://dyn1.heritagestatic.com/lf?set=path%5B9%2F8%2F8%2F3%2F9883285%5D%2Csizedata%5B850x600%5D&call=url%5Bfile%3Aproduct.chain%5D[/IMG]",
      "post_time": "20171215T10:59:08-06:00",
      "timestamp": "1513360748"
    },
    {
      "post_id": "1730574",
      "post_title": "",
      "post_author_name": "autograf",
      "post_content": "absolutely beautiful piece!",
      "post_time": "20171218T12:29:24-06:00",
      "timestamp": "1513625364"
    },
    {
      "post_id": "1730782",
      "post_title": "",
      "post_author_name": "h2oya311",
      "post_content": "very nice!  No help on the lace-up jersey style, but here's a pic of the NY Giants from 1890 courtesy of the NY Sporting Times from a Supplement I once owned.  The jersey style is pretty similar:",
      "post_time": "20171218T21:33:19-06:00",
      "timestamp": "1513657999"
    },
    {
      "post_id": "1730797",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Derek-John Ewing's jersey couldn't have matched an 1890 NL Giants jersey since he played in the Players' League. Both the NL and PL 1890 New York teams were called the Giants; your image is of the NL team.",
      "post_time": "20171218T22:35:43-06:00",
      "timestamp": "1513661743"
    },
    {
      "post_id": "1730804",
      "post_title": "",
      "post_author_name": "nolemmings",
      "post_content": "Thanks guys.\nJay, Derek's photo is similar to one or two others I have seen of the NL Giants from 1890.  It is helpful in that the NL uniform shown is not of the lace-up variety-- if it were the question of Mr. Ewing's garb would likely be answered.  It remains unsettled, at least to me, whether the 1891 NL New Yorkers also wore lace-ups, or did they have just the same uniform style as shown in Derek's photo from the preceding year.  \n\nIt is my understanding that the Player's League teams deliberately intended to compete as directly as possible with the NL teams in their cities, in which case the closeness of uniform styles would not be surprising. Although I don't collect 19th century stuff, it seems there is a paucity of Player's League stuff out there, given that the league was only around one year.  That is why I believe the cabinet would be more valuable if it could be determined authoritatively to be a P.L. uniform, but I am not disposed to represent it as such, at least at this time.",
      "post_time": "20171219T00:49:38-06:00",
      "timestamp": "1513669778"
    },
    {
      "post_id": "1730805",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Todd-Here is an 1890 NY Players' League cabinet. Although the full top is unfortunately not visible, it appears to not be a dark laced top.",
      "post_time": "20171219T01:15:00-06:00",
      "timestamp": "1513671300"
    },
    {
      "post_id": "1730880",
      "post_title": "",
      "post_author_name": "nolemmings",
      "post_content": "Thanks Jay, I saw that in Memory Lane's catalog.  Small picture, but it does seem to show a different uniform top than Ewing's.  I tried to tell if there was anything distinct in the New York lettering, but only a couple of players show any lettering, and these days my eyes have no shot of seeing that.\n\nSo it stays an unknown.  Do any of the 1890 NY Player's League OJs show new (not re-used) photographs that would give us a  clue? I looked at a few in your book, but again, my eyes are becoming less and less sharp.",
      "post_time": "20171219T09:07:19-06:00",
      "timestamp": "1513699639"
    },
    {
      "post_id": "1730934",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "No, all the Players' League Old Judges use prior images, many from 1887.",
      "post_time": "20171219T11:53:42-06:00",
      "timestamp": "1513709622"
    }
  ]
}