{
  "id": "68248",
  "forum_id": "4",
  "title": "Scarce and complete 1898 color litho Base Ball game board by Forbes Litho. Co., Boston, Ma",
  "author": "Archive",
  "reply_count": 0,
  "view_count": 495,
  "created_date": null,
  "last_reply": "20070320T14:54:00-06:00",
  "posts": [
    {
      "post_id": "372669",
      "post_title": "Scarce and complete 1898 color litho Base Ball game board by Forbes Litho. Co., Boston, Ma",
      "post_author_name": "Archive",
      "post_content": "Posted By: Americas Arts\nAmericas' Arts L.L.C. is a private art dealer who recently was asked to handle a 19th C. lithograph, approx. 16.25” X 10”, identified as a Supplement to the Baltimore American, May 22, 1888, and published by Forbes Litho. 1896 Boston, MA.  \"The National Game of Base Ball.\"  You can see from the three photos that the piece has some damage to the extreme corners, but nothing at all on the main image or interior of the print.  Color and consistency across the paper is very high.  From a standpoint of 100+ year old ephemera, I would describe it as in Very Good (+) condition.\nWe have discovered the following data from the 1995 Maine Antiques Digest concerning a similar piece, in an auction more than 10 years ago.\n\nLive Baseball Auction Brings Over $100,000\nHunt Auctions, Exton, Pennsylvania \n by Lita Solis-Cohen\n© 1995 by Maine Antique Digest\n. . . A scarce and complete color lithographed game board by Forbes Litho. Co., Boston, Massachusetts, in its original sheet form showing Philadelphia vs. Boston, issued as a supplement to The Press in Philadelphia on May 3, 1896, sold for $1045. . .\n\nPhoto images of the piece are at:  [url]http://www.americasarts.com/complete_details_baseball_litho.html[/url]\n\nAmericas' Arts will accept serious inquiries and purchase offers via email at info@americasarts.com    Please include a valid email, phone, and postal address when contacting us.  The party that purchases the piece may do so by PayPal, Visa/MasterCard, or Bank Check only.  We are a certified PayPal business.  Pennsylvania purchase will require a 6% Sales Tax.  Out of state no sales tax applies.  Shipping will be by Fedex, fully insured, overnight.",
      "post_time": "20070320T14:54:00-06:00",
      "timestamp": "1174424040"
    }
  ]
}