{
  "id": "111977",
  "forum_id": "4",
  "title": "For Sale: 1894 Torsch & Lee - Baltimore Team Pendant w/7 HOF'ers (BGS Authentic)",
  "author": "bcbgcbrcb",
  "reply_count": 0,
  "view_count": 773,
  "created_date": null,
  "last_reply": "20090504T16:44:07-06:00",
  "posts": [
    {
      "post_id": "721088",
      "post_title": "For Sale: 1894 Torsch & Lee - Baltimore Team Pendant w/7 HOF'ers (BGS Authentic)",
      "post_author_name": "bcbgcbrcb",
      "post_content": "Good Evening, Collectors:\n\n\nUp for sale tonight is a very scarce 1894 Torsch & Lee - 1894 Baltimore Orioles Team Pendant which pictures 7 Hall of Famers: John McGraw, Joe Kelley, Wee Willie Keeler, Hugh Jennings, Wilbert Robinson, Dan Brouthers & Ned Hanlon. This rare beauty has been encapsulated as \"Authentic\" by Beckett Grading Services, an industry leader in third-party grading. Please review scans of the front and back of the pendant for condition details. The silver metal ring that surrounds the celluloid pendant is coming apart a little bit right near the ring which connects the celluloid piece to the remainder of the ribbon, which is not in the greatest condition anymore. The metal fastner at the top of the ribbon displays some wear. Most of the player images are readable although some are lighter than others with a couple of small stain spots on the front of the celluloid. The back of the celluloid presents very boldly and has no real drawbacks at all. \n\nThis same pendant in better condition just sold in last week's Legendary Auction for $4,400 with the buyer's premium included. I am asking $1,400 dlvd. for mine as the condition is not as nice as the Legendary Auctions piece. This presents the potential buyer with an opportunity to pick up an extremely rare and desirable 19th century item picturing 7 Hall of Famers at a very affordable price.\n\nThe first person to e-mail me and state \"I'll take it\" is the new owner. My e-mail address is: [url]vguerrerobb@yahoo.com[/url]",
      "post_time": "20090504T16:44:07-06:00",
      "timestamp": "1241477047"
    }
  ]
}