{
  "id": "122512",
  "forum_id": "4",
  "title": "(Sold) Knicks Walter T. Avery CDV and PSA Avery Signature",
  "author": "earlybball",
  "reply_count": 2,
  "view_count": 448,
  "created_date": null,
  "last_reply": "20100410T15:43:19-06:00",
  "posts": [
    {
      "post_id": "797519",
      "post_title": "(Sold) Knicks Walter T. Avery CDV and PSA Avery Signature",
      "post_author_name": "earlybball",
      "post_content": "(Sold) Early baseball lot including a CDV of Walter T. Avery and a separate PSA certified Avery signature (Sold).\n\nAvery was one of the original nine knickerbockers to take part in a game against the New York ball club on June 19th, 1846, at the Elysian Fields in Hoboken, New Jersey. That game, played under the new rules formulated by Alexander Cartwright and other members of the Knickerbocker baseball club (rules that now define the game) is generally considered to be the first baseball game in history. \n\nAvery was born in 1814 and graduated from Columbia in 1836. According to his obituary he was a civil engineer and was connected with the building of the original croton water works. His first appearance with the Knickerbockers was on April 14th, 1846. \n\nHe passed away in 1904 at the age of ninety, at which time he was the last living member of the original Knickerbocker baseball club. \n\nVery few images exist of any of any of these, the immortal founding members of the great sport of baseball (I can almost count them on one hand -9 - the large reunion salt print; 3 images of Cartwright; 1849 Knicks; a couple of Doc Adams and two images of Avery)\n\nThe CDV (carte de visite) was taken by Fredericks of 770 Broadway NY and bears the date December 30, 1890 as well as his age 76.11.12ds. The photo measures 2 1/2\" x 4\". The CDV’s provenance is impeccable and originates from REA’s 2009 auction.\n\nThe Authentic Signature comes from one of the ledgers that he kept, listing the books in his private library and is in black fountain pen. This item is slabbed in a PSA/DNA holder and also comes with a letter of authenticity from James Spence authenticators referencing REA.\n\n(Sold)",
      "post_time": "20100407T09:43:13-06:00",
      "timestamp": "1270654993"
    },
    {
      "post_id": "798744",
      "post_title": "Price Reduction",
      "post_author_name": "earlybball",
      "post_content": "Bump for price reduction - now Sold.",
      "post_time": "20100410T11:32:45-06:00",
      "timestamp": "1270920765"
    },
    {
      "post_id": "798787",
      "post_title": "",
      "post_author_name": "Orions father",
      "post_content": "pm sent\nDavid B",
      "post_time": "20100410T15:43:19-06:00",
      "timestamp": "1270935799"
    }
  ]
}