{
  "id": "250039",
  "forum_id": "4",
  "title": "1869 Antiochs CDV-SOLD",
  "author": "GaryPassamonte",
  "reply_count": 3,
  "view_count": 412,
  "created_date": null,
  "last_reply": "20180116T14:22:33-06:00",
  "posts": [
    {
      "post_id": "1738379",
      "post_title": "1869 Antiochs CDV-SOLD",
      "post_author_name": "GaryPassamonte",
      "post_content": "The Antiochs have long been famous for being the first opponent of the legendary 1869 Cincinnati Red Stockings.  In fact, they were the third Red Stocking opponent, but they were the first opponent played on the road. This cdv is dated May 22, 1869.  The Red Stocking played the Antiochs on May 15, 1869.  The offered Antiochs cdv is the finest I have seen of the handful that exist.  This image is usually light, however, this example has exceptional clarity.  The reverse provides a wonderful historical record, listing each player by their position and hometown.  This particular cdv would be a great addition to any 19th century baseball collection.  $3000 OBO. PP.",
      "post_time": "20180113T14:16:24-06:00",
      "timestamp": "1515878184"
    },
    {
      "post_id": "1738385",
      "post_title": "",
      "post_author_name": "aquarius31",
      "post_content": "[quote name=\"GaryPassamonte\" post=1738379]The Antiochs have long been famous for being the first opponent of the legendary 1869 Cincinnati Red Stockings.  In fact, they were the third Red Stocking opponent, but they were the first opponent played on the road.  The offered Antiochs cdv is the finest I have seen of the handful that exist.  This image is usually light, however, this example has exceptional clarity.  The reverse provides a wonderful historical record, listing each player by their position and hometown.  This particular cdv would be a great addition to any 19th century baseball collection.  $3000 OBO.[/QUOTE]\n\n\n\nBeautiful cdv Gary! Good luck with the sale.\n\n\nSent from my iPhone using Tapatalk",
      "post_time": "20180113T14:24:05-06:00",
      "timestamp": "1515878645"
    },
    {
      "post_id": "1738386",
      "post_title": "",
      "post_author_name": "Bicem",
      "post_content": "Amazing piece of history Gary!",
      "post_time": "20180113T14:26:44-06:00",
      "timestamp": "1515878804"
    },
    {
      "post_id": "1739268",
      "post_title": "",
      "post_author_name": "GaryPassamonte",
      "post_content": "Sold",
      "post_time": "20180116T14:22:33-06:00",
      "timestamp": "1516137753"
    }
  ]
}