{
  "id": "189423",
  "forum_id": "4",
  "title": "ONE DAY SALE: Brown's Champs for Sale",
  "author": "oldjudge",
  "reply_count": 12,
  "view_count": 776,
  "created_date": null,
  "last_reply": "20140718T14:39:29-06:00",
  "posts": [
    {
      "post_id": "1287252",
      "post_title": "ONE DAY SALE: Brown's Champs for Sale",
      "post_author_name": "oldjudge",
      "post_content": "The following scarce Brown's Champs are described individually. If interested, please email me at [url]oldjudge@gmail.com[/url]\n\nThanks--Jay",
      "post_time": "20140613T12:33:16-06:00",
      "timestamp": "1402684396"
    },
    {
      "post_id": "1287255",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Comiskey--great image, small amount of black scrapbook paper adhering to back--$1850",
      "post_time": "20140613T12:34:37-06:00",
      "timestamp": "1402684477"
    },
    {
      "post_id": "1287257",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Caruthers-- professionally rebacked--$200",
      "post_time": "20140613T12:37:13-06:00",
      "timestamp": "1402684633"
    },
    {
      "post_id": "1287258",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Foutz--Excellent image, small circle of discoloration on back from scrapbook removal. Ex Cambridge Collection--$450",
      "post_time": "20140613T12:38:40-06:00",
      "timestamp": "1402684720"
    },
    {
      "post_id": "1287260",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Nicholl--light horizontal crease. Small area of discoloration on back from scrapbook removal. ex Cambridge Collection---$295",
      "post_time": "20140613T12:40:14-06:00",
      "timestamp": "1402684814"
    },
    {
      "post_id": "1287264",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Robinson--interesting light impressions on left of card from disturbance during development process. Somewhat light photo although still nice. Some discoloration on back from scrapbook removal. Ex Cambridge Collection---$275",
      "post_time": "20140613T12:43:54-06:00",
      "timestamp": "1402685034"
    },
    {
      "post_id": "1287265",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Hudson--outstanding card in all respects. ex Cambridge Collection--$550",
      "post_time": "20140613T12:44:33-06:00",
      "timestamp": "1402685073"
    },
    {
      "post_id": "1299123",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "One day sale--ends July 18 at 10 PM EDT--25% off all of these prices.",
      "post_time": "20140717T19:46:38-06:00",
      "timestamp": "1405647998"
    },
    {
      "post_id": "1299210",
      "post_title": "",
      "post_author_name": "bn2cardz",
      "post_content": "They are nice cards and sorry to say I don't have the funds to put towards any cards at the moment, but I did have a question.\n\nI know that Brown's Champs can come with and without the copyright on them.  Have you noticed any relation to the scarcity of them?  \n\nFor instance 2 of the 6 you have offered have this copyright line, is this indicative of what you have seen overall for the brown's champions that the copyrights are harder to find?",
      "post_time": "20140718T07:05:25-06:00",
      "timestamp": "1405688725"
    },
    {
      "post_id": "1299287",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Hi Andy! I don't know the answer to your question. I have never tracked them. They also come unnumbered. The unnumbered ones are scarcer.",
      "post_time": "20140718T11:14:33-06:00",
      "timestamp": "1405703673"
    },
    {
      "post_id": "1299291",
      "post_title": "",
      "post_author_name": "bn2cardz",
      "post_content": "[quote name=\"oldjudge\" post=1299287]Hi Andy! I don't know the answer to your question. I have never tracked them. They also come unnumbered. The unnumbered ones are scarcer.[/QUOTE]\n\nI was wondering about the numbering because on some of yours I couldn't tell if it had a number that was faded or missing the number all together.  \n\nThis gives me something to research as I look through internet images of Brown's Champs.",
      "post_time": "20140718T11:27:16-06:00",
      "timestamp": "1405704436"
    },
    {
      "post_id": "1299355",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Andy--I did a little research today. I believe that the uncopyrighted cards came before the copyrighted cards. The inclusion of the copyright may have been Goodwin's response to others \"borrowing\" his images. The Lone Jacks were one such borrower. I also believe that the numbers came after the unnumbered cards. After all, the script cards were unnumbered and the next series were numbered. I looked through two plus sets of cards and it is apparent that the cards with numbers and no copyright are the most common. Next are the cards with a number and a copyright. These are several times scarcer than the ones without a copyright (based on my limited sample). The scarcest cards are those with no number. I have a few with no number and no copyright. Based on my assumptions as to when the different varieties were issued I went in to the study with the thought that I would not find any cards with a copyright and no number, and in fact this proved to be the case. Interestingly enough, the Old Judge ad poster pictured on page 116 of the Old Judge book has a full set of Brown's Champs included in it's 24 cards. All of these have a copyright and a number. This may say that the ad poster was produced later in the Brown's Champ print run.",
      "post_time": "20140718T14:26:04-06:00",
      "timestamp": "1405715164"
    },
    {
      "post_id": "1299364",
      "post_title": "",
      "post_author_name": "bn2cardz",
      "post_content": "I remember when I read through the book that the copyright came later but I couldn't figure out what that meant to relative scarcity.  I totally forgot about mentions of numbering. \n\nWell I hope our conversation helped bump your thread enough to garner some interest.  :D\n\nI am interested in the subset and have been trying to add more, but I just can't right now.",
      "post_time": "20140718T14:39:29-06:00",
      "timestamp": "1405715969"
    }
  ]
}