{
  "id": "125184",
  "forum_id": "4",
  "title": "WTB: Low grade 1895 Mayo Louisville Player or Hamilton",
  "author": "TT40391",
  "reply_count": 3,
  "view_count": 570,
  "created_date": null,
  "last_reply": "20100628T11:46:22-06:00",
  "posts": [
    {
      "post_id": "819497",
      "post_title": "WTB: Low grade 1895 Mayo Louisville Player or Hamilton",
      "post_author_name": "TT40391",
      "post_content": "Hello, I have come to realize that the old judge louisville players are out of my price range but a low grade N300 mayo louisville player is possible.  If anyone has one avaliable please let me know.  Also if anyone happens to have a low grade Billy Hamilton from the set please let me know also.  You can message me throught the board or at [url]wacturner@hotmail.com[/url]  I can pay by paypal or money order.  I am seeking a louisville player from the mayo set because I focus on kentucky related cards, and Hamilton is a player I really respect from that era after doing research on him.  So if anyone has a glasscock or pheifer(did I spell that right?) from louisville or a hamilton please let me know.  Thanks for all the help as always \n\nWilliam",
      "post_time": "20100626T18:24:23-06:00",
      "timestamp": "1277598263"
    },
    {
      "post_id": "819726",
      "post_title": "",
      "post_author_name": "jrog007",
      "post_content": "William,\nI sent a reply through your e-mail.  I am just messaging to make sure you got it.\nJim",
      "post_time": "20100627T21:07:09-06:00",
      "timestamp": "1277694429"
    },
    {
      "post_id": "819735",
      "post_title": "N300 Hamilton For Sale",
      "post_author_name": "Brailey",
      "post_content": "I have a N300 Hamilton I am selling on my for sale page.  Here is the link:\n\n[url]http://imageevent.com/brailey/cardsforsale[/url]\n\nBest regards,\nMike Brailey\nE-mail:  [url]mikebrailey@yahoo.com[/url]",
      "post_time": "20100627T22:14:13-06:00",
      "timestamp": "1277698453"
    },
    {
      "post_id": "819833",
      "post_title": "Hello Jim I got your message",
      "post_author_name": "TT40391",
      "post_content": "Hello Jim thank you for sending an email.  I got it and I just sent you a reply. Thanks also for the tip on the Hamilton Mike, it is still a little out of my price range right now but later this fall if you still have it I may be in touch with you about it when I have a little more money free.  Thanks\n\nWilliam",
      "post_time": "20100628T11:46:22-06:00",
      "timestamp": "1277747182"
    }
  ]
}