{
  "id": "197574",
  "forum_id": "4",
  "title": "Run of 11 Haper's and Leslie's Baseball Woodcuts",
  "author": "earlybball",
  "reply_count": 0,
  "view_count": 294,
  "created_date": null,
  "last_reply": "20141128T16:55:47-06:00",
  "posts": [
    {
      "post_id": "1349037",
      "post_title": "Run of 11 Haper's and Leslie's Baseball Woodcuts",
      "post_author_name": "earlybball",
      "post_content": "Offered is a run of 11 Haper's and Leslie's Baseball Woodcuts from 1859 to 1885. Please contact me for pictures. Remaining lot full price = $625 but take all the remaining woodcuts just for $490\n\n1859, October 15th - Harper’s Weekly – One of the Holy Grail additions of Harpers with 3 large and great woodcut illustrations. Large, full page Woodcut Illustration of the English Cricket 11 of England that toured the US in 1859; Double page woodcut illustration of the cricket match played between England and the USA at Hoboken;  Double page woodcut illustration of the Base-Ball Match a Elysian Fields, Hoboken. (whole publication in pristine condition) - $125\n\nSold  - 1865, August 26th - Leslie’s Illustrated – Championship Match Woodcut Illustration between the Atlantics and Mutual Clubs  -  Sold\n\n1865, November 18th – Harper’s Weekly – Woodcut Illustration of a match played between the Athletics and the Atlantics (whole publication in good shape – no issues with the print) - $60\n\n1865, November 25th – Harper’s Weekly – Woodcut Illustrated Portraits of the Champion Nine of the Atlantic Base-Ball Club (whole publication in great shape) - $60\n\n1866, November 3rd – Harper’s Weekly – Woodcut Illustration of the Athletics of Philadelphia and the Atlantics of Brooklyn (chipping and a few minor tares that do not go into the portrait areas) - $60\n\n1867, October 26th – Harper’s Weekly – Woodcut Illustration of the Champion Nine of the Union Base-Ball Club of Morrisania (whole publication in great shape) - $60\n\n1868, May 16th – Harper’s Weekly – Woodcut Illustration of George F. Sands, President of the National Base-Ball Association - $20\n\n1874, June 27th – Harper’s Weekly – Woodcut Illustration of the Boston Champion Base-Ball Club (whole publication – first page detached – baseball illustration with a 2 inch tare at the top- does not affect the players) $60\n\n1882, September 30th – Harper’s Weekly – Woodcut Illustration of The Providence Base-Ball Club including: Harry Wright, George Wright, Charles “Old Hoss” Radbourn, and John Ward. (whole but detached publication) - $60\n\n1882, October 14th – Harper’s Weekly – Illustration of the Chicago Base-Ball Club including: Cap Anson and Mike King Kelly to name a few. (whole but detached publication with 2 rips going just into the baseball image) - $50\n\n1885, May 16th – Harper’s Weekly – Illustrated Portraits of 12 Champion Base-Ball Players including: Charles “Old Hoss” Radbourn, William Ewing, George Gore, Mike Kelly, James O’Rourke and John Ward to name a few. (whole publication in great shape) - $70",
      "post_time": "20141128T16:55:47-06:00",
      "timestamp": "1417218947"
    }
  ]
}