{
  "id": "268716",
  "forum_id": "4",
  "title": "FS/T: 1887-88 Allen & Ginter N28 Complete (non-baseball) Set",
  "author": "mouschi",
  "reply_count": 4,
  "view_count": 520,
  "created_date": null,
  "last_reply": "20190607T07:45:50-06:00",
  "posts": [
    {
      "post_id": "1875574",
      "post_title": "FS/T: 1887-88 Allen & Ginter N28 Complete (non-baseball) Set",
      "post_author_name": "mouschi",
      "post_content": "Price Reduced to $4,500.  I am open to taking payments as well!\n\nWhen you think of the most significant sports trading cards in history, what comes to mind?  For your consideration, I submit to you the set that, in many ways, started it all.  A set that is so beautiful, it has heavily inspired of one of the most popular series of cards today that has been running for the last 13 years.  A set that has made true converts of the baseball card collecting world making it acceptable to collect and enjoy non-baseball cards.  Ladies & gentlemen, I submit to you a set that predates the most famous sports card in the world, the T206 Honus Wagner by over two decades:  N28 Allen & Ginter World Champions.\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/05/59761776_10218585019719546_8081702908476784640_n.jpg[/img]\n\nCreated circa 1887-88, this timeless set features true world champions from a variety of disciplines from boxing to wrestling to shooting and more.  The athletes depicted on these trading cards were household names and heroes looked up to by people young and old alike.  Movies and songs were created as tributes to the athletes in the set.  These were the super heroes of the day, predating even the likes of Superman by decades.  The true pioneers of sports in America.  If television were around, it is likely many of these athletes would still be household names like Babe Ruth, Michael Jordan and Tiger Woods.\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/06/didyouknow.jpg[/img]\n\nWhile other trading cards of athletes were available around the time of Allen & Ginter's release, it was the truly the first of its kind, offering beautifully made, full color lithographs on thick white card stock.  The beautiful artwork of each athlete is placed on top of a splash of matching color.   Known by many as the most beautiful design ever to grace a sports trading card, N28 Allen & Ginter World Champions is extraordinary in the fact that its design is still used today by Topps for 13 years running, and continues to be a hobby favorite.\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/05/20190505_200038.jpg[/img]\n\nThe set is as rich in history as it is beautiful.  Researching most of these names online will take you on a fascinating journey in American sports history.  From America's first pool shark, to the wrestler that first wore a mask in the ring, this set has something for everyone.\n\nTo put things into perspective of how amazing this set is, it is beneficial to understand its historical place in our country.  The Civil War was still fresh on the minds of people, much like 9/11 is to us.  Abraham Lincoln was only but a few presidential terms prior.  The NFL, NBA & NHL were not yet founded, and things like automobiles, phones and even electricity would be decades away from being commonplace for families.  Alaska, Arizona, Hawaii, Idaho, Montana, New Mexico, North Dakota, Oklahoma, South Dakota, Utah, Washington, and Wyoming were not yet part of the United States.\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/05/3.JPG[/img]\n\nAs the lone female in the set, Annie Oakley is featured - not as a tribute to her long career like you would think that an Honus Wagner card would be created for today, but rather as a keepsake for her fans in the middle of her illustrious career - a rookie card.  Remember \"Annie Get Your Gun\"?  This is that Annie.\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/05/59339719_10218585015599443_5009928790705438720_o.jpg[/img]\n\nThis set was created right in the heart of the Wild West time period.  Along with Annie Oakley, another name in the set is W.F. Cody, AKA Buffalo Bill.  While one may have read newspaper headlines of Oakley and Buffalo Bill, readers may only have to flip a few pages over to read information on their contemporaries Butch Cassidy, Jesse James, Wyatt Earp and Billy the Kid.\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/05/59419608_10218585016199458_5764255099492761600_o.jpg[/img]\n\nConsidered by many to be America's first true sports superstar, John L. Sullivan was known by everyone.  His portrait was hung in saloons, and the phrase \"Let me shake the hand that shook John L.'s hand\" circulated.  Sullivan is credited with bringing boxing from an underground activity into being a legitimate sport.  He also is known as bridging the gap from bare-knuckle brawling to boxing with gloves.  He and Jake Kilrain (whom is also in the set) participated in the last bare-knuckle title fight, with Sullivan winning in 75 rounds - a match that took over 2 hours and 15 minutes.  July 8, 1889 is known as \"Boxing's Longest Day\".\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/05/59363222_10218585013959402_1027770516993212416_o.jpg[/img]\n\nIt would be a disservice to the set indeed, if arguably the most impressive moustache in trading card history wasn't mentioned.  (The set boasts more than half of its featured athletes with moustaches.)\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/05/20190506_140730.jpg[/img]\n\nOne could write volumes of the fascinating stories of title fights, championships and exploits of each of these World Champions.  Being the first of its kind, it is fair to say that the Allen & Ginter World Champions set has its place in history as quite possibly the most important sports card set, ever, with its influence spanning nearly 150 years.\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/05/59577812_10218585013239384_7870643070180524032_o.jpg[/img]\n\nOffered up for your consideration is an entire complete 40 card set of the non-baseball N28 Allen & Ginter World Champion cards.  All are uniformly graded by SGC.  Touting a \"poor\" condition for all but two, the appearance of the cards tell a much different story.  The eye appeal is excellent, with many appearing pack-fresh, just as they came out nearly a century and a half ago.  Boasting sharp corners and bright, colorful fronts, the low grade designation is due to considerable paper loss on the back; an affliction common for these cards, as Allen & Ginter encouraged gluing these into the albums they offered in the 19th century.\n\n[img]https://tanmanbaseballfan.com/wp-content/uploads/2019/05/20190505_200030.jpg[/img]\n\nThe poor grading assigned to these cards is an absolute dream scenario for collectors who are concerned mainly with eye appeal.  A collector would be hard pressed to assemble the entire set of 40 non-baseball athletes this aesthetically pleasing, in matching condition and uniformly graded cases.  Given the similarities of condition, we have every reason to believe that this set was assembled around the time of its production, and kept that way for over a century, glued in an album, just as Allen & Ginter encouraged.\n\nThis set is offered for sale for $5,000 after shipping/fees, or trade for graded baseball vintage.  If you have interest in owning quite possibly the most significant and beautiful non-baseball trading card set in history, please contact me.\n\nHere is a video of them:  [url]https://www.youtube.com/watch?v=oWaXp_3c5Qo[/url]",
      "post_time": "20190506T15:28:19-06:00",
      "timestamp": "1557178099"
    },
    {
      "post_id": "1877427",
      "post_title": "",
      "post_author_name": "mouschi",
      "post_content": "Pics of the case!\n\n[img]http://mycollectionofcards.com/baseballcards/050419/59999142_10218653843920108_2802433355679793152_o.jpg [/img]\n\n[img]http://mycollectionofcards.com/baseballcards/050419/60078330_10218653850440271_1776169951300681728_o.jpg [/img]\n\n[img]http://mycollectionofcards.com/baseballcards/050419/60443738_10218653844960134_5920402574023852032_o.jpg [/img]\n\n[img]http://mycollectionofcards.com/baseballcards/050419/60276164_10218653847560199_7670792649850224640_o.jpg [/img]\n\n[img]http://mycollectionofcards.com/baseballcards/050419/60355274_10218653846480172_7340906657204928512_o.jpg [/img]\n\n[img]http://mycollectionofcards.com/baseballcards/050419/60274684_10218653851200290_139136509230972928_o.jpg [/img]",
      "post_time": "20190513T18:48:01-06:00",
      "timestamp": "1557794881"
    },
    {
      "post_id": "1877499",
      "post_title": "back scans please?",
      "post_author_name": "NiceDocter",
      "post_content": "Great cards wow!  Im sure many including myself would like to see some back scans of some of the cards ..... I know they have paper loss...... thanks in advance and good luck with the sale of these beauties!",
      "post_time": "20190513T23:05:24-06:00",
      "timestamp": "1557810324"
    },
    {
      "post_id": "1877543",
      "post_title": "",
      "post_author_name": "mouschi",
      "post_content": "[quote name=\"NiceDocter\" post=1877499]Great cards wow!  Im sure many including myself would like to see some back scans of some of the cards ..... I know they have paper loss...... thanks in advance and good luck with the sale of these beauties![/QUOTE]\n\nThanks!  Here is an example of one, which is pretty indicative of what they all look like - some better, some worse ...\n\n[img]http://mycollectionofcards.com/baseballcards/050419/59545772_10218585020839574_5148790331835154432_o.jpg[/img]",
      "post_time": "20190514T07:39:14-06:00",
      "timestamp": "1557841154"
    },
    {
      "post_id": "1886209",
      "post_title": "",
      "post_author_name": "mouschi",
      "post_content": "BUMP!  Price Reduced to $4,500.  I am open to taking payments as well.",
      "post_time": "20190607T07:45:50-06:00",
      "timestamp": "1559915150"
    }
  ]
}