{
  "id": "253194",
  "forum_id": "4",
  "title": "SOLD: 1906 Grand Rapids Wolverines PC w/ 7 MLBers",
  "author": "Kris19",
  "reply_count": 0,
  "view_count": 287,
  "created_date": null,
  "last_reply": "20180330T09:39:38-06:00",
  "posts": [
    {
      "post_id": "1762658",
      "post_title": "SOLD: 1906 Grand Rapids Wolverines PC w/ 7 MLBers",
      "post_author_name": "Kris19",
      "post_content": "The Wolverines were a Class B minor league team and featured seven (7) past or future Major Leaguers on the 1906 team pictured on this post card.  Statistical records from that season show only 14 players, the same number of players in the PC.  Some interesting players:  \n\nJohn Ganzel, 1B - Played 7 seasons in MLB:  1898 Pittsburgh Pirates, 1900 Chicago Cubs, 1901 NY Giants, 1903-04 NY Highlanders/Yankees, 1907 Cincinnati Reds;  Career WAR of 10, 682 hits, .251 avg;  T206 card with Rochester\n\nEd Summers, P - 5 MLB seasons with Detroit Tigers 1908-1912;  68-45 record with 2.45 ERA in 999 innings pitched;  In T206, T201, T202, T205, etc. issues\n\nElmer Bliss, P - Pitched in 1 game for 1903 NY Highlanders/Yankees, going 7 strong innings, allowing 0 earned runs in picking up the win for a career perfect record of 1-0 and 0.00 ERA.\n\nBill Grahame, P - Pitched in 64 games for the 1908-1910 St. Louis Browns going 14-29 with a 2.90 ERA;  Included in T206\n\nDan Howley, C and Mgr - Played in only 26 games with the 1913 Philadelphia Phillies, but was Manager for 1927-1929 St. Louis Browns and 1930-1932 Cincinnati Reds\n\nGene Curtis, OF - Played in 5 games for the 1903 Pittsburgh Pirates, collecting 8 hits in 19 at bats for a .421 career average.\n\nWalt Miller, P - Pitched in 3 games for 1911 Brooklyn Dodgers, going 0-1 in 11 innings\n\nSOLD delivered.  Crease in lower left corner, light wear/stains, appropriate writing on front not effecting the image (undivided back)\n\nPlease PM or email [url]kris.sweckard@sbcglobal.net[/url]",
      "post_time": "20180330T09:39:38-06:00",
      "timestamp": "1522424378"
    }
  ]
}