{
  "id": "148013",
  "forum_id": "4",
  "title": "Rare Old Judges for sale or trade",
  "author": "z28jd",
  "reply_count": 14,
  "view_count": 958,
  "created_date": null,
  "last_reply": "20120225T12:20:38-06:00",
  "posts": [
    {
      "post_id": "969810",
      "post_title": "Rare Old Judges for sale or trade",
      "post_author_name": "z28jd",
      "post_content": "Farrar is an ultra rare Player's League card, an 1890 Old Judge and they are tough to find with a decent picture. I also have a lower grade of the same pose/PL from him if this one is out of your price range. That one is an SGC10 with a lighter picture. Only selling/trading one of them though. $2,000 for the SGC40 or $1200 for the other.\n\nSterling is the only OJ graded of him by either SGC or PSA. The card has a great picture and is downgraded a lot due to the back. Listed as a very scarce card in the OJ book. $1500",
      "post_time": "20120223T17:33:39-06:00",
      "timestamp": "1330043619"
    },
    {
      "post_id": "969827",
      "post_title": "",
      "post_author_name": "Fred",
      "post_content": "John,\n\nIs that Sterling from the Oregon Find?  If so, that's a cool piece of provenance.",
      "post_time": "20120223T18:51:32-06:00",
      "timestamp": "1330048292"
    },
    {
      "post_id": "969838",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "I can't say for sure since I didn't buy it from GFG but I'll be darn if it doesn't match up pretty well to it and it has the same back problems as the cards I bought from the Oregon Find. That find had just one Sterling it in, he's very rare",
      "post_time": "20120223T19:16:10-06:00",
      "timestamp": "1330049770"
    },
    {
      "post_id": "969896",
      "post_title": "",
      "post_author_name": "Fred",
      "post_content": "That find had that very same Sterling.",
      "post_time": "20120223T22:35:12-06:00",
      "timestamp": "1330061712"
    },
    {
      "post_id": "969903",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "When you asked that question I had no idea but I was wondering just how much time you spent looking at that Oregon Find that you made that connection!  :)\n\n  I seriously pictured you seeing the card posted by me and knowing right away.",
      "post_time": "20120223T23:00:28-06:00",
      "timestamp": "1330063228"
    },
    {
      "post_id": "969905",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "How can you be sure that Farrar is a Players League card. To me, it looks just like the common two 153-6c Farrars that I own. Most Players League cards have a PL on the photo, yes? Also, all PL cards were 1890 (not 1887) as this was the only year of the PL. Maybe Jay can chime in...most PL cards are also one of a kind (or nearly so) as well, you having two is rather hard to swallow. Fairly certain what you have is just two common OJs. (in which case, I might actually be interested in the lower condition one). Just wondering...\n\nJoshua",
      "post_time": "20120223T23:36:04-06:00",
      "timestamp": "1330065364"
    },
    {
      "post_id": "969926",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "As I said it is an 1890 card and if you look closely at the picture off to the right of his foot you will see the (PL). The other one I have also is the exact same pose, has the (PL) in the exact same spot. That designation can be found in all different places on the card. I have a Hallman, which isn't even listed as a possible card in the Old Judge book and the PL is next to the team name on the card. That card is likely unique. This Farrar pose I have has at least 3 known examples, two of which are mine and the reason I am able to move one of them",
      "post_time": "20120224T06:26:29-06:00",
      "timestamp": "1330089989"
    },
    {
      "post_id": "969938",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "I've included a scan of the other card and enlarged them to show the PL a little better in both, off to the right of his left heel.",
      "post_time": "20120224T07:03:56-06:00",
      "timestamp": "1330092236"
    },
    {
      "post_id": "969950",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "hard to see but i think i can make it out on the sgc 40...cant see anything on the 10...better go look at my farrars too then.",
      "post_time": "20120224T07:37:30-06:00",
      "timestamp": "1330094250"
    },
    {
      "post_id": "969956",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "Well it is in both of the pictures in the exact same spot, just to right of his left heel, both say (PL). I've collected Old Judge cards since the 90's, my name is mentioned twice in the credits of the Old Judge book, I know what a PL card is and how hard they are to find, especially with good photo quality. I've been able to buy just 4 PL cards in over 15 years of actively collecting the set. It is the only reason I bought each of these cards. Send me an email if you want and I'll try to mail bigger scans",
      "post_time": "20120224T07:48:57-06:00",
      "timestamp": "1330094937"
    },
    {
      "post_id": "969958",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Both are Pl cards.",
      "post_time": "20120224T07:51:22-06:00",
      "timestamp": "1330095082"
    },
    {
      "post_id": "970045",
      "post_title": "",
      "post_author_name": "rhettyeakley",
      "post_content": "Josh, you need glasses! :D\n\nHere, I've made it easier for you to spot the \"(PL)\" that was etched into the negative...\n[IMG]http://starsofthediamond.com/farrar2.bmp[/IMG]",
      "post_time": "20120224T12:27:53-06:00",
      "timestamp": "1330111673"
    },
    {
      "post_id": "970111",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "Thanks Rhett...honestly...was not wearing my glasses and could not see it...also need to learn my left from my right. I certainly see it on the 40 and can barely make it out on the 10...no problems to the original poster either. I just was thrown by the sgc flip of 1887 and the lack of clarity...the one PL card I own, the white PL on the negative is very bright.\n\n\nJoshua",
      "post_time": "20120224T16:37:23-06:00",
      "timestamp": "1330126643"
    },
    {
      "post_id": "970123",
      "post_title": "",
      "post_author_name": "z28jd",
      "post_content": "If I had any idea how to do what Rhett did I would've :)\n\n  I don't have a scan of the Hallman I have but I have another(neither of these two are for sale) where it is much easier to see",
      "post_time": "20120224T17:25:38-06:00",
      "timestamp": "1330129538"
    },
    {
      "post_id": "970371",
      "post_title": "",
      "post_author_name": "Fred",
      "post_content": "This should be a main forum thread.... I guess not all PL cards have the PL written on them.  Comiskey on Chicago (for example).... I don't think that has a PL on it.\n\n\nJohn, when I saw the back of the Sterling it had Oregon Find \"written\" all over it.  That splotch in the middle and the rectangular (probably tape) mark on the top.",
      "post_time": "20120225T12:20:38-06:00",
      "timestamp": "1330197638"
    }
  ]
}