{
  "id": "153550",
  "forum_id": "4",
  "title": "WTH: N172, N175 and N284 Grading Expert",
  "author": "llafoe",
  "reply_count": 8,
  "view_count": 509,
  "created_date": null,
  "last_reply": "20120709T17:05:18-06:00",
  "posts": [
    {
      "post_id": "1011796",
      "post_title": "WTH: N172, N175 and N284 Grading Expert",
      "post_author_name": "llafoe",
      "post_content": "Looking to hire someone that can advise me on N172, N175 and N284 purchases.  I'm new and I need an expert set of eyes to point out the pros and cons of each card.",
      "post_time": "20120708T05:37:34-06:00",
      "timestamp": "1341747454"
    },
    {
      "post_id": "1011877",
      "post_title": "",
      "post_author_name": "Leon",
      "post_content": "[quote name=\"llafoe\" post=1011796]Looking to hire someone that can advise me on N172, N175 and N284 purchases.  I'm new and I need an expert set of eyes to point out the pros and cons of each card.[/QUOTE]\n\n\nI would be more than happy to help for free. While not an absolute expert on those series I have owned many of each. Our board does have experts on each series. What are you needing?  The help you are requesting is what our board is best for, for free, on a daily and hourly :) basis.",
      "post_time": "20120708T11:09:47-06:00",
      "timestamp": "1341767387"
    },
    {
      "post_id": "1011888",
      "post_title": "",
      "post_author_name": "Matthew H",
      "post_content": "Leon is right, I can't see anyone here asking money for this kind of service. :)",
      "post_time": "20120708T11:39:09-06:00",
      "timestamp": "1341769149"
    },
    {
      "post_id": "1011891",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Larry-- First, buy The Photographic Baseball Cards of Goodwin & Company, and READ it. That will provide virtually all the information that you need about Old Judges and Gypsy Queens (on the Buchners you will need outside help). If you want to discuss any of the points in the book both Richard and I will be at the National ( unfortunately, Joe will not make it this year). If you want some guidance into card grading we are not your guys. If you want info about the sets I'll be happy to provide some help.",
      "post_time": "20120708T11:48:39-06:00",
      "timestamp": "1341769719"
    },
    {
      "post_id": "1011906",
      "post_title": "",
      "post_author_name": "Leon",
      "post_content": "Larry-  there probably is no better person in the hobby than Jay (OldJudge), who is offering his help, in the N172 and N175 series. This is what makes our hobby so great. Sure we bicker sometimes but we all love the hobby and most of us enjoy helping others in it too. \n\nJay- I am looking forward to seeing you and the guys again. Berkus offered his assistance to me so I might try to hit him up early for some more chairs for behind our table in a few weeks.",
      "post_time": "20120708T12:42:57-06:00",
      "timestamp": "1341772977"
    },
    {
      "post_id": "1011969",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Looking forward to it.",
      "post_time": "20120708T16:25:29-06:00",
      "timestamp": "1341786329"
    },
    {
      "post_id": "1011990",
      "post_title": "",
      "post_author_name": "llafoe",
      "post_content": "Thanks!  I purchased the Goodwin book but I won't receive it for another 3 weeks.  I can't make it to the Nationals (they won't let me leave Afghanistan for a Baseball card show).  :D\n\nIt's difficult to determine good vs. bad on eBay.  The image qualities are poor and I don't know what to look for in the first place.  I'm learning to look for contrast (I believe they mean on the card and not my computer).  ;)\n\nI'll review the book when it arrives (I ordered the T206 book too).",
      "post_time": "20120708T18:12:58-06:00",
      "timestamp": "1341792778"
    },
    {
      "post_id": "1012010",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Larry-First, may God bless and watch over you and the rest of the men and women serving over there. As for the cards, if there is something you are looking at please feel free to email me at [url]oldjudge@gmail.com[/url] and I will provide whatever advice that I can. Be safe!",
      "post_time": "20120708T19:08:04-06:00",
      "timestamp": "1341796084"
    },
    {
      "post_id": "1012364",
      "post_title": "",
      "post_author_name": "Joe_G.",
      "post_content": "Hello Larry,\n\nDitto everything Jay said!\n\nPer your signature, I notice you have an interest in your hometown Indianapolis team.  If you would like, I can pull a list together of all the Goodwin & Co. issued Indianapolis cards (N172/N173/N175).  Feel free to contact me anytime at [url]detroitwolverines@gmail.com[/url]",
      "post_time": "20120709T17:05:18-06:00",
      "timestamp": "1341875118"
    }
  ]
}