{
  "id": "113775",
  "forum_id": "4",
  "title": "SOLD! Nice looking low grade Buchner Gold Coin",
  "author": "Jay Wolt",
  "reply_count": 1,
  "view_count": 393,
  "created_date": null,
  "last_reply": "20090703T21:58:54-06:00",
  "posts": [
    {
      "post_id": "733547",
      "post_title": "SOLD! Nice looking low grade Buchner Gold Coin",
      "post_author_name": "Jay Wolt",
      "post_content": "In my quest to complete the N284 Buchner set, I sometimes buy lots to get what I need and then sell the rest.\nAs coincidence, the last 2 times I've done this, the player is the same. Charlie Getzein.\nI checked the SGC Pop report to see how many are out there, and they have only graded 6.\nI sold a 40 in May on this board, and now I have 2, my 60 and this SGC-10 for sale. 3 of the 6 are registered in sets on the SGC registry.\n\nThe card presents well and looks great for a 10. There is a small pinhole on the bottom left that keeps the card at the 10 level. But the card has vibrant color and corners and edges that would grade higher if not for the pinhole.\n\n$129.00 dlvd, Paypal OK no fee! Or will trade for any Buchner I can use & I can add $$$ to the deal for a better player or a higher graded card.\n\nEmail Link....  [url]jaycos@qualitycards.com[/url] \n\nHere's the writeup I used in May to explain who Getzein was....\n\n1887 N284 Buchner tobacco of Detroit Wolverines pitcher CHARLIE GETZEIN actually spelled GETZIEN graded an SGC-40. Charlie nicknamed \"Pretzels\" due to his German heritage, as he was born in Germany in 1864. He pitched in the National League, primarily w/ Detroit for 9 seasons, his best were in 1886 & 1887 going 30-11 & 29-13. When this card was produced, Detroit was the top team having the best record, 79-45. Detroit beat the American Association's best team the St. Louis Browns (95-40) in a 15 game World Series, going 10-5 w/ Charlie winning 4 of those games.\n\n[IMG]http://www.qualitycards.com/pictures/1264535120.jpg[/IMG]\n\n[IMG]http://www.qualitycards.com/pictures/1264535120b.jpg[/IMG]",
      "post_time": "20090703T09:37:35-06:00",
      "timestamp": "1246635455"
    },
    {
      "post_id": "733709",
      "post_title": "",
      "post_author_name": "Jay Wolt",
      "post_content": "SOLD! Thanks Ben!",
      "post_time": "20090703T21:58:54-06:00",
      "timestamp": "1246679934"
    }
  ]
}