{
  "id": "262272",
  "forum_id": "4",
  "title": "SOLD: 1888 Allen & Ginter A16 Album Featuring N28 Cards",
  "author": "Kris19",
  "reply_count": 1,
  "view_count": 642,
  "created_date": null,
  "last_reply": "20181123T07:22:10-06:00",
  "posts": [
    {
      "post_id": "1827796",
      "post_title": "SOLD: 1888 Allen & Ginter A16 Album Featuring N28 Cards",
      "post_author_name": "Kris19",
      "post_content": "For Sale:  1888 Allen & Ginter A16 Album  \n$xxx delivered, with PayPal F/F please. \n\nClearly has condition issues, but the lithography is stunning.  The good news is that the primo baseball page is probably in the best condition of all the present pages (true for us baseball collectors, that is).  This page shows HOFers Tim Keefe, Cap Anson, and King Kelly, as well as Charles Bennett.  The background design and layout of this page is fantastic.  \n\nThe album is MISSING one of the pages with 3 baseball players on it (Glasscock, Mulvey, and Comiskey).  HOFer John Montgomery Ward is on the cover and HOFer John Clarkson and Bob Caruthers appear on an interior page. So, 7 of the 10 baseball cards in the N28 set are offered here. Boxers, rowers, billiards players, marksmen (and Annie Oakley), and wrestlers as well.\n\nThe cover has absorbed the most damage, with creases, tears and staining.  The pages are in progressively better shape as you move towards the back of the album, until reaching the back cover, which is again rough.  The original binding string is included, but only remains attached through one page (could be strung through others).\n\nA total of 10 interior pages are included, in addition to the double-sided front and back covers.  \n\nPlease PM me or email [url]kris.sweckard@sbcglobal.net[/url]\n\nThanks!",
      "post_time": "20181117T18:51:51-06:00",
      "timestamp": "1542505911"
    },
    {
      "post_id": "1829202",
      "post_title": "Price Reduced",
      "post_author_name": "Kris19",
      "post_content": "Call it a Black Friday sale if you want, but I have reduced the price to xxx.  The Anson, Keefe, Kelly page alone has sold for $540: [url]https://www.robertedwardauctions.com/auction/2014/fall/39/1888-a16-allen-ginter-worlds-champions-album-page-anson-keefe-kelly/[/url]\n\nHeck, you might even be able to try out SGCs new sheet cutting service ;)",
      "post_time": "20181123T07:22:10-06:00",
      "timestamp": "1542982930"
    }
  ]
}