{
  "id": "224619",
  "forum_id": "4",
  "title": "FS: 1867 Niagara BBC Imperial Team Cabinet - Deacon White Collection",
  "author": "earlybball",
  "reply_count": 6,
  "view_count": 596,
  "created_date": null,
  "last_reply": "20160701T03:57:28-06:00",
  "posts": [
    {
      "post_id": "1555771",
      "post_title": "FS: 1867 Niagara BBC Imperial Team Cabinet - Deacon White Collection",
      "post_author_name": "earlybball",
      "post_content": "FS: 1867 Niagara BBC Imperial Team Cabinet - Deacon White Personal Collection\n\nOffered is my 1867 Niagara’s Imperial Cabinet purchased from REA. \n\n$2495 delivered via singed for and tracked service.\n\nOriginal imperial cabinet photograph picturing nine members of the 1867 Niagara Base Ball Club. All of the players are pictured in uniform as they pose together in a formal studio setting. Ex Cincinnati Redstockings pitcher Al Atwater holds the ball while a bat rests alongside another one of the seated players (Van Velsor). The bib-front uniforms seen here are notable for their checkered pattern, the design of which extended to the caps as well. Interestingly, the seated player to the far left has had his facial image affixed onto the body. That was a common photographic practice at the time, especially with regard to composite prints. The reason for it here is unknown (perhaps the original player photographed was replaced on the team for some reason by the gentleman seen here). Although neither the team nor players are listed in print, the identification of the club and year are based upon two other examples of this image that we have seen. The first appeared in a special pictorial issue of the National Pastime (published by the Society for American Baseball Research, Spring, 1984), where it was identified as the \"1867 Niagaras of Buffalo\" by editors John Thorn (the Official Historian of Major League Baseball) and Mark Rucker. The other example appeared in a three-photo collage of the Niagara BBC that once resided in the Barry Halper Collection. The collage featured two photos that were identified as the 1857 club and one identified as the 1867 team (identical to the image offered here). It should be noted that the 1867 photo in the Halper collage was not an original print, but one that was printed at a slightly later date (we do not know the history of the photo that appeared in the National Pastime; it was neither this photo nor the Halper image). Adding to the appeal of this photo is its extraordinary provenance! This photo originates from the personal collection of recently elected Hall of Fame catcher Deacon White and was one of a number of items from his collection that came to auction in 2006 (all were consigned directly by the White family). Early baseball photos from the 1860s, especially in this format, are exceedingly rare. That, combined with its provenance, make this both an exceptional and highly desirable example dating from the dawn of organized baseball. The photo (13 x 9.5 inches on a 17 x 14-inch mount) displays a number of tiny abrasions, a few of which touch upon some of the player images. The mount displays light soiling along the edges. In Very Good to Excellent condition overall. Matted and framed to total dimensions of 21 x 17.75 inches. \n\nTop Row (LR): Stanley Bagge Cowing 3B/OF (1844-1921); John R. Dobbins (1843-1905); Edward Pease Atwater (Professional - P.) (1845-1903); Townsend Davis (?-1898); Edward Selden Hawley SS (1846-1937); Henry S. Sprague (1844-1889). \n\nBottom Row Sitting (L-R): Myron Holly (Professional - Infield/Catcher) (1842-1907); John W. Van Velsor (1B) (1839-1910); Thomas E. Emerson (OF) (1845-1890). \n\nThe Niagara’s started in 1857 and were strictly an amateur gentleman’s club. Famous for their smart chequered uniform; their victory over the professional national champion Atlantics (1868 – Chadwick in attendance) and an extraordinary victory over the Buffalo Colombia’s by a record score of 209-10.\n\nOf the 1867 team, two went on to become some of the first professional players. Atwater joined the famous Cincinnati Red Stockings in 1870 and Myron Holly also turned pro that year, joining the Olympics of Washington.",
      "post_time": "20160628T09:33:36-06:00",
      "timestamp": "1467128016"
    },
    {
      "post_id": "1555851",
      "post_title": "",
      "post_author_name": "ramram",
      "post_content": "Great classic image Jason. \n\nRob M.",
      "post_time": "20160628T13:44:33-06:00",
      "timestamp": "1467143073"
    },
    {
      "post_id": "1555860",
      "post_title": "Thanks Rob!",
      "post_author_name": "earlybball",
      "post_content": "Thanks Rob - long time no hear! Hope you are well?",
      "post_time": "20160628T14:06:54-06:00",
      "timestamp": "1467144414"
    },
    {
      "post_id": "1555871",
      "post_title": "",
      "post_author_name": "FirstYearCards",
      "post_content": "Not in my wheelhouse, but one of the best descriptions ever. A pleasure to read.",
      "post_time": "20160628T14:37:15-06:00",
      "timestamp": "1467146235"
    },
    {
      "post_id": "1555895",
      "post_title": "",
      "post_author_name": "GaryPassamonte",
      "post_content": "Wonderful image.  This is something to think about, Jason.",
      "post_time": "20160628T17:07:44-06:00",
      "timestamp": "1467155264"
    },
    {
      "post_id": "1556247",
      "post_title": "",
      "post_author_name": "BeanTown",
      "post_content": "Dido! Great card with a great image.",
      "post_time": "20160629T14:31:55-06:00",
      "timestamp": "1467232315"
    },
    {
      "post_id": "1556829",
      "post_title": "Thanks Guys!",
      "post_author_name": "earlybball",
      "post_content": "Thanks for the kind words guys. It is a lovely image but it is just too big for my scanner (pics don't do it justice!) so you will have to put up with the glare and my off putting silhouette!",
      "post_time": "20160701T03:57:28-06:00",
      "timestamp": "1467367048"
    }
  ]
}