{
  "id": "167502",
  "forum_id": "4",
  "title": "SOLD! 1896 Louisville Colonels cabinet card of Frank Eustace",
  "author": "scooter729",
  "reply_count": 1,
  "view_count": 605,
  "created_date": null,
  "last_reply": "20130421T18:01:43-06:00",
  "posts": [
    {
      "post_id": "1120945",
      "post_title": "SOLD! 1896 Louisville Colonels cabinet card of Frank Eustace",
      "post_author_name": "scooter729",
      "post_content": "Hi,\n\nI'm selling the pictured cabinet card of Frank Eustace from the 1896 Louisville Colonels.  I am assuming this is from 1896, as this was his only year in the bigs.  Frank's stats can be seen here:\n\n[url]http://www.baseball-reference.com/players/e/eustafr01.shtml[/url]\n\nThe image on the front of the cabinet is nice and bold.  There are condition issues as you can see, including trimmed edges and pinholes in the corners.  This is likely a unique cabinet from quite a team - Fred Clarke was on the 1896 Colonels, and Honus Wagner would join the next season.  The back references I&M Steinberg Studios.  The Baseball Reference website only has a fuzzy portrait of Eustace, likely from a team photo, so this is probably the best known image of Eustace.\n\nA little info I found in researching this: on the back of the cabinet, it is written \"Francis Eustes, Rena's Husband\".  Since I assumed this was referring to Frank Eustace (closest name I could find as a Louisville Colonel player), out of curiosity I searched on ancestry.com.  Lo and behold, in the 1910 US Census, there is a listing for Rena Eustace, spouse of Frank Eustace, in Schuylkill, PA.  The player Frank Eustace is buried in Pottsville, PA, the next town over, so I'm pretty confident as to the player ID here.\n\nPrice for the cabinet is SOLD delivered; I prefer PayPal gift but any form of payment is accepted.\n\nThanks for looking!\nScott",
      "post_time": "20130421T11:42:46-06:00",
      "timestamp": "1366566166"
    },
    {
      "post_id": "1121159",
      "post_title": "",
      "post_author_name": "chris",
      "post_content": "I'll take it.\n\nThanks\nChris",
      "post_time": "20130421T18:01:43-06:00",
      "timestamp": "1366588903"
    }
  ]
}