{
  "id": "179405",
  "forum_id": "4",
  "title": "FS: 1887 N284 Hardy Richardson Buchner Gold Coin-Reduced",
  "author": "Gobucsmagic74",
  "reply_count": 2,
  "view_count": 427,
  "created_date": null,
  "last_reply": "20131130T13:39:28-06:00",
  "posts": [
    {
      "post_id": "1210993",
      "post_title": "FS: 1887 N284 Hardy Richardson Buchner Gold Coin-Reduced",
      "post_author_name": "Gobucsmagic74",
      "post_content": "PSA 6! $600 obo, paypal F/F\n\nIn a 14-season career, Richardson compiled a .299 career batting average with 1688 hits, 70 home runs, and 822 RBIs in 1331 games. He had 205 career stolen bases and 1120 runs scored. Great player, great card!\n\nFun fact #1:\nRichardson was recently referenced in a 2010 episode of Boardwalk Empire",
      "post_time": "20131126T21:07:54-06:00",
      "timestamp": "1385525274"
    },
    {
      "post_id": "1210995",
      "post_title": "",
      "post_author_name": "Gobucsmagic74",
      "post_content": "Fun Fact #2:\nRichardson was involved in an unusual circumstance in a game against the Chicago White Stockings on August 13, 1884. Chicago's George Gore singled to lead off the game, and Chicago manager Cap Anson instructed him to avoid the double play at all costs. Accordingly, when King Kelly followed with a ground ball, Gore tackled Richardson at second base before he could complete the relay throw. The umpire called both the batter and the runner out, and Anson protested the ruling so strenuously and stridently that the umpire forfeited the game to Buffalo. This ruling was met with disapproval by the Chicago crowd of approximately 2,000, and after extensive discussions, the two teams agreed to resume a game which had been postponed earlier in the season, as a way of placating the dissatisfied fans.\n\nIn this second game, Anson decided to give his players a personal demonstration of the right way to break up the double play. He reached first base, and when the next batter hit a ground ball to Richardson, Anson shouted and waved his arms while running to second in an effort to interfere with Richardson's throw. Possibly flustered by this display, Richardson in turn struck Anson square in the head with his throw, which was delivered hard enough that it bounced all the way into the grandstands. A woozy Anson was forced to leave the game.",
      "post_time": "20131126T21:09:42-06:00",
      "timestamp": "1385525382"
    },
    {
      "post_id": "1212036",
      "post_title": "",
      "post_author_name": "Gobucsmagic74",
      "post_content": "Price reduced bump",
      "post_time": "20131130T13:39:28-06:00",
      "timestamp": "1385843968"
    }
  ]
}