{
  "id": "127492",
  "forum_id": "4",
  "title": "1886 Habana Championship team image with many Cuban HOFers",
  "author": "ramram",
  "reply_count": 0,
  "view_count": 676,
  "created_date": null,
  "last_reply": "20100907T16:33:02-06:00",
  "posts": [
    {
      "post_id": "834933",
      "post_title": "1886 Habana Championship team image with many Cuban HOFers",
      "post_author_name": "ramram",
      "post_content": "No Longer For Sale - If Castro's going to privatize the country then I better hang on to this.  :-)\n\nOver-sized cabinet of the 1886 Havana Cuba Championship team.\n\n\n1886-1887 Championship Habana BBC team image. One of the most important and rare early Cuban baseball photographic images. This image is loaded with Cuban Hall of Famers including; Emilio Sabourin (one of the fathers of Cuban baseball), Adolfo Lujan, Rafael Hernandez, and Pablo Ronquillo. Typical of Cuban material, this oversized cabinet card has signs of water stains and edge damage as seen in the pics. The image was framed and matted by a previoius owner for the protection of the image. Framed size is 17 1/2\" x 24\". Photograph size from inside edges of matting is 9\" x 13\". Players names and positions are listed below each image. Great baseball embellishments and original coloring is contained throughout the photo. The directors are shown in the middle image along with their Championship blanket. Players starting from lower left and moving clockwise; Rafael Hernandez - 2nd Baseman, Alejandro Castillo - 3rd Baseman, Gustavo Arostegui - Shortstop, Fernando Santana - Left Fielder, Adolfo Lujan - Pitcher, Antonio Garcia - Catcher, Victor Plana - Right Fielder, Jose Lujan - Right Short Stop, Pablo Ronquillo - 1st Baseman, Joaquim Varona? - Substitute. \n\n\nRob M.\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=24580&d=1283898494[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=24581&d=1283898536[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=24582&d=1283898580[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=24583&d=1283898632[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=24584&d=1283898696[/IMG]",
      "post_time": "20100907T16:33:02-06:00",
      "timestamp": "1283898782"
    }
  ]
}