{
  "id": "327980",
  "forum_id": "4",
  "title": "And the 2022 award for this years Jackass of the hobby is…",
  "author": "67airborne",
  "reply_count": 0,
  "view_count": 474,
  "created_date": null,
  "last_reply": "20221124T04:55:37-06:00",
  "posts": [
    {
      "post_id": "2286774",
      "post_title": "And the 2022 award for this years Jackass of the hobby is…",
      "post_author_name": "67airborne",
      "post_content": "Welcome to the annual net54 2022 Jackass of the hobby award nominations.\n \nI have 2 I would like to nominate this year to get it started. \nI’d first like to nominate myself for my stupid act this year. My moment came when I decided last June to submit some cards to PSA. It had 4 submissions in one, one high end card with a month turnaround, 5 raw cards, 3 to be put in new cases and 12 for cross over grading. I won’t mention the turnover time even though it was/is ridiculous. I’m still waiting on the crossovers. \n\nMy second nominee is PSA for the job they did when I submitted my cards to these idiots. First My only pet peeve with cards I collect are, no damage on the face. I can accept pretty much anything else holes creases some paper loss. But no creases to the face. So when I seen what these clowns had done when they put my card in their new case, totally pisses me off. After the damage they have done there is no way this card would grade out a 4.5. I had other cards that were just as nice if not better looking that didn’t cross. But they shit to bed on this. \nUnfortunately when I mailed these over the summer I was in the middle of recovering from knee surgery and forgot to take pictures before I mailed it. \n  \nYou would think when a company is putting Their holder on your card they would want it to present the best possible way. To promote their business in a positive way when you see it. I mean they do have 2 quality checks after your card is graded before they ship. Here is the way my Ruth was sent back. Why I ask would anyone, let alone 2 or 3 people let it ship this way. Yes it’s my card, but theses idiots have their name on it for this stunning eye appeal. \nLet the list begin. Jeff",
      "post_time": "20221124T04:55:37-06:00",
      "timestamp": "1669290937"
    }
  ]
}