{
  "id": "67995",
  "forum_id": "4",
  "title": "19th century point of sale advertising piece (N152s)",
  "author": "Archive",
  "reply_count": 0,
  "view_count": 645,
  "created_date": null,
  "last_reply": "20060513T10:54:00-06:00",
  "posts": [
    {
      "post_id": "371905",
      "post_title": "19th century point of sale advertising piece (N152s)",
      "post_author_name": "Archive",
      "post_content": "Posted By: Keith O'Leary\nI was going to email the high bidder on this item after the auction, but thought it would be a better idea to do this. The seller has 3 of the cards. Heres a link to one of them.\n \n[url]http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=6278454582&rd=1&sspagename=STRK%3AMEWA%3AIT&rd=1[/url]\n \nI've had this piece laying around not being appreciated by anyone, so thought I'd offer it. Its not in the best of shape, but I feel the value is in \"what it is\" and its rarity (I've never seen another). Theres a horizontal crack across the bottom as seen, but feel with a little restoration, this point of sale advertising piece could be brought back to its original eye catching glory. I will say, because of the way the cards fit under the frame (as well as the frame not having any advertising on it) I can't guarantee its 100% original as issued to the store by Duke, but because of the way everything is situated in the frame and the gold gilt on the inside of the frame matching the lettering 100%, if was cut down at all and re framed, it would have had to have been only an inch or so (sides or top) and they would have had to have found a frame with gold gilt to match the lettering on the piece. I can't for the life of me believe someone would or could. I'll post 1 picture with links to some others including the back and closeups. If anyone has any questions, PM me or email. I'll take $300 delivered.\n \n[IMG]http://i45.photobucket.com/albums/f92/vwtdi55/duke2.jpg[/IMG]\n \n[IMG]http://i45.photobucket.com/albums/f92/vwtdi55/duke1.jpg[/IMG]\n \n[IMG]http://i45.photobucket.com/albums/f92/vwtdi55/duke3.jpg[/IMG]\n \n[IMG]http://i45.photobucket.com/albums/f92/vwtdi55/duke4.jpg[/IMG]\n \n[IMG]http://i45.photobucket.com/albums/f92/vwtdi55/duke5.jpg[/IMG]\n \nKeith",
      "post_time": "20060513T10:54:00-06:00",
      "timestamp": "1147539240"
    }
  ]
}