{
  "id": "300880",
  "forum_id": "4",
  "title": "Rarities For Trade or Sale: '25 Champions Exhibit Ruth 1-Poor / N526 MJ Madden EX-5",
  "author": "cdn_collector",
  "reply_count": 2,
  "view_count": 459,
  "created_date": null,
  "last_reply": "20210424T12:38:12-06:00",
  "posts": [
    {
      "post_id": "2096119",
      "post_title": "Rarities For Trade or Sale: '25 Champions Exhibit Ruth 1-Poor / N526 MJ Madden EX-5",
      "post_author_name": "cdn_collector",
      "post_content": "Hey everyone,\n\nPosting this for a friend, surely some of you will remember -- Ted Golden aka blacksoxfan. He's been out of the hobby for a bit, but is slowly re-entering and looking to move a couple cards that don't fit his main collecting interests (Black Sox & W514s).\n\nHis contact info is listed at the very bottom of the thread.\nYou can click on the images to see larger versions.\n\nCheers,\n\nRichard.\n\n-------\nI would prefer to trade these. I'm interested in a mid-grade w514 Ruth or another interesting/hard to find Black Sox card. If it works out where someone has a low grade Jackson Cracker Jack, i would trade both of these for that but otherwise I think they both have substantial value independent of that. Feel free to make a cash offer as well.\n\n1925 Champions League Exhibits Babe Ruth - SGC 10/1 Poor\nCard is appropriately graded. Back is marked with a previous owner's name and was clearly removed from a scrapbook at some time. Card has been in my collection for 10+ years and was sent in for grading by me back in the 00s.\n\nThe SGC 2 that just sold in REA went for 7800. This card is not as nice but unlike the REA example, this one is not creased on the front so the image of Ruth is fairly clean. The giant white spot on the front looks like a white mark.\n\nHere is the description of the card from the REA auction:\nExtremely rare Exhibit-style card (3-3/8 x 5-3/8 inches) featuring Babe Ruth in a follow-through swing. One of the few Ruth cards dating from the mid-1920s, this striking card was one in a series of thirty-two cards featuring the top athletes of the day, with a different athlete representing each sport. Babe Ruth is the only baseball player in the set. A small white box in the lower left corner has the printed notation \"Babe Ruth [U.S.A.] World's Champion Baseball Player.\" Graded GOOD 2 by SGC (submitted by REA) due to moderate creasing, honest corner wear, and minor soiling on the blank reverse. This is a special and very distinctive looking Babe Ruth card that has always been one of our favorites and which has received very little attention in large part simply because of its great rarity.\n\n[URL=\"https://www.richardarmstrong.ca/blacksoxfan/Ruth_Front.jpg\"][IMG]https://www.richardarmstrong.ca/blacksoxfan/Ruth_Front.jpg[/IMG][/URL]\n\n[URL=\"https://www.richardarmstrong.ca/blacksoxfan/Ruth_Back.jpg\"][IMG]https://www.richardarmstrong.ca/blacksoxfan/Ruth_Back.jpg[/IMG][/URL]\n\n\n1889 N526 Number 7 Cigars M.J. Madden PSA 5 - EX\nReally beautiful and rare card - I'm almost certain the grade is tied to the registration/centering of Madden's image - though it's not unusual for the set and i find it nicer than some of the \"higher\" graded examples i've seen. I've only seen one other example of the Madden but i've been out of the hobby for a while.\n\nIt's my oldest \"Braves\" card in my collection so it's with some reservation that I move this. I suspect if you're interested in this card you know a good bit about it but here's a little info nonetheless:\n\nThe 15 card set features all Beaneaters (aka Braves today)\nPrinted by Howard W. Spurr & Company, they are on thinner stock than a lot of the comparable cards from this era.\nBack shows ads for either Diamond S or #7 cigars.\n\n[URL=\"https://www.richardarmstrong.ca/blacksoxfan/Madden_Front.jpg\"][IMG]https://www.richardarmstrong.ca/blacksoxfan/Madden_Front.jpg[/IMG][/URL]\n\n[URL=\"https://www.richardarmstrong.ca/blacksoxfan/Madden_Back.jpg\"][IMG]https://www.richardarmstrong.ca/blacksoxfan/Madden_Back.jpg[/IMG][/URL]\n\nTed Golden \n[url]shoelessjoe@blacksoxfan.com[/url]",
      "post_time": "20210424T05:37:14-06:00",
      "timestamp": "1619264234"
    },
    {
      "post_id": "2096226",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Aren't  the giant white splotches on the Ruth paper loss?",
      "post_time": "20210424T10:51:31-06:00",
      "timestamp": "1619283091"
    },
    {
      "post_id": "2096246",
      "post_title": "",
      "post_author_name": "cdn_collector",
      "post_content": "[quote name=\"oldjudge\" post=2096226]Aren't  the giant white splotches on the Ruth paper loss?[/QUOTE]\n\nHey Jay,\n\nI'm on the phone with Ted right now asking him to clarify.\n\nHe says that looking at the card through the slab it's very difficult to tell but that it looks more like something has been added to the card --whether it's paint (white out?!) or what, he can't say -- as opposed to taken away. \n\nHe's also willing to admit that maybe it is paper loss to a more trained eye.\n\nBottom line -- the spot isn't going away in his opinion.\n\nRichard.",
      "post_time": "20210424T12:38:12-06:00",
      "timestamp": "1619289492"
    }
  ]
}