{
  "id": "313770",
  "forum_id": "4",
  "title": "N284 Buchner Gold Coin question",
  "author": "RFResnick",
  "reply_count": 4,
  "view_count": 380,
  "created_date": null,
  "last_reply": "20220118T20:18:51-06:00",
  "posts": [
    {
      "post_id": "2186558",
      "post_title": "N284 Buchner Gold Coin question",
      "post_author_name": "RFResnick",
      "post_content": "Hello! I know this is a long shot, but ...\n\nI'm trying to collect all the New York Giants within the N284 Buchner Gold Coin set from 1887. I have two John Ward variations (\"fielding grounder\" and \"hands BY knees\"), but according to several checklists, there is also a \"hands ON knees\" variation that I've never seen.\n\nIn fact, I can't find an example of the \"hands on knees\" card anywhere on the internet. Even VCP doesn't have a photo or record of a single transaction.\n\nDoes anyone in this esteemed forum know of a \"hands on knees\" N284 John Ward ... or does anyone have photo proof that it actually exists? I'm not convinced it's a real thing!!! Thanks for any feedback.",
      "post_time": "20220117T14:13:03-06:00",
      "timestamp": "1642453983"
    },
    {
      "post_id": "2186673",
      "post_title": "",
      "post_author_name": "Baseball Rarities",
      "post_content": "Crazy timing that you just made this post. Here is my post on the same subject from earlier today:\n\n[url]https://www.net54baseball.com/showthread.php?t=313760[/url]",
      "post_time": "20220117T18:26:54-06:00",
      "timestamp": "1642469214"
    },
    {
      "post_id": "2186789",
      "post_title": "",
      "post_author_name": "RFResnick",
      "post_content": "Wait! What?? How is it humanly possible that we both asked the same obscure question two hours apart???? :) That's amazing. Please let me know if you get any response.\n\nPersonally, I don't think it's real. I think someone confused \"hands by knees\" with \"hands on knees.\" As you point out, Ward would be the only player with three poses. It doesn't add up.\n\nI'm thrilled there's another person out there who had the same ridiculous question!\n\nAll the best -- Rick",
      "post_time": "20220118T07:42:20-06:00",
      "timestamp": "1642516940"
    },
    {
      "post_id": "2186868",
      "post_title": "",
      "post_author_name": "Baseball Rarities",
      "post_content": "Rick - take a look at the post above. The card is actually in Lipset's book and I posted an image of it.",
      "post_time": "20220118T12:35:09-06:00",
      "timestamp": "1642534509"
    },
    {
      "post_id": "2187029",
      "post_title": "",
      "post_author_name": "RFResnick",
      "post_content": "Thanks, man. Amazing.",
      "post_time": "20220118T20:18:51-06:00",
      "timestamp": "1642562331"
    }
  ]
}