{
  "id": "288369",
  "forum_id": "4",
  "title": "FS - 1888 A16 Allen & Ginter \"World's Champions\" Album PRICE DROP",
  "author": "doug.goodman",
  "reply_count": 4,
  "view_count": 967,
  "created_date": null,
  "last_reply": "20240706T14:21:44-06:00",
  "posts": [
    {
      "post_id": "2013868",
      "post_title": "FS - 1888 A16 Allen & Ginter \"World's Champions\" Album PRICE DROP",
      "post_author_name": "doug.goodman",
      "post_content": "This 1888 First Series Allen & Ginter \"World's Champions\" premium album features all fifty cards from the N28 Allen & Ginter set, including ten baseball players (Anson, Kelly, Clarkson, Comiskey, Keefe, Ward, Glasscock, Bennett, Caruthers, and Mulvey.) and nine boxers (including Sullivan). \n\nThe tobacco companies spared no expense in producing these gorgeous full-color lithographic premium albums, which were available only by mail in exchange for coupons packed with tobacco products (in this case Allen & Ginter). \n\nThis 14-page album (including covers) is in fantastic shape, especially considering that it is 132 years old.\n\nThe string binding looks to be original and is intact. \n\nIt doesn't look to have ever been fully opened, because there doesn't look to be any creasing, besides the cover, under the string.\n\nBecause of this, I am only posting scans of the front and back, and a less than great picture of one of the internal pages.\n\nEmail me if you want me to take less than great pictures of the pages with my blackberry.\n\nThe back cover has a small tear on the bottom left corner, which is noticeable in the scan.\n\nOverall the album and all the interior pages are in excellent condition.\n\n$1,800 shipped",
      "post_time": "20200901T16:01:39-06:00",
      "timestamp": "1598997699"
    },
    {
      "post_id": "2024309",
      "post_title": "",
      "post_author_name": "doug.goodman",
      "post_content": "I sold this album on ebay to a guy who was surprised when he received it to find that it didn't contain the actual cards. So I have relisted it on ebay and lowered the price here.\n\nI wish it contained the cards, too.\n\nDoug",
      "post_time": "20201009T14:46:13-06:00",
      "timestamp": "1602276373"
    },
    {
      "post_id": "2445821",
      "post_title": "Available?",
      "post_author_name": "shannonhanson48",
      "post_content": "Hey if this is still available, please let me know. Im a buyer!",
      "post_time": "20240705T17:36:06-06:00",
      "timestamp": "1720222566"
    },
    {
      "post_id": "2445838",
      "post_title": "",
      "post_author_name": "doug.goodman",
      "post_content": "[quote name=\"shannonhanson48\" post=2445821]Hey, if this is still available, please let me know. I'm a buyer![/QUOTE]\n\nNope, long gone, sorry. Good luck in your quest.",
      "post_time": "20240705T19:16:56-06:00",
      "timestamp": "1720228616"
    },
    {
      "post_id": "2445946",
      "post_title": "",
      "post_author_name": "shannonhanson48",
      "post_content": "Thanks so much!",
      "post_time": "20240706T14:21:44-06:00",
      "timestamp": "1720297304"
    }
  ]
}