{
  "id": "68733",
  "forum_id": "4",
  "title": "1880's Baseball Team Cabinet.",
  "author": "Archive",
  "reply_count": 5,
  "view_count": 583,
  "created_date": null,
  "last_reply": "20081001T08:04:00-06:00",
  "posts": [
    {
      "post_id": "373935",
      "post_title": "1880's Baseball Team Cabinet.",
      "post_author_name": "Archive",
      "post_content": "Posted By: Eric\nUp for sale I have an 1880's baseball team Cabinet. The cabinet measures 5 1/4\" (w) by 4 1/4\" (h).\n\nThere are a total of 10 players in the picture. Some of the gentlemen seem to be much older, so this doesn't look like a high school team. Could possibly be a college team or club team? Visible in the picture are baseball bats, baseball caps, and gloves. They are wearing thick quilted pants.\n\n[IMG]http://i282.photobucket.com/albums/kk264/crazylocomerk3/FCVCI/BaseballTeamCabinet3big_front.jpg[/IMG]\n\n\nOn the back of this cabinet is the following photo as well (double bonus!). It shows two gentlemen working. One is sewing socks while the other is polishing boots. Attached to the leg of the table is a sign that states: \"This is our Busy Day\". There is a calender on the wall, but I can't make out the date. There are no electrical plug-ins on the wall and the lamp on the table is an oil lamp. This photo is pre 1900, possibly around the same time. The photo is creased/ripped down the middle (possibly ripped in half and then glued on?).\n\n[IMG]http://i282.photobucket.com/albums/kk264/crazylocomerk3/FCVCI/BaseballTeamCabinet3big_back.jpg[/IMG]\n\nLooking for $99/OBO for this very interesting cabinet by check or MO.\n\nI will also listen to trade offers.  Looking for Tobacco and Caramel cards.\n\nI will ship via USPS first class mail with delivery confirmation.\n\nIf interested email me at: crazylocomerk@yahoo.com\n\nThanks for your interest.",
      "post_time": "20080921T12:45:00-06:00",
      "timestamp": "1222022700"
    },
    {
      "post_id": "373936",
      "post_title": "1880's Baseball Team Cabinet.",
      "post_author_name": "Archive",
      "post_content": "Posted By: Paul S\nReally neat. Probably you've already noticed, but the blond player standing in the rear row right looks like the moustachioed(sp?) gentleman on the rear of the photo (standing). The player in the middle row, kneeling, far left, seems to bear some resemblance to the sitting man on the rear photo. Or, is it just my wanting them to be the same person?",
      "post_time": "20080923T07:03:00-06:00",
      "timestamp": "1222174980"
    },
    {
      "post_id": "373937",
      "post_title": "1880's Baseball Team Cabinet.",
      "post_author_name": "Archive",
      "post_content": "Posted By: Eric\nThanks Paul, and I think you're right.  \n\nThere is definitely a resemblance between the blonde haired, mustached player and the one sewing the socks.\n\nWith the guy shining the shoes, he's got the same hair part and looks to be tall and lanky like the guy in the team photo, so that could be him too.\n\nAnd that would give the sign on the leg of the table \"This is Our Busy Day\" a purpose.",
      "post_time": "20080923T07:53:00-06:00",
      "timestamp": "1222177980"
    },
    {
      "post_id": "373938",
      "post_title": "1880's Baseball Team Cabinet.",
      "post_author_name": "Archive",
      "post_content": "Posted By: Paul S\nGood call Eric.\n\nOn the rear photo, those are a t-square and triangle hanging on the wall above the table. Above them, I don't think that's a calendar -- I enlarged it in Photoshop, there's too many weeks, for one, and it actually appears to be a chart of angles, or somesuch. The table looks like a drafting table, it's really deep. Could be a college/trade-school for draftsmen or engineers. Just a hunch.\n\nIt's not what I collect but good luck selling. A very \"personable\" item.",
      "post_time": "20080923T09:19:00-06:00",
      "timestamp": "1222183140"
    },
    {
      "post_id": "373939",
      "post_title": "1880's Baseball Team Cabinet.",
      "post_author_name": "Archive",
      "post_content": "Posted By: Eric\n\n\nI will also listen to trade offers.  Looking for Tobacco or Caramel cards.",
      "post_time": "20080924T11:53:00-06:00",
      "timestamp": "1222278780"
    },
    {
      "post_id": "373940",
      "post_title": "1880's Baseball Team Cabinet.",
      "post_author_name": "Archive",
      "post_content": "Posted By: Eric\nOne more price drop.  $99/OBO",
      "post_time": "20081001T08:04:00-06:00",
      "timestamp": "1222869840"
    }
  ]
}