{
  "id": "68074",
  "forum_id": "4",
  "title": "Team cabinet card for sale.....SOLD",
  "author": "Archive",
  "reply_count": 7,
  "view_count": 506,
  "created_date": null,
  "last_reply": "20060829T16:52:00-06:00",
  "posts": [
    {
      "post_id": "372175",
      "post_title": "Team cabinet card for sale.....SOLD",
      "post_author_name": "Archive",
      "post_content": "Posted By: ramram\n1884 cabinet card of the Major League Columbus Buckeyes team.  This team was 63 - 39 in 1884 and came in second to the New York Metropolitans.  The players names are written in period ink on the back of the card. The left side is trimmed.  Many of these players are featured throughout the Old Judge series.  SOLD.  \n[IMG]http://home.kc.rr.com/ramram/columbus%202a.JPG[/IMG]",
      "post_time": "20060828T09:24:00-06:00",
      "timestamp": "1156778640"
    },
    {
      "post_id": "372176",
      "post_title": "Team cabinet card for sale.....SOLD",
      "post_author_name": "Archive",
      "post_content": "Posted By: Judge Dred (Fred)\nHoly crap Rob, nice piece.  If you have time could you possibly list the players name to the corresponding numbers, for example: 12 = Cahill, etc.\n\nThanks.",
      "post_time": "20060829T13:12:00-06:00",
      "timestamp": "1156878720"
    },
    {
      "post_id": "372177",
      "post_title": "Team cabinet card for sale.....SOLD",
      "post_author_name": "Archive",
      "post_content": "Posted By: Zach Rice\nI second Fred's statement, what an amazing piece ! As a collector of Columbus, Ohio related pieces I really appreciated you posting the picture of it.\n\nFrom left to right:\n\nFront Row: Frank Moutain and Ed Morris\nMiddle Row: Fred Mann, Tom Brown, Gus Schmelz, Pop Smith, and John Richmond;\nBack Row: Patsy Cahill, Ed Dundon, Fred Carroll, Rudy Kemmler, Jim Field, and Willie Kuehne.",
      "post_time": "20060829T13:20:00-06:00",
      "timestamp": "1156879200"
    },
    {
      "post_id": "372178",
      "post_title": "Team cabinet card for sale.....SOLD",
      "post_author_name": "Archive",
      "post_content": "Posted By: ramram\nI think Zach's got it right.  \n\nWritten on the back of the image -\n\n1 Morris\n2 Mountain\n3 Carroll\n4 Kemmler\n5 Dundon\n6 Brown\n7 Smith\n8 Richmond\n9 Fields\n10 Mann\n11 Kuehne\n12 Cahill\n13 Schmeltz\n\nThe photographer is Pfeifer of Columbus, Ohio\n\nRob M.",
      "post_time": "20060829T13:50:00-06:00",
      "timestamp": "1156881000"
    },
    {
      "post_id": "372179",
      "post_title": "Team cabinet card for sale.....SOLD",
      "post_author_name": "Archive",
      "post_content": "Posted By: ramram\nDo you guys know which of these players were portrayed in the Old Judge set.  I know several of them were but I haven't put a whole list together.\n\nRob M.",
      "post_time": "20060829T13:56:00-06:00",
      "timestamp": "1156881360"
    },
    {
      "post_id": "372180",
      "post_title": "Team cabinet card for sale.....SOLD",
      "post_author_name": "Archive",
      "post_content": "Posted By: Trevor Hocking\nI would have to agree with everone here in saying it is a very nice photo as well.  The players that are in the N172 set are.\n\n1 Morris\n3 Carroll\n4 Kemmler\n7 Smith\n9 Fields\n10 Mann\n11 Kuehne\n12 Cahill\n13 Schmeltz\n\nGreat photo  It would look amaing framed with a complete Columbus Old Judge set!!!",
      "post_time": "20060829T14:41:00-06:00",
      "timestamp": "1156884060"
    },
    {
      "post_id": "372181",
      "post_title": "Team cabinet card for sale.....SOLD",
      "post_author_name": "Archive",
      "post_content": "Posted By: ramram\nKind of an interesting side note - I've also got a very large albumen of this same image (not for sale).  Actually, the image is slightly different.  Most notable is that Kemmler has his arms down, but it was obviously done in the same sitting (I have also seen a third variation of this same sitting some time ago).  The albumen is in its original frame.  The back of the framed picture has slats from a crate.  You can make out the word \"Pittsburg\" on these slats.  Most likely this had something to do with the Columbus team combining with Pittsburg in 1885.\n\nRob M.\n\n[IMG]http://home.kc.rr.com/ramram/columbus%20baseball%201.jpg[/IMG]\n[IMG]http://home.kc.rr.com/ramram/columbus%20baseball%202.jpg[/IMG]",
      "post_time": "20060829T15:23:00-06:00",
      "timestamp": "1156886580"
    },
    {
      "post_id": "372182",
      "post_title": "Team cabinet card for sale.....SOLD",
      "post_author_name": "Archive",
      "post_content": "Posted By: Joe_G.\nRob, great item(s)!, I would be all over it myself if there were a direct connection to my collection.\n\nJust in case you haven't already done so, a little word of caution on the framed piece.  You might want to consider, if you haven't already, placing something safe between the cabinet and the wood backing.  The thin wood slats (usually ~1/8\" thick) can be damaging.  Wood is very acidic and high in lignin, which causes acid burn and staining.  Because it requires light to facilitate the process, the areas around openings and/or knotholes will be darker.  Also the raw edges allow the release of the lignin.  Consequently you get an actual pattern that follows the grain of the wood, including knotholes and seam lines on the back side of the cabinet that can stain all the way through the mount into the picture.\n\nAnd Trevor, what is the best way to get ahold of you these days?, send me an email if you could.\n\nBest Regards,\nJoe Gonsowski\ntwinturbo@comcast.net",
      "post_time": "20060829T16:52:00-06:00",
      "timestamp": "1156891920"
    }
  ]
}