{
  "id": "134205",
  "forum_id": "4",
  "title": "FS: N172 Old Judge and N 300 Mayo Cut Plug",
  "author": "btcarfagno",
  "reply_count": 1,
  "view_count": 428,
  "created_date": null,
  "last_reply": "20110311T06:50:57-06:00",
  "posts": [
    {
      "post_id": "877297",
      "post_title": "FS: N172 Old Judge and N 300 Mayo Cut Plug",
      "post_author_name": "btcarfagno",
      "post_content": "Old Judge\n\nCannonball Crane N.Y. SGC 60 $400\n\nChicken Wolf Louisville SGC 10 $550 (crisp image)\n\nCurt Welch Brown's Champions PSA Auth Crisp image with VG-EX appearance but some back damage $300\n\nLittle Nick Nicoll Brown's Champions PSA Auth small amount oif chipping, image slightly faded, some back damage $200\n\nTip O'Neil Brown's Champions PSA Auth Crisp Image, appears to have possible trimming, some back damage $150\n\nYank Robinson Brown's Champions PSA Auth Chip out of top, front otherwise nice, some back damage $200\n\nChris Von Der Ahe Brown's Champions PSA Auth bottom trimmed to image but crisp image, some back damage $100\n\nBill Gleason Brown's Champions PSA Auth slight image fading but has EX-MT appearance on front, some back damage $300\n\nNat Hudson Brown's Champions PSA Auth slight image fading but has VG-EX appearance on front, some back damage $250\n\nArlie Latham Brown's Champions PSA Auth crisp image, EX-MT appearance on front, some back damage SOLD\n\nRudy Kemler Brown's Champions PSA Auth crisp image, EX-MT appearance on front, some back damage $300\n\nDoc Bushong Brown's Champions PSA Auth crisp image, EX-MT appearance on front, some back damage $300\n\nBob Caruthers Brown's Champions PSA Auth crisp image, VG-EX appearance on front, some back damage SOLD\n\nCharles Comiskey Brown's Champions PSA Auth crisp image, VG-EX appearance on front, some back damage $1,350\n\nDave Foutz Brown's Champions PSA 1.5 crisp image, some chipping at top SOLD\n\n\n\n\nMayo Cut Plug \n\nE.W Cartwright SGC 10 $175\n\nTom Daly SGC 20 $250\n\nDave Foutz SGC $300\n\nJimmy Bannon color touch SOLD\n\nW.W. Hallman color touch $125\n\nYale Murphy SGC 30 $300\n\nPlease PM me or send an email to [url]tom@regalfinancialgroup.com[/url] for scans.\n\nTom C",
      "post_time": "20110310T08:06:46-06:00",
      "timestamp": "1299769606"
    },
    {
      "post_id": "877546",
      "post_title": "",
      "post_author_name": "btcarfagno",
      "post_content": "Some sold...PM's and emails responded to.",
      "post_time": "20110311T06:50:57-06:00",
      "timestamp": "1299851457"
    }
  ]
}