{
  "id": "113473",
  "forum_id": "4",
  "title": "FOR SALE: \"Scrapps\" Near Set (14 of 18)",
  "author": "rhettyeakley",
  "reply_count": 0,
  "view_count": 359,
  "created_date": null,
  "last_reply": "20090622T22:50:18-06:00",
  "posts": [
    {
      "post_id": "731338",
      "post_title": "FOR SALE: \"Scrapps\" Near Set (14 of 18)",
      "post_author_name": "rhettyeakley",
      "post_content": "I have decided to part with my Scrapps near set (including 3 of the 4 HOFers). Over half the cards in this grouping are very presentable with great fronts, however, there are some lower grade cards as well, and one or two fillers. All of these exhibit some evidence of having been in a scrapbook at one point, whether that be glue residue or staining or some glue still present and some do exhibit some paper loss. Those with experience with this set know the extremely thin cardstock and the difficulty in finding even presentable cards. \n\nFront scans are below for all 14 cards in this lot.\n\nThe full Scrapps set is mad up of 18 cards, so the purchaser would only be 4 cards away from a truly tough 19th Century set, and if they are so inclined my brother (Rhys) currently has a nice Sam Thompson on his website [url]www.prewarsports.com[/url] that would only leave 3 cards for completion (Getzein, Rowe, and White).\n\nPrice: Priced to sell at $4000 for the entire group, email me at [url]rhettyeakley@netzero.com[/url]\n\n\nConditions (not counting aforementioned back glue, staining, etc.)\n\nPicture #1 (Nicest Group)\nDan Brouthers (HOF)- Very nice looking card, a nick in the hat area is main drawback\nHardy  Richardson- Great card w/ full mustache (very rare for the issue)\nDoc Bushong- Great card w/ full mustache (very rare for the issue)\nTip O'Neill- Great card\nWater Latham -Great card\nRobert Caruthers- Great card\n\nPicture #2\nCharles Bennett- pretty nice shape (along with Dunlap the nicest of this group)\nFred Dunlap- a little wear, but very presentable\nWiliiam Gleason- some overall wear\nDave Foutz -looks great but some paper loss on back that includes a small portion of front image at area of tie\nNed Hanlon (HOF) -First glance it looks great, but unfortunately the brim of his hat is missing\nCharles Comiskey(HOF) -a few pieces missing at extremeities at bottom (still presentable)\n\nPicture #3\nCurtis Welch -overall wear and tiny piece missing at name\nWm. Robinson -heavy crease (still in one piece but nearly aeperated at neck)\n\n[IMG]http://starsofthediamond.com/scrapps1.JPG[/IMG] [IMG]http://starsofthediamond.com/scrapps2.JPG[/IMG] [IMG]http://starsofthediamond.com/scrapps3.JPG[/IMG]",
      "post_time": "20090622T22:50:18-06:00",
      "timestamp": "1245732618"
    }
  ]
}