{
  "id": "361049",
  "forum_id": "4",
  "title": "SOLD - 1895 Mayo's Cut Plug - Mike Griffin - SGC 4.5 - Truly Pristine",
  "author": "premiercardcollectors",
  "reply_count": 0,
  "view_count": 952,
  "created_date": null,
  "last_reply": "20250512T12:45:38-06:00",
  "posts": [
    {
      "post_id": "2515198",
      "post_title": "SOLD - 1895 Mayo's Cut Plug - Mike Griffin - SGC 4.5 - Truly Pristine",
      "post_author_name": "premiercardcollectors",
      "post_content": "For Sale - A beautifully presented Mayo of Star MLBer Mike Griffin.  Near perfect centering with light edge wear for this issue.\n\nSOLD on Net54 - Thank you\nPayPal, Venmo or Zelle no-fee method.\n\nTons of vouches available\n\n\nPOP 1 - Only 2 cards graded higher by SGC and only 1 higher by PSA.  \n\nThe Mayo’s Cut Plug (N300) baseball set consists of 48 cards measuring 1-5/8” by 2-7/8”, distributed by the Mayo Tobacco Works Company of Richmond, Virginia. This set features 40 different player portraits in either black-and-white or sepia tone printed on black cardboard. Twenty-eight of the players appear in uniform, 12 are wearing suits, or street clothes, and eight can be found with a variation of each. The fronts reveal the photograph of the players with his name, school and the Mayo’s Cut Plug logo and slogan, “For Chewing and Smoking”, at the bottom. Each card is black-backed and unnumbered.\n\nMichael Joseph Griffin (March 20, 1865 – April 10, 1908) was an American Major League Baseball center fielder who was born in Utica, New York. He played in 1,511 games over 12 seasons for teams in the American Association, Players' League, and National League. He had 1,755 hits, resulting in a .296 batting average, and was a prolific base stealer who swiped 473 bases during his career. In his last year in the majors, he was also a player-manager for the Brooklyn Bridegrooms.[1]\n\nMike is Top 50 in lifetime stolen bases, Top 100 in triples, one of few players to score over 100 runs for 10 years straight.   He was a star of his time.\n\nCareer\nWhile playing for the local Utica professional team, Griffin was scouted and signed by Billy Barnie of the Baltimore Orioles. On April 16, 1887, he became the first major league player to hit a home run in his first plate appearance, an honor he shares with George Tebeau, who homered on the exact same day in his first plate appearance (it is unclear which player hit his home run first, chronologically, so both are considered \"the first\"). Griffin went on to become one of the premiere ballplayers of the time, leading his league in runs scored in 1889 and doubles in 1891.\n\nGriffin was team captain of Bridegrooms in 1897 and 1898 and served as interim manager for a part of 1898, a total of four games, winning one. After the 1898 season, Brooklyn signed him to a $3,500 contract to manage the following season. But before the season started, Brooklyn and Baltimore merged, and Baltimore manager Ned Hanlon was named Brooklyn's manager instead. Griffin was offered a $2,800 contract to play by Brooklyn, but he refused to sign. Brooklyn released him to the Cleveland Spiders, who then released him to the St. Louis Perfectos. After failing to receive a contract he felt he was worth from any team, he sued Brooklyn for the salary he believed they owed him from the contract he had signed and won a judgment of $2,300 from the club. He then unofficially retired from major league baseball.\n\nGriffin returned to Utica where he became involved in the management of local breweries. It was there that he died from pneumonia, at age 43, and was buried at St. Agnes Cemetery.",
      "post_time": "20250512T12:45:38-06:00",
      "timestamp": "1747075538"
    }
  ]
}