{
  "id": "309293",
  "forum_id": "4",
  "title": "N184 Tip O’Neil for Sale",
  "author": "rhodeskenm",
  "reply_count": 3,
  "view_count": 416,
  "created_date": null,
  "last_reply": "20211020T15:21:41-06:00",
  "posts": [
    {
      "post_id": "2155236",
      "post_title": "N184 Tip O’Neil for Sale",
      "post_author_name": "rhodeskenm",
      "post_content": "Sold: N184 W.S. Kimball Tip O’Neil SGC 5 is SOLD\n\nPlease email me at [url]rhodeskenm@gmail.com[/url] for pics",
      "post_time": "20211019T04:58:19-06:00",
      "timestamp": "1634641099"
    },
    {
      "post_id": "2155482",
      "post_title": "",
      "post_author_name": "aloondilana",
      "post_content": "Damn that was fast",
      "post_time": "20211019T19:49:11-06:00",
      "timestamp": "1634694551"
    },
    {
      "post_id": "2155649",
      "post_title": "",
      "post_author_name": "rhodeskenm",
      "post_content": "I was going to write something snarky like time waits for no msn or the early bird gets the worm but than I thought about the special conditions of our 19th century hobby. There is a reason things go fast - supply is super low for 19th c cards compared to all other pre war. And small supply is magnified by fact that a handful of major collectors have historically cornered the market on many of the most sought after and rare cards. So when a really nice card for a star like O’Neil comes up, those in the know or those with particular tastes, jump on it, especially if fairly priced. Same deal with players who weren’t so great but are famous for other reasons like Tener and Sunday. They go fast, especially if fairly priced. \n\nThen there are the 200 plus overpriced and less sought after cards that sit forever on ebay or certain dealer sites that don’t move because the cards are overpriced (while it is super hard to scientifically price 19th C cards since there are too few sales to track for up to date  comps vs say all t206s - those who know this market know an overpriced card when they see one. Plus I’ve noticed  most sellers just price high and let inventory sit - some times for years rather than lowering the price.\n\nIn some ways, the 19th C market would make most economists scratch there heads.  Long winded but thought I’d share",
      "post_time": "20211020T12:46:45-06:00",
      "timestamp": "1634755605"
    },
    {
      "post_id": "2155696",
      "post_title": "",
      "post_author_name": "aloondilana",
      "post_content": "I hear that. I thought I was all over it. Of course I also left the \"e\" out after desk in your email address so I get what I deserve :D",
      "post_time": "20211020T15:21:41-06:00",
      "timestamp": "1634764901"
    }
  ]
}