{
  "id": "195268",
  "forum_id": "4",
  "title": "1859 England Cricket Team USA Tour CDV Sold",
  "author": "earlybball",
  "reply_count": 2,
  "view_count": 561,
  "created_date": null,
  "last_reply": "20141012T17:56:23-06:00",
  "posts": [
    {
      "post_id": "1332549",
      "post_title": "1859 England Cricket Team USA Tour CDV Sold",
      "post_author_name": "earlybball",
      "post_content": "1859 England Cricket Team CDV Photograph First Ever North American Tour (Also With Baseball Interest (SOLD)\n\nUp for offer is an original Carte de Visite from the legendary 1859 North American Touring England Touring Cricket Team. This is truly an incredibly important, rare and significant piece of photographic and sports history.\n\nThis original piece is now 155 years and it marks an important part of sports history. On that September day in 1859, the 12 best cricket players in England departed for Canada and the USA on the very first ever overseas tour of any sport. Two months later, the concurring heroes returned undefeated with many of the players cementing their statuses as legends.\n\nThe touring party of 1859 left Liverpool on the SS Nova Scotian on 7 September and returned on 11 November. Its members, in addition to Wisden and John Lillywhite, were the captain George Parr (1826-91), Julius Caesar (1830-78), William Caffyn (1828-1919), Robert Carpenter (1830-1901, Alfred Diver (1824-1876), James Grundy (1824-1873), Tom Hayward (1835-76), John Jackson (1833-1910), Tom Lockyer (1826-1869) and H H (Heathfield Harman) Stephenson (1833-1896), who later led the first private tour by an England XI to Australia in 1861.\n\nFred Lillywhite travelled with his groundside tent and printing press. His role on the tour has been described as that of \"scorer, reporter, and mentor.\n\nThe team won all five official matches against a 22 of Lower Canada (by 8 wickets at Montreal, Quebec on 26 October-27 September), a 22 of the United States (by an innings and 64 runs at Holboken, NY on 3-5 October), a different 22 of the United States (by 7 wickets at Philadelphia on 10-12 October), a 22 of Lower Canada (by 10 wickets at Hamilton, Ontario on 17-19 October) and a further 22 of the United States (by an innings and 68 runs at Rochester, NY on 21-25 October).\n\nThe tour was also notable for its inclusion of exhibition baseball games, one of which took place on the 22nd of October at Elysian Fields, Hoboken New York. Harry & Sam Wright (also Hammond) played in the series.\n\nAlong with the original sepia toned CDV scans, I have also included some scans (the black and white images) from Lillywhite's detailed book account of the tour, The English Cricketers' Trip to Canada and the United States, which was published in 1860. To accompany the original 1859 CDV, I will throw in the reprinted version (1980) of this book to give the winner plenty of information about this historic tour and important photographic image. \n\nAPPROXIMATE SIZE:  2 3/8 X 3 7/8. CONDITION: Very good condition with excellent contrast and no damage. PHOTOGRAPHER & SITTER: Noted on reverse in period ink \"284\". \n\nSOLD",
      "post_time": "20141010T15:08:09-06:00",
      "timestamp": "1412975289"
    },
    {
      "post_id": "1333045",
      "post_title": "1859 english cdv cricket team",
      "post_author_name": "SilverBall67",
      "post_content": "An absolutely stunning CDV.  Quite possibly these players tangled with Harry and Harry wright Sr., at one Stretch.  Not certain how you're establishing price, appears it would be valued higher.  Nonetheless, a historically significant piece of Cricketdom!",
      "post_time": "20141012T08:00:58-06:00",
      "timestamp": "1413122458"
    },
    {
      "post_id": "1333219",
      "post_title": "Cdv",
      "post_author_name": "earlybball",
      "post_content": "Thank you SilverBall! SOLD",
      "post_time": "20141012T17:56:23-06:00",
      "timestamp": "1413158183"
    }
  ]
}