{
  "id": "118902",
  "forum_id": "4",
  "title": "IMPORTANT UPDATE! FT: N172 Gore (Horizontal) and Mann",
  "author": "Jason Carota",
  "reply_count": 8,
  "view_count": 889,
  "created_date": null,
  "last_reply": "20091230T19:34:27-06:00",
  "posts": [
    {
      "post_id": "769499",
      "post_title": "IMPORTANT UPDATE! FT: N172 Gore (Horizontal) and Mann",
      "post_author_name": "Jason Carota",
      "post_content": "UPDATE:\n\nUpon further research, I have found a few more players born in MA.  However, one in particular is now on the top of my list.  That player is:\n\n- Richard \"Dick\" Conway (Boston or Worcester)\n\nConway was born in my hometown of Lowell, MA, so I would love to add this card to my collection.\n\nOriginal Post:\n\nI have decided to add a little twist to my N172 collection.  Along with acquiring one card per team, I would like each card to feature a Massachusetts born player.\n\nAfter some very quick research, the following players were born in MA:\n\nWilliam \"Bill\" Perley Annis (Omaha or Worcester)\nWarren William \"Hick\" Carpenter (Cincinnati)\nRichard \"Dick\" Conway\" (Boston)\nJames B. \"Chippy\" McGarr (St. Louis or K.C.)\nPatrick J. \"Pat\" Murphy (N.Y.)\n\nAs always, I'm looking for low grade examples.\n\nUp for trade are the following:\n\n[IMG]http://i139.photobucket.com/albums/q319/jay1065/N172%20Old%20Judge/n172_nyg_nl_gore.jpg[/IMG]\n\n[IMG]http://i139.photobucket.com/albums/q319/jay1065/N172%20Old%20Judge/n172_stl_browns_mann.jpg[/IMG]\n\nThanks for looking!\n\n[url]jason_carota@comcast.net[/url]",
      "post_time": "20091221T18:25:33-06:00",
      "timestamp": "1261445133"
    },
    {
      "post_id": "771330",
      "post_title": "",
      "post_author_name": "Jason Carota",
      "post_content": "Bump for an important (in my mind :) ) update.",
      "post_time": "20091230T08:52:18-06:00",
      "timestamp": "1262188338"
    },
    {
      "post_id": "771391",
      "post_title": "",
      "post_author_name": "rhettyeakley",
      "post_content": "Jason, if you are into Mass. guys you might think about Harry Stovey. He wasn't born in Mass. but he bagan his career in Worchester & called New Bedford his home from a fairly early point and eventually became a police officer, etc. there after his ballplaying days were over.",
      "post_time": "20091230T13:00:20-06:00",
      "timestamp": "1262203220"
    },
    {
      "post_id": "771426",
      "post_title": "",
      "post_author_name": "NewEnglandBaseBallist",
      "post_content": "Stovey -\n\n[IMG]http://photos.imageevent.com/ajbaxter/baseball/websize/Stovey.jpg[/IMG]",
      "post_time": "20091230T15:05:12-06:00",
      "timestamp": "1262210712"
    },
    {
      "post_id": "771429",
      "post_title": "",
      "post_author_name": "NewEnglandBaseBallist",
      "post_content": "Don't forget Fall River native and N172 alumni - Charlie Buffinton (Buffington)",
      "post_time": "20091230T15:13:03-06:00",
      "timestamp": "1262211183"
    },
    {
      "post_id": "771449",
      "post_title": "Build A Database",
      "post_author_name": "kkkkandp",
      "post_content": "Jason:\n\nYou can build a complete database by going to baseball-reference.com.\n\nUse Dick Conway as your starting point. On his player page you will see that the state of his birth is a blue link. Click on it and you'll get all the major league players born in Massachusetts. Below the list you will see a red link labeled \"CSV.\" If you click on that, the list above will turn from HTML format into a list of comma separated values. You can copy the whole list, save it as a .TXT file and then import it into an Excel spreadsheet where you can sort out all the players who are outside the date range where they might have appeared on an Old Judge card. From there you can just compare your spreadsheet list to any complete list of Old Judge players to come up with your Old Judge Massachusetts universe. \n\nJust be aware there are separate lists on baseball-reference.com for players, pitchers and managers. While there is often a lot of overlap, it is not 100%, so you need to look at all three lists to come up with a single complete one.\n\nKevin",
      "post_time": "20091230T15:59:48-06:00",
      "timestamp": "1262213988"
    },
    {
      "post_id": "771501",
      "post_title": "",
      "post_author_name": "Fred",
      "post_content": "Keep your eyes open, you may find a Stovey on the BST like the one shown below :):p:D :  \n\n\n\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=11651&d=1262221098[/IMG]",
      "post_time": "20091230T18:00:23-06:00",
      "timestamp": "1262221223"
    },
    {
      "post_id": "771536",
      "post_title": "",
      "post_author_name": "Jason Carota",
      "post_content": "Thanks for all the replies, everyone!  I'm trying to keep the project as focused as possible.  That means Stovey stays off the checklist, unfortunately.\n\nAdam:\n\nI have Buffington on my list.  Thanks, however.\n\nKevin:\n\nGreat post.  I am making a DB as I go along using baseball-reference.com, baseball-almanac.com and my N172 checklists.",
      "post_time": "20091230T19:19:02-06:00",
      "timestamp": "1262225942"
    },
    {
      "post_id": "771543",
      "post_title": "My NJ List",
      "post_author_name": "kkkkandp",
      "post_content": "Jason:\n\nI have a similar subset of New Jersey Old Judge players/managers/umpires, but mine includes those that died in New Jersey as well. I suspect you are going to find you have quite a few Massachusetts players to acquire including a few HOFers.\n\nFrom my original list of 29 I am down to needing only two to complete my subset - Buster Hoover and Frank Hankinson (who died in my hometown of Palisades Park).\n\nCan anyone help a brother out? :)\n\nKevin",
      "post_time": "20091230T19:34:27-06:00",
      "timestamp": "1262226867"
    }
  ]
}