{
  "id": "68583",
  "forum_id": "4",
  "title": "Sarasota condo (use in trade for vintage cards)",
  "author": "Archive",
  "reply_count": 1,
  "view_count": 446,
  "created_date": null,
  "last_reply": "20080418T21:18:00-06:00",
  "posts": [
    {
      "post_id": "373524",
      "post_title": "Sarasota condo (use in trade for vintage cards)",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dan Paradis\nI've been contemplating this for the last couple of days while sitting here reviewing the REA and Mastro catalogs at Siesta Key Beach in FL (my wife was a little upset when she discovered I snuck the catalogs in her luggage!).\n\nI willing to trade use of my condo to N54 members in exchange of vintage baseball cards and/or sports memorabilia.  \n\nThe condo is in Sarasota, FL (west coast).  We are 12 miles from Siesta Key Beach (one of the nicest beaches in FL).  We are about 1 1/2 hours from Orlando.  The condo is 3 bedrooms, 2 full baths (one with whirlpool), large FR, patio & 2 car garage.  Internet PC, all beach supplies, TV's, inground pools, walking trails, public golf courses and more.\n\nThe condo is in a wooded, ELDERLY area (very quiet).  It is not a place to party (although my college son tested that a couple of months ago).  \n\nIt is available year round (for any length of time).  Just to give you an idea condo's in our area go for around $3,200/month during peak season (about 1/2 that off-season).  \n\nI would require at least 2 N54 references prior to approval.\n\nI collect HOF RC's.  Although I have many of them, I'm always looking to upgrade or even collect other vintage cards of HOF'ers.  I'd also be interested in vintage sports memorabilia (especially Nap Lajoie).\n\nI'm not sure this idea will go anywhere. I thought instead of having this place sit here for 48 weeks of the year maybe I can get some cards and/or memorabilia in exchange.\n\nIf you are interested you can email me at: danp306@gmail.com or call me at: (860) 384-9153.  I'm willing to listen to any offers.\n\nDan",
      "post_time": "20080418T20:03:00-06:00",
      "timestamp": "1208570580"
    },
    {
      "post_id": "373525",
      "post_title": "Sarasota condo (use in trade for vintage cards)",
      "post_author_name": "Archive",
      "post_content": "Posted By: ramram\nNow that's thinking outside the box!!\n\nHmmm...now that's got me thinking.....my wife just sits here about 48 weeks out of the year....I wonder what she's worth in trade...\n\nRob M.",
      "post_time": "20080418T21:18:00-06:00",
      "timestamp": "1208575080"
    }
  ]
}