{
  "id": "280441",
  "forum_id": "4",
  "title": "FS 1894 Philadelphia Phillies Cabinet - Schedule Back - Delahanty, Thompson, Hamilton",
  "author": "rholmes",
  "reply_count": 1,
  "view_count": 551,
  "created_date": null,
  "last_reply": "20200317T14:17:09-06:00",
  "posts": [
    {
      "post_id": "1962562",
      "post_title": "FS 1894 Philadelphia Phillies Cabinet - Schedule Back - Delahanty, Thompson, Hamilton",
      "post_author_name": "rholmes",
      "post_content": "FS: Cabinet-style card depicting the 1894 Philadelphia Phillies with the HOF outfield of Ed Delahanty, Sam Thompson, and Billy Hamilton. \n\n$SOLD\n\nSize of the piece is 4.5” x 6” and has the 1894 Phillies season schedule printed on the reverse. Photos on the front are by Gilbert & Bacon…half-tone printed, I believe (photos have dots at high resolution).\n\nLittle to nothing is known about this cabinet. Some time after I acquired it (directly from a relative of Sam Thompson) I asked around to quite a few knowledgeable hobby sources and auction houses and no-one had ever seen it before outside of a few copies that reside in the Spalding collection at NYPL. You can see the copies at the NYPL by searching their digital collection. The copy I have is an exact match to theirs in size and printing method. \n\nCondition is overall very good (that’s just an aesthetic assessment on my part and not an indication of any kind of grade it might get from PSA etc). A few points:\n\n- There are a couple of stains, corner bumps, and light chips off the top layer at corners, all of which can be see in scans. \n- There are 2 pinholes, one each in the margin/center at top and bottom. \n- The portraits are each numbered with live ink.\n- What looks to possibly be the name “Macher” is written in ink on the reverse. There was a printer/lithographer with the name Macher in Philadelphia at the time this card would have been made, so maybe there is some connection there.\n\nPlease email with requests for larger scans if needed. And feel free to chime in with any info on this piece, if known!\n\nThe scan of the Philly letterhead below isn’t mine, but it’s interesting as it is dated 1894 and uses some of the same font as the cabinet card (Philadelphia Ball Club, on reverse). Certainly possible the piece for sale was issued by the team.\n\nThanks,\nRay \n\nEmail: semloh00 (at) yahoo.com\n\n[url=https://ibb.co/RPp2y4H][img]https://i.ibb.co/5vWTFxc/1894-Phila-sm-copy.jpg[/img][/url]\n\n[url=https://ibb.co/GTKbvnY][img]https://i.ibb.co/PQ7fZFX/1894-Phila-det-sm-copy.jpg[/img][/url]\n\n[url=https://ibb.co/WtKKt6z][img]https://i.ibb.co/2NKKNyM/1894-Rogers-TLS-89129-1-crop-sm.jpg[/img][/url]",
      "post_time": "20200316T16:21:33-06:00",
      "timestamp": "1584397293"
    },
    {
      "post_id": "1962768",
      "post_title": "",
      "post_author_name": "Dardevl",
      "post_content": "Nice!!!",
      "post_time": "20200317T14:17:09-06:00",
      "timestamp": "1584476229"
    }
  ]
}