{
  "id": "123001",
  "forum_id": "4",
  "title": "Old Judge and Dogs Head Cigarette Packs For Sale",
  "author": "canjond",
  "reply_count": 10,
  "view_count": 1015,
  "created_date": null,
  "last_reply": "20100429T12:17:32-06:00",
  "posts": [
    {
      "post_id": "801962",
      "post_title": "Old Judge and Dogs Head Cigarette Packs For Sale",
      "post_author_name": "canjond",
      "post_content": "Extremely scarce Dog's Head cigarette pack with inner slide.  Even better, this pack has an 1889 overprint on the tax stamp, dating it to the N173 time frame.  You rarely, if ever, see these available for sale.  Condition of this box is F-G... the top flap on the inner slide is missing and there is some cardboard loss around the top on both sides.  Graphics are flawless and there is no writing on the box at all.  On my website, I value these packs at $550.00.  I have priced this one at $400.00 shipped.\n\n[IMG]http://i82.photobucket.com/albums/j263/jon_canfield/DSC_0261.jpg[/IMG][IMG]http://i82.photobucket.com/albums/j263/jon_canfield/DSC_0262.jpg[/IMG][IMG]http://i82.photobucket.com/albums/j263/jon_canfield/DSC_0264.jpg[/IMG][IMG]http://i82.photobucket.com/albums/j263/jon_canfield/DSC_0263.jpg[/IMG]\n\n\nNot as scarce as the Dogs Head but equally desirable, I have an Old Judge outer shell for sale.  There is no tax stamp present but likely dates to the 1880s.  Condition, overall, is good.  It appears that the pack was split or partially split along a seam on the back and repaired.  However, the box is completely intact in its current state.  The graphics are bold.  As mentioned above, the inner slide is missing but the price more than reflects this.  $130.00 shipped.\n\n[IMG]http://i82.photobucket.com/albums/j263/jon_canfield/DSC_0265.jpg[/IMG][IMG]http://i82.photobucket.com/albums/j263/jon_canfield/DSC_0266.jpg[/IMG]\n\n\nIf someone is interested in both the Dogs Head and the Old Judge, I would do $470.00 shipped on the pair.",
      "post_time": "20100422T06:43:19-06:00",
      "timestamp": "1271940199"
    },
    {
      "post_id": "803002",
      "post_title": "",
      "post_author_name": "canjond",
      "post_content": "Bump for addition of the Old Judge pack.",
      "post_time": "20100426T18:23:13-06:00",
      "timestamp": "1272327793"
    },
    {
      "post_id": "803338",
      "post_title": "Jon C",
      "post_author_name": "tedzan",
      "post_content": "In your opinion, did this OJ pack possibly contain N172 cards, or N162 cards, or what ?\nAlso, what info (if any) is printed on the sides of this pack ?\n\nIn any event, I am interested in the OJ pack.\n\nEmail sent.\n\n\nAnd, I received the PIRATE cigarettes pack.\n\nThanks,\n\nTED Z",
      "post_time": "20100428T06:28:46-06:00",
      "timestamp": "1272457726"
    },
    {
      "post_id": "803416",
      "post_title": "Ted",
      "post_author_name": "Leon",
      "post_content": "[quote name=\"tedzan\" post=803338]In your opinion, did this OJ pack possibly contain N172 cards, or N162 cards, or what ?\nAlso, what info (if any) is printed on the sides of this pack ?\n \nIn any event, I am interested in the OJ pack.\n \nEmail sent.\n \n \nAnd, I received the PIRATE cigarettes pack.\n \nThanks,\n \nTED Z[/quote]\n \nJon knows quite a bit more about packs than I do but the Old Judge pack shown would have been one for N172's, of course depending what date it is, but it is the same exact type.  regards",
      "post_time": "20100428T13:53:54-06:00",
      "timestamp": "1272484434"
    },
    {
      "post_id": "803454",
      "post_title": "",
      "post_author_name": "Joe_G.",
      "post_content": "IMO, I don't believe that pack contained baseball cards.  That OJ pack appears to have been exported outside the US.  During the N172 era, these packs did often include cards of actresses, royalty, and even sports figures (boxers for example), but likely didn't include baseball cards.  I believe baseball cards were distributed throughout the US in packs that had nothing more than a tax stamp on back (no export notice).\n\nPerhaps Jay will chime in.",
      "post_time": "20100428T16:49:11-06:00",
      "timestamp": "1272494951"
    },
    {
      "post_id": "803469",
      "post_title": "Joe G",
      "post_author_name": "tedzan",
      "post_content": "I certainly defer to you regarding Old Judge's (N172). Anyhow, when I noted the lettering \"Packed in our Star Tin Foil\n Expressly for Export Trade\".....it reminded me of a bunch of N162 cards that I acquired from a fellow in England years\n ago. He told me that these cards were in his family's collection for 102 years. \n\nThe Goodwin Champions are my favorite cards, and I have put together 3.5 sets (177 cards) of these beautiful litho-\ngraphs. Therefore, it could be possible that N162 cards were inserted in such an OJ pack (circa 1888-1889). \n\n\nTED Z",
      "post_time": "20100428T18:00:02-06:00",
      "timestamp": "1272499202"
    },
    {
      "post_id": "803472",
      "post_title": "",
      "post_author_name": "canjond",
      "post_content": "Ted - sent you an email answering your questions.  However, also wanted to add some here, too.  In terms of dating, I comfortably believe this pack dates to the 1885-1890 time frame.  After 1890, Duke acquired Goodwin.  Also, the factory and district numbers are not printed on the box, itself.  I have never seen an OJ with the factory/district on the box, but rather it appears on the tax stamp.  Also, as per Joe's comment, I believe the pack was used in the export trade as well.  Interestingly enough, however, Ted informed me that he has purchased quantities of N162s out of England.  (Correct me if I'm wrong Ted).  Of course, even with that said, I couldn't speculate as to whether this once held a card - especially without the tax stamp (assuming US distribution).",
      "post_time": "20100428T18:03:59-06:00",
      "timestamp": "1272499439"
    },
    {
      "post_id": "803473",
      "post_title": "",
      "post_author_name": "canjond",
      "post_content": "[quote name=\"Leon\" post=803416]Jon knows quite a bit more about packs than I do but the Old Judge pack shown would have been one for N172's, of course depending what date it is, but it is the same exact type.  regards[/QUOTE]\n\nAnd yes - the pack is same size and design as all other OJs I own and have handled.",
      "post_time": "20100428T18:05:24-06:00",
      "timestamp": "1272499524"
    },
    {
      "post_id": "803532",
      "post_title": "",
      "post_author_name": "Joe_G.",
      "post_content": "Interesting information on the N162s.  I wonder why photographic baseball cards (N172, N175, N173) didn't follow the N162 lead.  Then again, perhaps they did in limited numbers.  120+ year old proof can be hard to come by.\n\nNice pack Jon, good luck with it (& congrats to Ted if you obtain it).",
      "post_time": "20100428T22:28:58-06:00",
      "timestamp": "1272515338"
    },
    {
      "post_id": "803553",
      "post_title": "Joe and Jon",
      "post_author_name": "tedzan",
      "post_content": "Can we get Jay's input on this subject ?\n\nI'm curious if Jay has any record of acquiring Old Judges (N172's or Goodwin's) from outside the USA ?\n\n\nThanks,\n\nTED Z",
      "post_time": "20100429T06:49:49-06:00",
      "timestamp": "1272545389"
    },
    {
      "post_id": "803615",
      "post_title": "",
      "post_author_name": "canjond",
      "post_content": "The OJ pack is now sold...",
      "post_time": "20100429T12:17:32-06:00",
      "timestamp": "1272565052"
    }
  ]
}