{
  "id": "245000",
  "forum_id": "4",
  "title": "1885 Chicago White Stockings Cabinet",
  "author": "pencil1974",
  "reply_count": 5,
  "view_count": 744,
  "created_date": null,
  "last_reply": "20170919T06:08:32-06:00",
  "posts": [
    {
      "post_id": "1701692",
      "post_title": "1885 Chicago White Stockings Cabinet",
      "post_author_name": "pencil1974",
      "post_content": "Bought this off Henry Yee but made a big purchase (not a card, it has 440hp). This has HOFer's Cap Anson, Mike King Kelly and John Clarkson. Others include Silver Flint, Jim McCormick & Billy Sunday. This team is considered one of the best in baseball even now. Great piece!\n\nTwo other other examples similar to this this sold for 10K for just the photo and another with the mount that was very nice sold for 20K. \n\nMine also comes with a full edition of the October 1885 Harpers Weekly that it was used for. Beautiful piece.\n\nI'm going in the middle of the two at $15,000 obo, Friends and Family or add 3% to regular PayPal delivered.",
      "post_time": "20170916T14:32:04-06:00",
      "timestamp": "1505593924"
    },
    {
      "post_id": "1702049",
      "post_title": "",
      "post_author_name": "Fred",
      "post_content": "Cool, this looks the picture where the Anson in uniform N172 originated.",
      "post_time": "20170917T18:47:43-06:00",
      "timestamp": "1505695663"
    },
    {
      "post_id": "1702294",
      "post_title": "",
      "post_author_name": "pencil1974",
      "post_content": "I heard that too but can't say for sure. I like this is the only one I've seen with McCormick which he was added later as why he is not looking the same way as everyone.",
      "post_time": "20170918T16:26:53-06:00",
      "timestamp": "1505773613"
    },
    {
      "post_id": "1702313",
      "post_title": "",
      "post_author_name": "Bicem",
      "post_content": "They did a really good job of adding him.",
      "post_time": "20170918T17:15:31-06:00",
      "timestamp": "1505776531"
    },
    {
      "post_id": "1702315",
      "post_title": "",
      "post_author_name": "pencil1974",
      "post_content": "Yeah they did. I have only seen the others without him, but as I mentioned I liked this because of the use that pretty much dates it to an exact time frame of when it was done. \n\nEven in the woodcut you can see it was added in the same was he was added in the photo so you know it had to be used for it. Now being artist they did add a few things that are not in the photo but just adding text on a jersey, that type of stuff. Very unique for sure.",
      "post_time": "20170918T17:42:34-06:00",
      "timestamp": "1505778154"
    },
    {
      "post_id": "1702397",
      "post_title": "",
      "post_author_name": "deltaarnet",
      "post_content": "Gorgeous!",
      "post_time": "20170919T06:08:32-06:00",
      "timestamp": "1505822912"
    }
  ]
}