{
  "id": "246819",
  "forum_id": "4",
  "title": "WTB: 19th century Iowa baseball",
  "author": "chlankf",
  "reply_count": 3,
  "view_count": 368,
  "created_date": null,
  "last_reply": "20171030T17:46:09-06:00",
  "posts": [
    {
      "post_id": "1714945",
      "post_title": "WTB: 19th century Iowa baseball",
      "post_author_name": "chlankf",
      "post_content": "Hello all.  Its been almost 10 years since I've been here but I haven't given up my quest.  I am still searching for Old Judges of Des Moines and Sioux City.  Looking for all variations/poses including cards of players in Des Moines uniforms listed as playing for another team.  Also in search of cabinets or imperials or any Iowa teams.  Help me out old friends.  Thanks Craig.",
      "post_time": "20171029T08:52:14-06:00",
      "timestamp": "1509288734"
    },
    {
      "post_id": "1715006",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Craig-There are a few nice cabinets in REA that have yet to receive a bid.\n\nJay",
      "post_time": "20171029T11:20:12-06:00",
      "timestamp": "1509297612"
    },
    {
      "post_id": "1715100",
      "post_title": "",
      "post_author_name": "chlankf",
      "post_content": "Saw both of them and they are really interesting.  The one with the game in the background has me ever more baffled.  The photographer is LaRoche.  I have seen 2 other cabinets by him with the same photo included in the design.  I own a cabinet from Boyd that also included the exact same game photo.  Compounding the issue is that the Boyd studio was sold to LaRoche in early 1888 and sold back to Boyd in late 1888.  Who plagiarized who.  Mystery has been perplexing me for over 10 years.  I contacted the LaRoche school of photography and they were very upset and thought I was accusing their namesake of wrongdoing.  I am hoping these 2 don't sell and I get a shot at them for a little less in near future.",
      "post_time": "20171029T16:29:34-06:00",
      "timestamp": "1509316174"
    },
    {
      "post_id": "1715524",
      "post_title": "",
      "post_author_name": "jpop43",
      "post_content": "I have a really nice cabinet card of a player from Ottumwa, Iowa...any interest, just shoot me a PM:\n\n[url]http://dugouttreasures.com/productDetail.cfm?sID=9&prodID=324[/url]",
      "post_time": "20171030T17:46:09-06:00",
      "timestamp": "1509407169"
    }
  ]
}