{
  "id": "140359",
  "forum_id": "4",
  "title": "FS or FT N284 Buchner Gold Coin Prices Reduced",
  "author": "t213",
  "reply_count": 1,
  "view_count": 343,
  "created_date": null,
  "last_reply": "20110813T09:57:51-06:00",
  "posts": [
    {
      "post_id": "916020",
      "post_title": "FS or FT N284 Buchner Gold Coin Prices Reduced",
      "post_author_name": "t213",
      "post_content": "FS or FT. Prices include shipping. My wantlist is below. Thanks, Andy\n\nN284 Crane Washington SOLD\nN284 Myers Washington WAS $110 NOW $95\nN284 Richardson Detroit WAS $140 NOW $125\n\nOr, I'd swap these for anything on this list (I'm pretty flexible on condition):\n1920 Zeenut LA-Aldridge Brown KCrandall Crawford Ellis Hanigy Keating Oak-RArlett Howard Miller Mitchell Wilie Winn Portland-Baker Blue Cox Johnson Jones Juney Kingdon McCredie Maisel Ross Schaller Siglin Spranger Sutherland Wisterzill Sac-Larkin Penner Schang Salt Lake-Matterson Mulligan Reilly SF-Caveney Connolly Koerner McQuaid Seaton Walsh Yelle Seattle-all Vernon-DeVormer Edington Fromme High Hill Long Morse Smith\n\n1932  Zeenut Hollywood-Quellich : Oak-Walsh : Sac-DeViveiros, Vinci\n\nN172 Old Judge Boyce, Zinn (nice picture and caption, don’t care about back damage)\nT204 all low grade\nT210-4 through T210-8 \nT212-1  all\nT212-2  (no paperloss please) Ames Baker Berry Boardman Cartwright Flanagan Griffin Hickey Knapp Mitze Moser Ort Perry Rockenfield Shea Shinn\nT212-3 (no paperloss please) LA: Abbott Akin Criger Daley Delhi Delmas Dillon Grindle Howard HSmith Thorsen Tozer Wheeler Portland: Bloomfield Casey Garrett Harris Mensor Mundorff Speas Stovall\nT216, T217, T330-2 all\nD303 General Baking, E270, 1928 PCL Exhibits all",
      "post_time": "20110811T13:38:29-06:00",
      "timestamp": "1313091509"
    },
    {
      "post_id": "916607",
      "post_title": "",
      "post_author_name": "t213",
      "post_content": "bump for priced reduction",
      "post_time": "20110813T09:57:51-06:00",
      "timestamp": "1313251071"
    }
  ]
}