{
  "id": "134266",
  "forum_id": "4",
  "title": "$75 for 1872 Base Ball letter",
  "author": "ramram",
  "reply_count": 1,
  "view_count": 599,
  "created_date": null,
  "last_reply": "20110319T02:22:18-06:00",
  "posts": [
    {
      "post_id": "877684",
      "post_title": "$75 for 1872 Base Ball letter",
      "post_author_name": "ramram",
      "post_content": "Four page letter, written in ink, from Frank Bidwell in Collinsville, Connecticut to his cousin Daniel Dyer in East Hampton, Massachusetts (includes cover envelope).  Letter contains a great deal of content about the teams from around the Hartford, Connecticut area.  With some editing to his phonetic writing.  Asking $75 shipped.\n\nRob M.\n\n\n\nCollinsville  Sept. 1872\n\n\nCousin Dan I must tell you all about the ball game the Robin Hood BBC of Collinsville played with the 2nd Eagles BBC on A.O. Mills Ground.  They were tied in the ninth inning and they played the tenth inning.  The ninth inning they were [tied at] 26 and the tenth inning the Eagle BBC was 29 and the Robin Hood was 27.  The Eagles won the ball by 2 tallies.  Last Tuesday the Grant BBC played with the first nine of the Eagles.  Collinsville won the ball by 16 or 17 tallies.  This week Tuesday the Grant BBC are a goin to play with the Escort of Hartford.  They are a goin to play [at] A.O. Mills Grounds.  Saturday the Grants are a goin to play with the Plainville BBC on A.O. Mills Ground.  The 21st of this month the Grants play with the Hartford of Hartford.  They are a goin to play in Hartford.  And that is all that I can think of now.  \n\nFlorence is feeling about as usual.  She is not any worse.  I heard the other night that John was afraid to work with Joe.  I hear that Joe[‘s] time is out in about 1 ½ months.  I have got work enough to stand me for a while.  When that Chaplin does not have work I can go to work for Capt. Hough in the box shop.  And that is all that I can think of now.  It[s] [al]most time to go [to] the shop.  \n\nFrom your Cousin Frank.\n\nFrank Bidwell \nCollinsville\nConn.\n\nAns[wer] as quick as possible.\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=34538&d=1299892513[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=34539&d=1299892520[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=34540&d=1299892525[/IMG]",
      "post_time": "20110311T18:17:12-06:00",
      "timestamp": "1299892632"
    },
    {
      "post_id": "879511",
      "post_title": "Price reduced to $75.",
      "post_author_name": "ramram",
      "post_content": "Price reduced to $75. \n\nRob M.",
      "post_time": "20110319T02:22:18-06:00",
      "timestamp": "1300522938"
    }
  ]
}