{
  "id": "351001",
  "forum_id": "4",
  "title": "1889 Allen & Ginter Champions N43",
  "author": "shakes",
  "reply_count": 9,
  "view_count": 1718,
  "created_date": null,
  "last_reply": "20240729T16:12:00-06:00",
  "posts": [
    {
      "post_id": "2445738",
      "post_title": "1889 Allen & Ginter Champions N43",
      "post_author_name": "shakes",
      "post_content": "Hello, I am a new member, and I am on the search for two particular N43 cards: Billy Edwards (Pugilist) and Willie Harradon (cyclist).  I am willing to pay fair value for them, or if someone prefers, we could trade. I have Old Judge, Double-Folders, E120's, W551's, Goudey's, T206's and other assorted vintage Topps's baseball cards available as trade.  If you have a Billy Edwards or Willie Harradon N43, I would love to know!  Thanks.",
      "post_time": "20240705T10:23:52-06:00",
      "timestamp": "1720196632"
    },
    {
      "post_id": "2445776",
      "post_title": "welcome",
      "post_author_name": "NiceDocter",
      "post_content": "Welcome to the best advanced trading card site on the planet! Hope you have success in finding the cards you need..... you have come to the right place.  Rocky PS also a great place to sell if you are \"reasonable\" in your pricing... beats eBay by a mile.",
      "post_time": "20240705T13:21:49-06:00",
      "timestamp": "1720207309"
    },
    {
      "post_id": "2445887",
      "post_title": "",
      "post_author_name": "shakes",
      "post_content": "Thanks for the welcome Rocky. I'm hoping someone here is as into N43's as I am.  Anybody out there?",
      "post_time": "20240706T06:33:13-06:00",
      "timestamp": "1720269193"
    },
    {
      "post_id": "2446953",
      "post_title": "",
      "post_author_name": "shakes",
      "post_content": "So am I the only N43 nut in this group?  For my money, they're the best 1800's set ever issued.  Just the level of artistry and the quality of the card stock. Do you agree? \n\nIf you have any N43's, I'd love to hear how many you have, and which is your highest graded (literally, or just in your opinion).\n\nBilly Edwards still eludes me, but that's ok.  Can't win em' all.",
      "post_time": "20240710T13:05:26-06:00",
      "timestamp": "1720638326"
    },
    {
      "post_id": "2447177",
      "post_title": "well",
      "post_author_name": "1880nonsports",
      "post_content": "you are likely to get responses on a posting in the main section rather than the BST. I have a complete set - I agree that they are great cards!",
      "post_time": "20240711T11:11:39-06:00",
      "timestamp": "1720717899"
    },
    {
      "post_id": "2447217",
      "post_title": "",
      "post_author_name": "autograf",
      "post_content": "I love the N43's.  I've only got 12-15 of them and neither of the two you're looking for.  Many, if not most, of the oversized Allen & Ginter cards are equally amazing.  The Birds of America are my favorite set of the N35-N44 group due to the incredible lithography.  The N35 Editors, N36 Indians and N43 Champions are tied for a close 2nd moreso due to the subjects but still love them all!",
      "post_time": "20240711T13:26:41-06:00",
      "timestamp": "1720726001"
    },
    {
      "post_id": "2447650",
      "post_title": "",
      "post_author_name": "shakes",
      "post_content": "You know, you're right Tom.  I see that I'm just obsessed with the N43's at the moment.  But perhaps the most excited I was about a card (two, actually) this year was when I came across 1909 T29 ANIMALS. I purchased an entire lot of random cards just to get them, since they were in such great shape. LION & LIONESS and TIGER.\n\nThey're currently at PSA, graded, and awaiting release.  I'm excited to see the verdicts, as I feel they have a shot at being the highest ever rated.  But perhaps I'm just dreaming. \n\nFrom the digging I did when I first discovered them, they seem quite rare, but that was just my conclusion after doing a cursory online search for them. \n\nSo, yes, I agree with you.  The animal cards from the Victorian period are special indeed.",
      "post_time": "20240713T16:40:03-06:00",
      "timestamp": "1720910403"
    },
    {
      "post_id": "2450921",
      "post_title": "",
      "post_author_name": "shakes",
      "post_content": "Hi Tom, I just received some PSA'd cards today and wanted to share images of two T29 Animals cards with you.  But when I try to attach a jpeg, I get \"Upload of file failed.\"  Please advise, thanks!",
      "post_time": "20240729T12:25:29-06:00",
      "timestamp": "1722277529"
    },
    {
      "post_id": "2450922",
      "post_title": "",
      "post_author_name": "G1911",
      "post_content": "[quote name=\"shakes\" post=2450921]Hi Tom, I just received some PSA'd cards today and wanted to share images of two T29 Animals cards with you.  But when I try to attach a jpeg, I get \"Upload of file failed.\"  Please advise, thanks![/QUOTE]\n\nThis site cannot handle images in normal resolutions - the parent file must be under 2mb, which the system then shrinks to ~200kb.  Usually this is the problem with that error, at least for me.  The source picture has to be reduced in quality before upload, which you can do in most apps or Apple Preview or whatever the equivalent is on Windows.",
      "post_time": "20240729T12:27:42-06:00",
      "timestamp": "1722277662"
    },
    {
      "post_id": "2450971",
      "post_title": "",
      "post_author_name": "shakes",
      "post_content": "Thanks, you were correct.  They should now be attached.\n\nSo first, I'm sharing these cards because I love them.  Just such beautiful cards and I know you appreciate the old animal cards too.\n\nAt the moment, I plan to hang onto them.  That said, I do like to have an idea of the value of the cards I own.  I know these are rare, as the PSA breakdown for the Tiger is a POP 2, with only 1 higher.  And for the Lion & Lioness, it's a POP 3, with only 2 higher.\n\nThat said, they aren't as loved by everyone as they are by us.  In your professional opinion (don't be bashful, you're as much a pro anyone) what would you value them at?  I really have no idea. If you aren't into such conversations, I will respect that.  I'm just really curious, as given their rarity, I really am clueless in this case.  \n\nHumbly,\n\nKy",
      "post_time": "20240729T16:12:00-06:00",
      "timestamp": "1722291120"
    }
  ]
}