{
  "id": "351026",
  "forum_id": "4",
  "title": "Valuing scarce OJ?",
  "author": "36GoudeyMan",
  "reply_count": 4,
  "view_count": 860,
  "created_date": null,
  "last_reply": "20240706T15:23:39-06:00",
  "posts": [
    {
      "post_id": "2445879",
      "post_title": "Valuing scarce OJ?",
      "post_author_name": "36GoudeyMan",
      "post_content": "I recently submitted a group of cards to SGC that I found in my own (not grandpa's) storage box, from purchases most likely made at one of the Richmond shows I was at maybe 25 years ago.  The group included an OJ that has come back Authentic, evidence of trimming.  That's fine, it happens.\n\nMy quandary is that here are NO reported sales of this variation in VCP, the SGC pop shows one other (numerical graded), and PSA has one qualified.  Not being very familiar with OJs (I am a between-the-wars collector generally), I am looking for some help in valuing such an item.  Any input would be greatly appreciated.  Thank you.",
      "post_time": "20240706T05:05:12-06:00",
      "timestamp": "1720263912"
    },
    {
      "post_id": "2445899",
      "post_title": "",
      "post_author_name": "jcmtiger",
      "post_content": "Photo and name of player would help.",
      "post_time": "20240706T08:02:15-06:00",
      "timestamp": "1720274535"
    },
    {
      "post_id": "2445901",
      "post_title": "OJ at issue",
      "post_author_name": "36GoudeyMan",
      "post_content": "Pic",
      "post_time": "20240706T08:15:24-06:00",
      "timestamp": "1720275324"
    },
    {
      "post_id": "2445912",
      "post_title": "",
      "post_author_name": "Fred",
      "post_content": "After years and years of slabbing OJs, SGC started adding the pose numbers to the flips.  I'm not sure if PSA has started this practice.  \n\nIn any case, the TPG registries wouldn't be accurate with respect to pose number and the TPGs cannot account for the actual quantity of a certain pose of a player in the OJ set. \n\nKeep in mind that the TPGs probably didn't have access to the list of players and poses until after the OJ Bible came out.  It's a shame because even after the OJ Bible came out, the TPGs didn't adapt to include the pose numbers on the flips (or registries) until SGC started doing it, relatively recently.",
      "post_time": "20240706T10:23:21-06:00",
      "timestamp": "1720283001"
    },
    {
      "post_id": "2445960",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "Beautiful card! From the image you posted it doesn't look trimmed but perhaps SGC saw something that is not obvious from the picture.",
      "post_time": "20240706T15:23:39-06:00",
      "timestamp": "1720301019"
    }
  ]
}