{
  "id": "206375",
  "forum_id": "4",
  "title": "looking for Goodwin, Ginter, Kimball champions",
  "author": "1880nonsports",
  "reply_count": 4,
  "view_count": 390,
  "created_date": null,
  "last_reply": "20150616T15:48:40-06:00",
  "posts": [
    {
      "post_id": "1414454",
      "post_title": "looking for Goodwin, Ginter, Kimball champions",
      "post_author_name": "1880nonsports",
      "post_content": "Willing to pay strong prices for my missing cards or trade liberally from my large pre-1920 tobacco collection. \n\nN162 Goodwin - trying to finish higher grade set vgx/x (need 15 cards) and low grade set with clean fronts and BD (need 7 cards)\n\nN43 Ginter - need about 13 low grade commons and vgx or better Edwards (boxer - LAST CARD WILL OVERPAY :-))\n\nN184 Kimball - looking for 17 cards for the 75 card master set - vgx or better\n\nN36 - large Ginter Indians - need about 20 low grade examples.",
      "post_time": "20150524T12:56:27-06:00",
      "timestamp": "1432493787"
    },
    {
      "post_id": "1414511",
      "post_title": "",
      "post_author_name": "pete zouras",
      "post_content": "What n43s do you need?  If I have one you need I wood be interested in a trade for a card featuring a woman such as those sold recently in sterling.  Thanks",
      "post_time": "20150524T16:35:12-06:00",
      "timestamp": "1432506912"
    },
    {
      "post_id": "1414553",
      "post_title": "that would a pretty stiff trade",
      "post_author_name": "1880nonsports",
      "post_content": "but I have no n360's to trade. I need quite a few low grade examples of the N43's - I pay 40.-75. should old fashioned dollars be of any interest and I can provide a list. I'd pay significantly more for a nice Edwards or Wood.\nAppreciate the head's up though. I've sold the women BB players before in the 800. - 1000. range although the condition was significantly better. The request for the one's in sterling is for a friend. Miss my set but I've moved on.....",
      "post_time": "20150524T18:26:22-06:00",
      "timestamp": "1432513582"
    },
    {
      "post_id": "1414751",
      "post_title": "Pete",
      "post_author_name": "1880nonsports",
      "post_content": "I had nearly complete sets of a few different series of women BB players but alas all have been sold but for a single type. I DO need the slocum for my low grade set but apparently I have nothing to trade you want including money. If you ever change your mind or I find a card for you - always interested until I fill the slot :-)",
      "post_time": "20150525T15:39:47-06:00",
      "timestamp": "1432589987"
    },
    {
      "post_id": "1422025",
      "post_title": "sigh",
      "post_author_name": "1880nonsports",
      "post_content": "b\nu\nm\np\n:(",
      "post_time": "20150616T15:48:40-06:00",
      "timestamp": "1434491320"
    }
  ]
}