{
  "id": "362233",
  "forum_id": "4",
  "title": "SOLD - Ty Cobb Rookie - 1907-09 PC765-1 Dietsche Postcards (Batting, 1907)",
  "author": "premiercardcollectors",
  "reply_count": 5,
  "view_count": 2200,
  "created_date": null,
  "last_reply": "20250629T11:22:57-06:00",
  "posts": [
    {
      "post_id": "2522667",
      "post_title": "SOLD - Ty Cobb Rookie - 1907-09 PC765-1 Dietsche Postcards (Batting, 1907)",
      "post_author_name": "premiercardcollectors",
      "post_content": "Rare at this price.  Ty Cobb \"True Rookie\" Issue\n\nCheck COMPS! Offers Welcome\n\nBeautifully preserved.  Two small spots of \"added color\" on the top right border of the card and glue residue on the back of the card.   Low grade issues of this card have sold well into the 5 figures.\n\n\nSOLD\n\nShipped Priority Signature Insured - DM me with any questions. Offers welcome. \n\n\nPayPal, Venmo or Zelle no-fee\n\n\n\nGraded Authentic by SGC. Attractive low-grade example of Ty Cobb's true rookie card, from the highly regarded A. C. Dietsche Detroit Tigers postcard set, issued in 1907. This issue was produced by the Dietsche Postcard Company of Detroit to commemorate the Tigers' participation in the 1907 World Series. Of special note, this card is considered by many collectors to be Ty Cobb's true rookie card. A number of other issues can also lay claim to that important distinction. While we realize that the definition of what is a player's rookie card can sometimes be very controversial and can vary from collector to collector, this card gets our vote! It is part of a postcard set that was issued in 1907. That sure sounds like a rookie card to us. The fact that the Dietsche postcard set features a short biography of the player on the back makes this postcard even more \"card-like\" than many more traditional issues. The card features a crisp black-and-white image of Cobb batting, with moderate edge and corner wear. The reverse is evenly soiled and unmarked. The Dietsche Detroit Tigers postcard of Ty Cobb represents an outstanding overlooked value compared to most other early Cobb cards, including those issued a couple of years later which are widely recognized by many collectors as Cobb's rookie cards. This is a strong example of what we think reasonably qualifies as Cobb's true rookie card.",
      "post_time": "20250618T21:40:49-06:00",
      "timestamp": "1750304449"
    },
    {
      "post_id": "2523855",
      "post_title": "",
      "post_author_name": "premiercardcollectors",
      "post_content": "Price Reduced.   Offers Welcomed.  Pre-National Sale.  Thank you",
      "post_time": "20250624T08:52:05-06:00",
      "timestamp": "1750776725"
    },
    {
      "post_id": "2523885",
      "post_title": "",
      "post_author_name": "rjackson44",
      "post_content": "Great card glws octavio",
      "post_time": "20250624T10:47:18-06:00",
      "timestamp": "1750783638"
    },
    {
      "post_id": "2524147",
      "post_title": "",
      "post_author_name": "premiercardcollectors",
      "post_content": "[quote name=\"rjackson44\" post=2523885]Great card glws octavio[/QUOTE]\n\nThanks Octavio!",
      "post_time": "20250625T09:23:00-06:00",
      "timestamp": "1750864980"
    },
    {
      "post_id": "2524381",
      "post_title": "",
      "post_author_name": "premiercardcollectors",
      "post_content": "Happy to entertain a fair offer on this one.\n\nThis one just sold for $4600 on 6/10",
      "post_time": "20250626T10:28:47-06:00",
      "timestamp": "1750955327"
    },
    {
      "post_id": "2524880",
      "post_title": "",
      "post_author_name": "premiercardcollectors",
      "post_content": "Price Reduced.  Offers Welcome",
      "post_time": "20250629T11:22:57-06:00",
      "timestamp": "1751217777"
    }
  ]
}