{
  "id": "273887",
  "forum_id": "4",
  "title": "****N172s*****SOLD*****",
  "author": "kkkkandp",
  "reply_count": 2,
  "view_count": 378,
  "created_date": null,
  "last_reply": "20190923T22:48:41-06:00",
  "posts": [
    {
      "post_id": "1918800",
      "post_title": "****N172s*****SOLD*****",
      "post_author_name": "kkkkandp",
      "post_content": "Ungraded, but presentable. Nice, reasonably-priced exemplars for those needing them. Prices are for delivered/insured. Paypal F & F. Email me (kkkkandp@aol.com) if you are interested.\n\n[STRIKE]Arundel $135[/STRIKE] SOLD - Beautiful dark, crisp image. Two small chips missing from edges of image layer. A couple of small wrinkles and tears as well along the right edge. Image layer separating slightly from cardboard backer near the bottom right. Several wrinkles to cardboard backer that do not effect the image, otherwise clean. \n[STRIKE]Irwin $185[/STRIKE] SOLD - Beautiful card all around. Nice corners and centering. Somewhat hokey oddball pose typical of many cards in the Old Judge set. Cardboard backer has a small dark mark near the top left and a watermark at the bottom, but is otherwise undamaged. \n[STRIKE]Buffinton $155[/STRIKE] SOLD - Image is a tad on the light side, but still quite distinct. Nice corners and centering.  Cardboard backer is a little dirty, but otherwise undamaged. \n[STRIKE]Flanigan $145[/STRIKE] SOLD - Image is a decidedly on the lighter side and is a little hazy, which is quite typical of the 1889 cards that have a pink tint. Slightly off-centered left-to-right, but nice corners. Cardboard backer is extremely clean.",
      "post_time": "20190923T08:02:22-06:00",
      "timestamp": "1569247342"
    },
    {
      "post_id": "1918908",
      "post_title": "",
      "post_author_name": "oldjudge",
      "post_content": "i’ll take that beautiful Irwin. Please email me how to pay you.\n\nJay",
      "post_time": "20190923T17:25:31-06:00",
      "timestamp": "1569281131"
    },
    {
      "post_id": "1918971",
      "post_title": "",
      "post_author_name": "trdcrdkid",
      "post_content": "E-mail sent on Arundel.",
      "post_time": "20190923T22:48:41-06:00",
      "timestamp": "1569300521"
    }
  ]
}