{
  "id": "203717",
  "forum_id": "4",
  "title": "UPDATED | FS: Not-so-common prewar postcards",
  "author": "Rob D.",
  "reply_count": 1,
  "view_count": 468,
  "created_date": null,
  "last_reply": "20150329T13:20:17-06:00",
  "posts": [
    {
      "post_id": "1395637",
      "post_title": "UPDATED | FS: Not-so-common prewar postcards",
      "post_author_name": "Rob D.",
      "post_content": "Updated on Sunday with three more postcards. Descriptions below the initial card listed, which was the 1920 World Series PC.\n\n1920 World Series postcard -- Description from Prestige Collectibles, an authority on Japanese baseball cards and memorabilia:\n\nThis postcard was distributed in 1921. It features Japanese HOFer Daisuke Miyake, Larry Gardner of the Indians and a Japanese reporter named Takada. The image was taken at Game 1 of the 1920 World Series at Ebbets Field. Unused. $350 delivered within the United States\n\nAmerican League Publishing Co. -- George Stoval, with Collister & Sayle ad on front, Cleveland schedule on back. Trimmed, but every one in series with the ad that I've seen is trimmed. In an SGC A holder. $1,250 delivered within the U.S. \n \nRaymond Kahn -- Stovall, Berger, Congalton, Bemis. SOLD\n\nUnusual postcard of 18 Cleveland players in both home and away uniforms posing outdoors. Got this in a Hunt auction, don't know much about it. I can't find a link on Hunt's website (shocker). I do remember that in the auction description, Hunt severely understated the amount of paper remnants on the back of the postcard -- and didn't show a scan of the back (another shocker). $600 delivered within the U.S.\n\nPayPal is fine. No need to \"gift\" your payment. (Check, cash, money order also OK and preferred).\n\nA commitment to buy takes precedence over an ongoing negotiation. :rolleyes: \n\n[URL=\"wolfie51sb@aol.com\"]Feel free to email any questions.[/URL]\n\nThanks,\n\nRob\n\n[URL=\"wolfie51sb@aol.com\"]wolfie51sb at aol dot com[/URL]\n\n[IMG]http://photos.imageevent.com/ineedanap/otherphotos/Item_3005_1.jpg[/IMG]\n\n[IMG]http://photos.imageevent.com/ineedanap/otherphotos/Item_3005_2.jpg[/IMG]\n\n[IMG]http://photos.imageevent.com/ineedanap/otherphotos/3-cle-pc-fb.jpg[/IMG]",
      "post_time": "20150328T19:36:44-06:00",
      "timestamp": "1427593004"
    },
    {
      "post_id": "1395853",
      "post_title": "Will take Raymond Kahn pc, thanks",
      "post_author_name": "bbpostcards",
      "post_content": "Will take Raymond Kahn, please. Email for payment instructions sent.",
      "post_time": "20150329T13:20:17-06:00",
      "timestamp": "1427656817"
    }
  ]
}