[
  {
    "post_id": "2495056",
    "post_title": "T206 Josh Clarke PSA 3 Drum",
    "post_author_name": "sycks22",
    "post_content": "Highest PSA graded, pop 1:  $9400",
    "post_time": "20250209T15:38:11-06:00",
    "timestamp": "1739140691"
  },
  {
    "post_id": "2495140",
    "post_title": "What makes this so ?",
    "post_author_name": "toledo_mudhen",
    "post_content": "Pete - \r\n\r\nHelp me understand what makes this one so rare as to get it into the price range of several thousand dollars -\r\n\r\nThe only thing I can think of is the DRUM Back - Yes???\r\n\r\nStill learning lots about my new T206 compulsion but this one just seems quite a bit odd to me.\r\n\r\nThanks in advance - L",
    "post_time": "20250210T04:59:51-06:00",
    "timestamp": "1739188791"
  },
  {
    "post_id": "2495155",
    "post_title": "",
    "post_author_name": "Wanaselja",
    "post_content": "Drum back and the card looks like an 8. Outstanding example.",
    "post_time": "20250210T07:22:35-06:00",
    "timestamp": "1739197355"
  },
  {
    "post_id": "2495172",
    "post_title": "",
    "post_author_name": "scottglevy",
    "post_content": "Lonnie,\r\n\r\nDrum backs are SUPER difficult.  Back when my dad and I used to be able to buy t206s raw and by the 100s we found all sorts of backs.  I NEVER randomly found a drum back card.  Which is saying something because I even found two Uzit back cards (the next rarest type).  That’s the primary reason for the price you see - I’d guess that even a totally destroyed drum backed card would be worth $2k+",
    "post_time": "20250210T09:23:17-06:00",
    "timestamp": "1739204597"
  },
  {
    "post_id": "2495185",
    "post_title": "",
    "post_author_name": "MVSNYC",
    "post_content": "Lonnie, as Scott said (Hi Scott!) Drum backs are highly coveted, and the rarest of all tobacco brands. For reference, I have an SGC 1 Hofman Drum, which is definitely a lower grade example, although presentable...I'd value that at around $6k...so Pete's stunning example is very well priced. And particular of note, most Drums are typically found in lower grade, so this Clarke Drum is in extra rare company in this grade/condition.",
    "post_time": "20250210T11:33:42-06:00",
    "timestamp": "1739212422"
  },
  {
    "post_id": "2495188",
    "post_title": "Drum",
    "post_author_name": "Cory",
    "post_content": "Just to reiterate - of the 233,174 t206 cards that PSA has graded only 174 have been Drums - so they are only 0.07% of the total graded population.  An additional factor that I have been made aware of with regards to Drums vs. Uzits (which have a similar population - but trade a bit cheaper) - is that Drum backs were printed across a broader number of players - so less drum backs per player (many 1 of 1s or similar and pop 4 was the highest I saw).  Uzits printed more cards for less players.  So if someone is doing a back run (all the backs of one player) the drum is going to have a significant premium as there are potentially only 1 available (and only up to 4).  \r\n\r\nSimplistically - just go and try to buy a t206 with a drum back and you will see how rare/expensive they are - I am just trying to get an example of each back type (ex -color, series & factory variations), and have been able to get one of each - except a Drum - and I don't really care who's on the front.  Still kicking myself for being cheap when a bunch of Drum's came to auction over the last year or so.",
    "post_time": "20250210T11:56:19-06:00",
    "timestamp": "1739213779"
  }
]