[
  {
    "post_id": "2328831",
    "post_title": "FS: Broad Leaf & Carolina Brights Cards",
    "post_author_name": "robw1959",
    "post_content": "I have examined the Broad Leaf card very closely for creases, and can find none. The only issue appears to be some light ink staining around the top half on front. I am unsure if it's due to ghosting or some post-production addition such as a rubber stamp? Asking [STRIKE]$5500[/STRIKE] $4500 shipped, PayPal Friends & Family preferred. Asking $3500 for the Carolina Brights Red Murray SGC 3 card, which doesn't appear to have any creasing either.\r\n\r\nSuccessful transactions with: Sean1125, 39special, Ericc22, asoriano, Econteachert205, oldcardboard, tolstoi, Jobu, simas7173, espomario, jmb, Charlie Faust III, Paul S, quitcrab, avalanche2006, Beatles Guy, Banjo, tjenkins, botn, trdcrdkid, jtschantz, longstreet766, greenmonster66, edjs, jb67, rhotchkiss, Puckettfan, mybuddyinc, frankbmd, Baseball*Collections, btcarfagno, Luke, vintageonlybb, bigfish, t206collector, marvymelvin, benginino9, bigedmachine, Stampsfan, Moonlight Graham, Rebublicaninmass, Gradedcardman, Tigerden, Smanzari, t206kid, clydepepper, Scott L., Brian Van Horn, t206whiteborder, polakoff, GoCubsGo32, Hxcmilkshake, Scott Garner, Goudey77, rdixon1208, Pat R, Bram99, bks14sr, Haybag, charlietheexterminator, fusorcruiser, Mutton Chop Yaz, ncinin, rootsearcher60, GoldenAge50s, thecomebacker, Kryksir, T206.org, seattlebaseball, banksfan14, slantycouch, forceplay sport, niembre, nickers, Kris19, bounce, aloondilana, lrush, fusorcruiser, cardsagain74, aronbenabe, JollyElm, Charger74, Cooper1972, ainmon, Gorditadogg, AWGreen, chadeast, ahumes13, dhicks67, mikemcgrail, DHogan, chrisn28, Frankish, bigfish, Donscards, hcv123, corky8484, sycks22, Scon0072, heisman95, cgjackson222, Beesweb2006, sflayank, horzverti, ClementeFanOh, scmavl, gooseman91, sb1, stkuhl, rand1com, Bliggity, lrush, paulcarek, Kris19, Belfast1933, Wookjie17, Kutcher55, vansaad, Redlegs25, Miamifinfan13, rjackson44, rpz2, vintagetoppsguy, lug-nut, GoldenAge50s, Jcosta19, gooseman91, irishdenny. ASF123, KMayUSA6060, RayBShotz, yanksfan09, Cubs Fan, bbsports, MBMiller25, mccrardl, babraham, Chicken man, Lobo Aullando, sflayank, funeralizer1, YazFenway08, philliesfan, Tyruscobb, dahunt8111",
    "post_time": "20230401T18:54:57-06:00",
    "timestamp": "1680396897"
  },
  {
    "post_id": "2328854",
    "post_title": "",
    "post_author_name": "Kidnapped18",
    "post_content": "PSA 1.5 Wow!!! Great looking card.\nThe card's registration is a little off and out of focus but that is a great looking card to only receive a Fair grade from PSA.\nGood luck with sale.",
    "post_time": "20230401T19:59:25-06:00",
    "timestamp": "1680400765"
  },
  {
    "post_id": "2328860",
    "post_title": "",
    "post_author_name": "BRY68",
    "post_content": "Beauty! Best of success!",
    "post_time": "20230401T20:12:56-06:00",
    "timestamp": "1680401576"
  },
  {
    "post_id": "2332314",
    "post_title": "",
    "post_author_name": "robw1959",
    "post_content": "Price reduction",
    "post_time": "20230416T10:21:54-06:00",
    "timestamp": "1681662114"
  }
]