[
  {
    "post_id": "2473585",
    "post_title": "140+ raw T206 common’s and minor stars",
    "post_author_name": "Belfast1933",
    "post_content": "I just posted this on several vintage FB pages but wanted to also include the Net54 members who may not wander into FB land!\r\n\r\n*****\r\n\r\n** A unique opportunity; 140+ raw T206 common’s and minor stars… available as a single lot **\r\n\r\nHappy Friday to pre-war collectors!\r\n\r\nAs some of you may know, I have been lucky enough to have been consigned an amazing collection of pre-war cards that I have enjoyed making available for sale here over the last several weeks.  Many of you have bought some real beauties that are brand new, never been available in the market.  \r\n\r\n(More on the back story of these and other cards from this his consignment in another future post - it’s a really great story that I look forward to sharing later this month!)\r\n\r\nToday, we’re posting something quite different and I hope site admins are ok with this - here, we have over 140 raw, T206 commons and some minor stars available with only 7 duplicates in the group.  \r\n\r\nI don’t think the opportunity to purchase 136 unique cards from “the monster” in a single purchase happens very often!  If my math is right, this represents a touch over 25% of the entire T206 set of 525 cards!\r\n\r\nBefore we make these available for sale individually, we first want to make this lot available as a single sale - if you’ve ever thought of chasing and building this amazing set of t206, this is a pretty incredible chance to pick up 1/4 of the set in one purchase.\r\n\r\nWe estimate that the collective “retail” value of these cards is a little over $10k.  We roughly estimate these to be about a PSA 2 grade, on average.  We have graded enough of the star and HOF cards from this same collection which is driving our estimated average of a PSA 2.\r\n\r\nWe are not yet breaking up the lot - if we don’t reach our goal value, we may shift to breaking up the lot.\r\n\r\nBut before we do, we wanted to make this lot available to any serious buyer - I won’t clog the post here with every card image but I have included some sample scans so you can see for yourself what these look like across the lot.\r\n\r\nIf this may be interest to you, please PM me and we can certainly share all photos so you can think about making an offer on the group as a whole.  We hope and think we will likely get very close to full retail value given the significance of the opportunity to pick up so much of this incredible set in one, single purchase.\r\n\r\nAgain, thx for taking a look and PM me and we can and will share lots more detail about the full 140+ lot of very nice T206’s!\r\n\r\nLooking forward to hearing from you….\r\n\r\nJeff\r\n\r\nJEFF GROSS VINTAGE BASEBALL CARDS",
    "post_time": "20241108T13:39:18-06:00",
    "timestamp": "1731098358"
  }
]