{
  "id": "329284",
  "forum_id": "13",
  "title": "SOLD RARE lot of 23 T225 Series 102 Boxing with Ty Cobb",
  "author": "hcv123",
  "reply_count": 1,
  "view_count": 333,
  "created_date": null,
  "last_reply": "20221223T09:06:37-06:00",
  "posts": [
    {
      "post_id": "2296358",
      "post_title": "SOLD RARE lot of 23 T225 Series 102 Boxing with Ty Cobb",
      "post_author_name": "hcv123",
      "post_content": "All the cards from this series (102) are tough with combined PSA and SGC populations of between 13 and 22.  They are on thinner stock and even more difficult in as nice condition as many of these (including the Cobb) are.  The colors on the cards are pretty incredible.\n\nThe Cobb is highly sought after and rarely found (last recorded graded sale in 2017).  It is not the same guy as the baseball player.  He was given the nickname Ty Cobb purposely to play off the fame of the baseball player and attract crowds.  This example as you will see in the scans presents beautifully (crease free).  \n\nThe Cobb has a very light stain/discoloration on the right side of the top edge.  The small black loop at the top is printed - the bottom of a \"y\" - presumably from the card that was above it on the sheet.  The balance of the cards are overall very nice - the O'Toole has a small tear at the top of the card and a crease that continues vertically down the center of the card.  The Young Loughrey has a small tear at the top of the card.  11 other cards have lighter creases that do not affect the player images.  \n\nI am looking to sell this as a lot at this time (almost half the set of 50).  Price is $1699.  net delivered and insured.  If I get no takers for the lot I will consider breaking up so feel free to let me know if that would be of interest to you and which card(s) you would be interested in.",
      "post_time": "20221221T14:15:11-06:00",
      "timestamp": "1671657311"
    },
    {
      "post_id": "2296917",
      "post_title": "Lot is sold",
      "post_author_name": "hcv123",
      "post_content": "Thanks for looking",
      "post_time": "20221223T09:06:37-06:00",
      "timestamp": "1671811597"
    }
  ]
}