{
  "id": "99422",
  "forum_id": "13",
  "title": "several tough 1909 Obaks for trade....",
  "author": "Archive",
  "reply_count": 0,
  "view_count": 324,
  "created_date": null,
  "last_reply": "20090328T19:44:00-06:00",
  "posts": [
    {
      "post_id": "686557",
      "post_title": "several tough 1909 Obaks for trade....",
      "post_author_name": "Archive",
      "post_content": "Posted By: Brian McQueen\n\nI have a group of 1909 Obaks I thought I'd offer up for trade to further some of my other projects.  Scans are available upon request. Some of these are pretty tough to come by....\n\nOrt (Portland) SGC 40 - slight touches to corners/no creasing\nRagan (Oakland) SGC 40 - slight touches to corners/no creasing\nSmith (LA) SGC AUT - no creasing/little wear\nWilliams (SF) SGC 30 - wrinkle in upper-left/little wear otherwise\nBrowning (SF) SGC 30 - might be nicest card in group - mostly sharp corners, little wear, no wrinkling or creasing\nEhman (SAC) SGC 30 - uncatalogued until recently, slight touches to corners/no creasing\nMcCreddie (Portland) SGC AUT - tough MGR card! no creasing/little wear\nOrnsdorff (LA) SGC AUT - tiny wrinkle in corner, little wear\n\nBelow are some cards I need to further myself along on a few sets.  Thanks in advance!\n\nBrian\nredmaccie@hotmail.com\n\n\n1918 Zeenuts - any\nt207 Napoleon backs - need most\nt209-2 - need most\nt210 Orange Borders - need most\nw590 - Ruth, Spencer\n1919 Zeenuts - Lane (oak), Pinelli (sac), Prough (sac), Vance (sac), Spencer (saltlake), Seaton (SF), Smith (SF), Snell (SF), Eastley (SEA), Arbuckle (Vern), Check (Vern), Houck (Vern), Meusel (vern)\nd311 - Agnew, Arrelanes, Berry, Brashear, Burrell, Byram, Castleton, Chadbourne, Christian, Daley, Danzig, Delhi, Delmas, Dillon, Gipe, Gregory, Harkness, Heister, Holland, Howard, Kuhn, LaLonge, Lewis, Maggert, Mohler, Moore, Murray, ORourke, Patterson, Pearce, Rapps, Ryan, Schmidt, Stamfield, Steen, Sutor, Tennant, Thompson, Van Buren, Wares",
      "post_time": "20090328T19:44:00-06:00",
      "timestamp": "1238291040"
    }
  ]
}