{
  "id": "353003",
  "forum_id": "13",
  "title": "FS: 1914-1916 T213 Coupon Cigarettes Type 2 Collection – 22 Cards SGC Graded",
  "author": "dwer8509",
  "reply_count": 0,
  "view_count": 1263,
  "created_date": null,
  "last_reply": "20240908T12:13:57-06:00",
  "posts": [
    {
      "post_id": "2459632",
      "post_title": "FS: 1914-1916 T213 Coupon Cigarettes Type 2 Collection – 22 Cards SGC Graded",
      "post_author_name": "dwer8509",
      "post_content": "1914 Coupon Cigarettes T213 Al Bridwell St. Louis SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Bob Groom SGC 50 VG/EX 4  - $450.00\n1914 Coupon Cigarettes T213 Doc Crandall SGC 50 VG/EX 4 (Highest Graded Example) - $450.00\n1914 Coupon Cigarettes T213 Dots Miller SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Dode Paskert Philadelphia Nat. SGC 40 VG 3 -$200.00 \n1914 Coupon Cigarettes T213 Ed Lennox SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Ed Summers SGC 45 VG+ 3.5 - $250.00\n1914 Coupon Cigarettes T213 Germany Schaefer K.C. Fed. SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Heine Wagner SGC 70 EX+ 5.5 (Highest Graded Example) - $500.00\n1914 Coupon Cigarettes T213 Hughie Jennings One Hand Showing (HOF) SGC 40 VG 3 - $450.00\n1914 Coupon Cigarettes T213 Jean Dubuc SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Johnny Evers (HOF) SGC 40 VG 3 - $650.00\n1914 Coupon Cigarettes T213 John Hummel Brooklyn Nat. SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Larry Doyle Portrait SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Mickey Doolan Baltimore, Batting SGC 45 VG+ 3.5 - $250.00\n1914 Coupon Cigarettes T213 Mike Mowrey Pittsburgh Fed. SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Owen Wilson SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Red Ames SGC 45 VG+ 3.5 - $250.00\n1914 Coupon Cigarettes T213 Russ Ford SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Rube Geyer SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Steve Evans SGC 40 VG 3 - $200.00\n1914 Coupon Cigarettes T213 Tom Downey SGC 45 VG+ 3.5 - $250.00\n\nListed is all the 1914 Coupon Cigarettes T213 SGC graded cards I have and my asking prices. If you are interested in any of these cards, please contact me.",
      "post_time": "20240908T12:13:57-06:00",
      "timestamp": "1725819237"
    }
  ]
}