{
  "id": "208509",
  "forum_id": "13",
  "title": "1910 T218 Mecca boxing cards",
  "author": "Joshchisox08",
  "reply_count": 14,
  "view_count": 1131,
  "created_date": null,
  "last_reply": "20150712T10:58:31-06:00",
  "posts": [
    {
      "post_id": "1429582",
      "post_title": "1910 T218 Mecca boxing cards",
      "post_author_name": "Joshchisox08",
      "post_content": "This may or may not be the right place for this but thought I'd try here. \n\nIs there any market for these cards ??? I've got an opportunity to get a few in bad shape pin holes in every possible corner. But overall they look pretty appealing anyway. I couldn't attach a photo of them but the guy says he has about 45 of them. Other than Jack Johnson (which I only know of 6 boxers he has) anyone else worth anything ???\n\nThe guys I have pictures of are:\n\nWillie Lewis\nJim Stewart\nAd Wolgast\nTom Collins\nJohn Flannagan\nPlatt Adams",
      "post_time": "20150710T09:28:35-06:00",
      "timestamp": "1436542115"
    },
    {
      "post_id": "1429596",
      "post_title": "",
      "post_author_name": "Griffins",
      "post_content": "not so much in that shape- a buck or three each, at most. \nThe square border ones are a bit more desireable, and if any have a Tolstoi back, regardless of condition, that will bring some interest. The ones with track stars, pedestrians, and the creepy roller skater don't seem to be very desirable. \nFor the boxers, Johnson is the key, with Attell probably second due to his Black Sox connection. Even though there are some big names (Gans, Jefferies, Ketchell, etc) they don't seem to rate more than commons.",
      "post_time": "20150710T10:15:16-06:00",
      "timestamp": "1436544916"
    },
    {
      "post_id": "1429654",
      "post_title": "",
      "post_author_name": "Joshchisox08",
      "post_content": "Hmmm maybe I'll just get them to own them they are kind of cool. Thanks for the insight Tony !",
      "post_time": "20150710T13:33:35-06:00",
      "timestamp": "1436556815"
    },
    {
      "post_id": "1429661",
      "post_title": "",
      "post_author_name": "scooter729",
      "post_content": "What Anthony said is dead on - he knows as much about the set as anyone.\n\nYou can pick up lots on eBay from time to time in the $2 per card range for VG common cards, so if these are really smashed with pin holes and bad creasing, don't put too much into them.\n\nWith that said, I think the set is fantastic and am a huge fan of the cards myself, and enjoy that you can get them at bargain prices!",
      "post_time": "20150710T13:47:55-06:00",
      "timestamp": "1436557675"
    },
    {
      "post_id": "1429664",
      "post_title": "",
      "post_author_name": "Joshchisox08",
      "post_content": "Yeah the guy who has them has no idea what they're worth hopefully he'll believe me that they aren't worth much. \n\nSupposedly they were all tacked on the inside of a trunk.",
      "post_time": "20150710T13:52:03-06:00",
      "timestamp": "1436557923"
    },
    {
      "post_id": "1429665",
      "post_title": "",
      "post_author_name": "Joshchisox08",
      "post_content": "Ha got the picture size down.",
      "post_time": "20150710T13:55:03-06:00",
      "timestamp": "1436558103"
    },
    {
      "post_id": "1429833",
      "post_title": "",
      "post_author_name": "swarmee",
      "post_content": "[quote name=\"Griffins\" post=1429596]The ones with track stars, pedestrians, and the creepy roller skater don't seem to be very desirable.[/QUOTE]\n\nI love the guy with like 30 medals on his shirt.  That's a great looking card.",
      "post_time": "20150711T05:24:44-06:00",
      "timestamp": "1436613884"
    },
    {
      "post_id": "1429856",
      "post_title": "",
      "post_author_name": "Griffins",
      "post_content": "The artwork on this set and T118 is incredible\n\n[IMG]http://photos.imageevent.com/griffins/prewwi/t218mainset/large/Jordan.tif.jpg[/IMG]\n\n\nMy favorite subset is the aviators.  Issued only 7 years after the Wright Brothers first flight at Kitty Hawk,  3 of the 4 pictured would be die in crashes the year the set was issued. \n[IMG]http://photos.imageevent.com/griffins/prewwi/t218mainset/icons/Hamilton.tif.jpg[/IMG][IMG]http://photos.imageevent.com/griffins/prewwi/t218mainset/icons/Hoxsey.tif.jpg[/IMG][IMG]http://photos.imageevent.com/griffins/prewwi/t218mainset/icons/Johnstone.tif.jpg[/IMG][IMG]http://photos.imageevent.com/griffins/prewwi/t218mainset/icons/Moisant.tif.jpg[/IMG]",
      "post_time": "20150711T08:48:14-06:00",
      "timestamp": "1436626094"
    },
    {
      "post_id": "1429977",
      "post_title": "",
      "post_author_name": "D. Bergin",
      "post_content": "There was a time when the Billiard guys used to command the highest premiums in the set. Not sure if that's still the case anymore.",
      "post_time": "20150711T15:36:00-06:00",
      "timestamp": "1436650560"
    },
    {
      "post_id": "1430000",
      "post_title": "",
      "post_author_name": "BradH",
      "post_content": "I've completed this set in varying grades and as others have said, they can generally be had for a couple bucks (or less) and maybe $4-5 for nice condition examples.  It's a gorgeous set. \n\nI do slightly disagree with this:\n\n[quote name=\"Griffins\" post=1429596]The ones with ... pedestrians ... don't seem to be very desirable.[/QUOTE]\n\nEdward Payson Weston (card back pictured below) is perhaps my favorite card in the set and I have one in a float frame on my desk at work, which makes for a nice conversation piece when people see it.  The back of his card back is a pretty amazing read.  It starts with this sentence:  \"Edward Payson Weston is probably the greatest pedestrian that ever lived.\" He would have been around 70 years old when this set was released. Other than Connie Mack and maybe Casey Stengel, I can't think of many sports sets that had a guy that old who was still active in his sport.\n\nGreat set overall - you'll enjoy putting it together if you decide to pursue it.",
      "post_time": "20150711T17:06:17-06:00",
      "timestamp": "1436655977"
    },
    {
      "post_id": "1430004",
      "post_title": "",
      "post_author_name": "mybuddyinc",
      "post_content": "Have complete set of 153 (vg/ex+).  I wouldn't say the toughest, but the golfers probably fetch the most money.  Probably just because of popularity of sport, and relatively few golfing cards from that era.  Aviators are probably the toughest to find, but less popular.  Followed by billiards and bowling.  The boxers and track field / swimming are the most abundant, with boxers more popular.\n\nIt's a great set.  It's doable, super images, and the write ups on back are very interesting to read:\n\nIt blows my mind that the Bowlers held over 200 averages and higher.  Back with two hole rubber balls, rickety lanes, and hand inconsistant pin setting.\n\nFlanagan (hammer throw) and Ewry (standing jump) were American Olympic heroes, both competing in 1900, 1904, and 1908.  They dominated in their field.  Also like the top one mile runner, James Stewart, who was known as \"422 Jim\" for obvious reason.\n\nBilliards, Willie Hoppe is very popular do to his dominance of game well into the 1930's, which he also has a few cards.\n\nHEY !!!! Get off the Pedestrian, Edward Weston.  The old dude, at 71, walked from Los Angeles to New York (3,600 miles) in 78 days.  Do the math, it's unreal.",
      "post_time": "20150711T17:14:03-06:00",
      "timestamp": "1436656443"
    },
    {
      "post_id": "1430020",
      "post_title": "",
      "post_author_name": "BradH",
      "post_content": "[quote name=\"mybuddyinc\" post=1430004]Flanagan (hammer throw) and Ewry (standing jump) were American Olympic heroes, both competing in 1900, 1904, and 1908.  They dominated in their field.[/QUOTE]\n\nBeing a fellow Purdue grad, Ewry is actually my favorite athlete in this set.  I believe he held the record for most Olympic gold medals until Michael Phelps came along.   \n\nWeston is my favorite card in the set just because of the uniqueness of it and the great artwork on the front and amazing writeup on the back. \n\nTo the OP:  If you need/want more, I have a ton of dupes of most of the cards in this set besides the golfers and billiards guys.",
      "post_time": "20150711T17:58:11-06:00",
      "timestamp": "1436659091"
    },
    {
      "post_id": "1430026",
      "post_title": "",
      "post_author_name": "Griffins",
      "post_content": "Agree that Weston is one of the nicest cards (I can see him yelling \"Get off My Lawn\" almost as well as Kawika does) but my point is that some of the odder sports command the least money. \nI\"ve found the boxers tend to be the most expensive, even more than the golfers. Some of those boxing guys are a bit fanatical!\n\n[IMG]http://photos.imageevent.com/griffins/prewwi/t218mainset/icons/WestonE.tif.jpg[/IMG]",
      "post_time": "20150711T18:14:33-06:00",
      "timestamp": "1436660073"
    },
    {
      "post_id": "1430175",
      "post_title": "T218's--",
      "post_author_name": "dougscats",
      "post_content": "Hi Josh,\n\nWhere this thread belongs is an interesting administrative question.\nAs opposed to many of the other B/S/T sub-forums, this one doesn't specify baseball.  So in that respect, this could be the right place for it, though I do usually associate the B/S/T sections, aside from the auctions, with baseball.\n\nWhen I've posted or looked for T218's in the past, I've usually gone to the Postwar Cards & Watercooler Talk/Boxing sub-forum, but of course that would exclude more than half the cards in the set.\nEverything Else is also a possible sub-forum.  Apparently, it's a grey area.\n\nWhatever, it's a great set to collect--beautiful cards, a hundred years old, lots of hall-of-famers from several sports, and still quite affordable.  It's one of only two sets I've actually completed, and that can be done for $500-$1,000, Fair or better condition.\nThe ones that got me first [after Jack Johnson] were the billiards cards, particularly the the playing poses, which are a classic study in bridge techniques and still quite applicable today.  If I owned a pool hall, or even had a table in my basement, I'd make a wall display of those.\n\nOne good and inexpensive way of collecting them: Get a big bunch cheaply to begin, and go from there.\nIf you're looking for a small, inexpensive bunch, I've got a few dozen doubles, from Poor to VG-Ex.\n\nIf you like the cards of antiquity in general, you'll love these.  Good luck.\n\nDoug",
      "post_time": "20150712T09:02:09-06:00",
      "timestamp": "1436713329"
    },
    {
      "post_id": "1430217",
      "post_title": "",
      "post_author_name": "Joshchisox08",
      "post_content": "[quote name=\"dougscats\" post=1430175]Hi Josh,\n\nWhere this thread belongs is an interesting administrative question.\nAs opposed to many of the other B/S/T sub-forums, this one doesn't specify baseball.  So in that respect, this could be the right place for it, though I do usually associate the B/S/T sections, aside from the auctions, with baseball.\n\nWhen I've posted or looked for T218's in the past, I've usually gone to the Postwar Cards & Watercooler Talk/Boxing sub-forum, but of course that would exclude more than half the cards in the set.\nEverything Else is also a possible sub-forum.  Apparently, it's a grey area.\n\nWhatever, it's a great set to collect--beautiful cards, a hundred years old, lots of hall-of-famers from several sports, and still quite affordable.  It's one of only two sets I've actually completed, and that can be done for $500-$1,000, Fair or better condition.\nThe ones that got me first [after Jack Johnson] were the billiards cards, particularly the the playing poses, which are a classic study in bridge techniques and still quite applicable today.  If I owned a pool hall, or even had a table in my basement, I'd make a wall display of those.\n\nOne good and inexpensive way of collecting them: Get a big bunch cheaply to begin, and go from there.\nIf you're looking for a small, inexpensive bunch, I've got a few dozen doubles, from Poor to VG-Ex.\n\nIf you like the cards of antiquity in general, you'll love these.  Good luck.\n\nDoug[/QUOTE]\n\n\nYou Douggie, Leon put it hear after I improperly placed it in the wrong section.",
      "post_time": "20150712T10:58:31-06:00",
      "timestamp": "1436720311"
    }
  ]
}