{
  "id": "339025",
  "forum_id": "13",
  "title": "FS: 62 PSA Graded T207s with HOFers and Tough Backs (Taking Offers)",
  "author": "jburl",
  "reply_count": 2,
  "view_count": 607,
  "created_date": null,
  "last_reply": "20230903T08:06:45-06:00",
  "posts": [
    {
      "post_id": "2363330",
      "post_title": "FS: 62 PSA Graded T207s with HOFers and Tough Backs (Taking Offers)",
      "post_author_name": "jburl",
      "post_content": "I'm consolidating several threads I had before, but a lot sold and I thought it might make sense to consolidate to a single post. Open to offers, especially on multiples. Front/back scans available on request (or on my website). PM or email to [url]burl@burlssports.com[/url] works best.\n \n1912 T207 BROWN BACKGROUND RAFAEL ALMEIDA PSA 5MC Broadleaf Back $1,250 \n1912 T207 BROWN BACKGROUND JAMES AUSTIN (NO INSIGNIA ON SHIRT) PSA 5 Recruit Back Factory 240 $500 \n1912 T207 BROWN BACKGROUND CHIEF BENDER PSA 2 Recruit Back Factory 240 $400 \n1912 T207 BROWN BACKGROUND JOSEPH BENZ  PSA 4MC Broadleaf Back $350 \n1912 T207 BROWN BACKGROUND JOE BIRMINGHAM  PSA 3 Red Cycle Back $600 \n1912 T207 BROWN BACKGROUND RUSSELL BLACKBURNE PSA 2MK Red Cycle Back $350 \n1912 T207 BROWN BACKGROUND HENRY BUTCHER  PSA 2.5 Anonymous Back Factory 3 $500 \n1912 T207 BROWN BACKGROUND FRANK CHANCE PSA 4 Recruit Back Factory 240 $650 \n1912 T207 BROWN BACKGROUND JOHN COLLINS PSA 4 Recruit Back Factory 240 $350 \n1912 T207 BROWN BACKGROUND WILLIAM CUNNINGHAM  PSA 2 Red Cycle Back $500 \n1912 T207 BROWN BACKGROUND JOHN DAUBERT PSA 5 Recruit Back Factory 240 $300 (SOLD for best offer)\n1912 T207 BROWN BACKGROUND TOM DOWNEY  PSA 4 Red Cycle Back $750 \n1912 T207 BROWN BACKGROUND R.E. ERWIN PSA 5 Recruit Back Factory 606 $300 \n1912 T207 BROWN BACKGROUND LOUIS EVANS PSA 5 Recruit Back Factory 606 $250 \n1912 T207 BROWN BACKGROUND JOHN FERRY PSA 5 Recruit Back Factory 240 $250 \n1912 T207 BROWN BACKGROUND RAY FISHER (BLUE CAP) PSA 4 Recruit Back Factory 240 $300 \n1912 T207 BROWN BACKGROUND JACQUES FOURNIER  PSA 1  $250 \n1912 T207 BROWN BACKGROUND LEFTY GEORGE PSA 3 Recruit Back Factory 240 $250 \n1912 T207 BROWN BACKGROUND J.G. GRANEY  PSA 4 Recruit Back Factory 240 $200 \n1912 T207 BROWN BACKGROUND VEAN GREGG  PSA 4MC Broadleaf Back $350 \n1912 T207 BROWN BACKGROUND E.S. HALLINAN PSA 4 Recruit Back Factory 240 $200 \n1912 T207 BROWN BACKGROUND CHARLES HERZOG  PSA 1.5 Broadleaf Back $200 \n1912 T207 BROWN BACKGROUND CHESTER HOFF  PSA 1 Broadleaf Back $500 \n1912 T207 BROWN BACKGROUND HAMILTON HYATT  PSA 1 Anonymous Back Factory 3 $300 \n1912 T207 BROWN BACKGROUND WALTER JOHNSON PSA 2.5 Recruit Back Factory 240 $900 \n1912 T207 BROWN BACKGROUND WILLIAM KELLY  PSA 3MC Broadleaf Back $300 \n1912 T207 BROWN BACKGROUND JOHN KLING PSA 1 Recruit Back Factory 606 $200 \n1912 T207 BROWN BACKGROUND OTTO KNABE PSA 5 Recruit Back Factory 240 $300 \n1912 T207 BROWN BACKGROUND ELMER KNETZER PSA 4 Recruit Back Factory 606 $350 \n1912 T207 BROWN BACKGROUND HARRY KRAUSE  PSA 5 Recruit Back Factory 606 $300 \n1912 T207 BROWN BACKGROUND \"RED\" KUHN  PSA 2 Broadleaf Back $500 \n1912 T207 BROWN BACKGROUND F.H. (BILL) LANGE  PSA 2 Anonymous Back Factory 3 $400 \n1912 T207 BROWN BACKGROUND ALBERT LEIFIELD  PSA 4 Recruit Back Factory 240 $200 \n1912 T207 BROWN BACKGROUND PADDY LIVINGSTON (SMALL \"C\" ON SHIRT) PSA 4 Recruit Back Factory 606 $300 \n1912 T207 BROWN BACKGROUND BRISCOE LORD (PHILADELPHIA) PSA 4.5 Recruit Back Factory 240 $250 \n1912 T207 BROWN BACKGROUND GEORGE McBRIDE PSA 5 Recruit Back Factory 240 $300 \n1912 T207 BROWN BACKGROUND JOHN J. McGRAW PSA 3 Recruit Back Factory 240 $300 \n1912 T207 BROWN BACKGROUND HARRY McINTIRE PSA 5 Recruit Back Factory 240 $300 \n1912 T207 BROWN BACKGROUND OTTO MILLER (BROOKLYN) PSA 1.5 Broadleaf Back $300 \n1912 T207 BROWN BACKGROUND ROY MILLER (BOSTON) PSA 1MC Anonymous Back Factory 3 $250 \n1912 T207 BROWN BACKGROUND MIKE MITCHELL (CLEVELAND, PICTURE IS WILLIE MITCHELL) PSA 6 Recruit Back Factory 606 $500 \n1912 T207 BROWN BACKGROUND EARL MOORE  PSA 4.5 Broadleaf Back $750 \n1912 T207 BROWN BACKGROUND GEORGE MORIARTY PSA 1MC Red Cycle Back $300 \n1912 T207 BROWN BACKGROUND GEORGE MULLIN (\"D\" ON CAP) PSA 4 Recruit Back Factory 240 $200 (SOLD)\n1912 T207 BROWN BACKGROUND RED NELSON  PSA 3 Red Cycle Back $600 \n1912 T207 BROWN BACKGROUND HERBERT NORTHEN  PSA 4 Recruit Back Factory 606 $200 \n1912 T207 BROWN BACKGROUND IVAN OLSON PSA 5 Recruit Back Factory 606 $300 \n1912 T207 BROWN BACKGROUND MARTIN J. O'TOOLE PSA 5 Recruit Back Factory 240 $250 \n1912 T207 BROWN BACKGROUND ARTHUR PHELAN  PSA 3 Broadleaf Back $500 \n1912 T207 BROWN BACKGROUND JACK QUINN PSA 5 Recruit Back Factory 240 $300 \n1912 T207 BROWN BACKGROUND NAPOLEON RUCKER  PSA 5 Recruit Back Factory 240 $400 (SOLD - offer accepted)\n1912 T207 BROWN BACKGROUND J.B. RYAN  PSA 4 Broadleaf Back $1,200 \n1912 T207 BROWN BACKGROUND WILLIAM SCANLON PSA 5 Recruit Back Factory 606 $250 \n1912 T207 BROWN BACKGROUND GERMANY SCHAEFER PSA 5 Recruit Back Factory 240 $250 \n1912 T207 BROWN BACKGROUND FRANK E. SMITH (CINCINNATI) PSA 4 Recruit Back Factory 240 $200 (SOLD - offer accepted)\n1912 T207 BROWN BACKGROUND EDWARD STACK PSA 6 Recruit Back Factory 240 $300 (SOLD - offer accepted)\n1912 T207 BROWN BACKGROUND GEORGE STOVALL PSA 3 Recruit Back Factory 240 $200 \n1912 T207 BROWN BACKGROUND AMOS STRUNK PSA 6 Recruit Back Factory 240 $500 \n1912 T207 BROWN BACKGROUND WILLIAM J. SWEENEY  PSA 2.5 Broadleaf Back $400 \n1912 T207 BROWN BACKGROUND JOE TINKER PSA 2 Recruit Back Factory 240 $275 \n1912 T207 BROWN BACKGROUND ED (DIXIE) WALKER PSA 5 Recruit Back Factory 606 $250 \n1912 T207 BROWN BACKGROUND JOHN WARHOP  PSA 5 Recruit Back Factory 240 $400 (SOLD - offer accepted)\n1912 T207 BROWN BACKGROUND G. HARRIS WHITE  PSA 1.5 Anonymous Back Factory 3 $400 \n1912 T207 BROWN BACKGROUND OWEN WILSON (PITTSBURG) PSA 2 Anonymous Back Factory 25 $400 \n1912 T207 BROWN BACKGROUND GEORGE WILTSE PSA 5 Recruit Back Factory 240 $250 \n1912 T207 BROWN BACKGROUND EUGENE WOODBURN  PSA 5 Broadleaf Back $1,250 \n1912 T207 BROWN BACKGROUND RALPH WORKS  PSA 3 Broadleaf Back $500",
      "post_time": "20230810T22:05:23-06:00",
      "timestamp": "1691726723"
    },
    {
      "post_id": "2366606",
      "post_title": "",
      "post_author_name": "jburl",
      "post_content": "Bump. 5 sold. Open to offers.\n\nRegards,\nBurl",
      "post_time": "20230822T10:58:00-06:00",
      "timestamp": "1692723480"
    },
    {
      "post_id": "2369701",
      "post_title": "",
      "post_author_name": "jburl",
      "post_content": "62 of these left. I'd really like to move these, so I'm taking reasonable offers. PM or email if you see something you are intereseted in. \n\nBurl",
      "post_time": "20230903T08:06:45-06:00",
      "timestamp": "1693750005"
    }
  ]
}