{
  "id": "138850",
  "forum_id": "13",
  "title": "FS-T206 Joe Doyle, backs set, all sold except Tolstoi",
  "author": "nodgrass",
  "reply_count": 5,
  "view_count": 732,
  "created_date": null,
  "last_reply": "20110712T19:33:06-06:00",
  "posts": [
    {
      "post_id": "906119",
      "post_title": "FS-T206 Joe Doyle, backs set, all sold except Tolstoi",
      "post_author_name": "nodgrass",
      "post_content": "ALL SOLD WITH THE EXCEPTION OF THE TOLSTOI which has been moved to a seperate listing\n\n\nPiedmont 350 SCG 40 -  A nice card in above average condition for the grade.  Shows a faint wrinkle on bottom left corner of the reverse side but does not show on the front side.  Typical corner wear for the grade, no other issues, a nice one with good registration. $275\n\nSweet Caporal 350 Factory 30  SGC 40-  Another  nice card in above average condition for the grade.  Shows a couple of faint wrinkles and a slightly dinged bottom left corner, otherwise a very nice clean card.  $275\n\nSweet Caporal 350 Factory 25  PSA 3.5 -  Typical corner wear and a slight wrinkle near the tip of the bottom right corner.  Overall, a clean card and above average for the grade.  $320\n\nA note about the next two… The T206 Doyle exhibits a much higher incidence rate of printing flaws in the team name area than other T206’s.  I am sure it has something to do with the error correction in removing the “National” from the printing process.\n\nPolar Bear  PSA 3  - Very nice card with good color and registration.  No visible creases.  Features a unique printing error, the bottom of the “Y” in “N.Y.” is missing (not paper loss) making the “N.Y.” appear as “N.V.”   Be the proud owner of the very rare “Joe Doyle Nevada” variation ;-)  I have on file and can send close-up scans of the printing variation to a potential purchaser if desired. $300\n\nOld Mill SGC 40 -  A fairly tough back to find in Doyle.  Nice card with fairly sharp corners.  Small, barely visible, crease in upper left corner.  Another card with a slight printing error, the upper right section of the “Y” in “N.Y.” is missing (not paper loss).  I can send close-up scans of the printing variation to a potential purchaser if desired. $325\n\n\nSovereign 350  PSA 1-  A tough one!  Only a couple have been graded by either major grading service and only one or two have been offered for sale during the past few years.  This one has typical PSA 1 features,  rounded corners,  a few heavy creases, and a reverse that is not very clean.  $250\n\nEl Principe De Gales SGC 20 -  Another tough one!  Again, only a couple have been graded by either major grading service and almost never offered on the market.   Regardless of grade, I find this to be the nicest card, presentation-wise, in the group I am offering.   The corners are very sharp as would be found on a Ex-NM card and it has the nicest color and registration of the entire group.  No visible creases.  The back is stained by what appears to be a thin paste mixture.  This card was probably removed from an album but does not exhibit the paper loss usually associated with doing so.  There are only a few very small areas with paper missing.  Without the paste stains, this is a PSA 6.   $325\n\n\n\n[IMG]http://i110.photobucket.com/albums/n88/MARCBOURGEA/T206Doylesetfronts1.jpg[/IMG]   [IMG]http://i110.photobucket.com/albums/n88/MARCBOURGEA/T206Doylesetfronts1-1.jpg[/IMG]\n\n[IMG]http://i110.photobucket.com/albums/n88/MARCBOURGEA/T206Doylesetbacks1.jpg[/IMG] [IMG]http://i110.photobucket.com/albums/n88/MARCBOURGEA/T206Doylesetbacks2.jpg[/IMG]",
      "post_time": "20110704T10:52:44-06:00",
      "timestamp": "1309798364"
    },
    {
      "post_id": "906209",
      "post_title": "",
      "post_author_name": "Rob D.",
      "post_content": "Very impressive group, Marc. I always love seeing displays like this.\n\nHow long did it take you to put together this collection?\n\nGood luck with the sale.",
      "post_time": "20110704T17:11:54-06:00",
      "timestamp": "1309821114"
    },
    {
      "post_id": "906310",
      "post_title": "",
      "post_author_name": "nodgrass",
      "post_content": "Thanks.  It took me a couple of years at least.  I am really not sure when I started.  It took a lot of persistence, beating the bushes, and trying to talk people into selling cards they really did not want to sell.  A got lucky with a couple of the difficult backs.  I think it could have taken much longer than it actually did to complete this set.  If I were a betting man, I would not bet I could be successful in assembling this group again within the next 3 years.",
      "post_time": "20110705T07:56:33-06:00",
      "timestamp": "1309874193"
    },
    {
      "post_id": "908250",
      "post_title": "",
      "post_author_name": "nodgrass",
      "post_content": "Now for sale as singles",
      "post_time": "20110711T19:30:14-06:00",
      "timestamp": "1310434214"
    },
    {
      "post_id": "908267",
      "post_title": "",
      "post_author_name": "4815162342",
      "post_content": "[quote name=\"Rob D.\" post=906209]Very impressive group, Marc. I always love seeing displays like this.[/QUOTE]\n\n+1\n\nDon't sell them, you'll regret it!  :)",
      "post_time": "20110711T20:02:07-06:00",
      "timestamp": "1310436127"
    },
    {
      "post_id": "908507",
      "post_title": "",
      "post_author_name": "nodgrass",
      "post_content": "Only the Tolstoi remains.  The rest were sold as a group.",
      "post_time": "20110712T19:33:06-06:00",
      "timestamp": "1310520786"
    }
  ]
}