{
  "id": "336147",
  "forum_id": "13",
  "title": "I'm looking for this T216 needle in this T216 Kotton haystack",
  "author": "ValKehl",
  "reply_count": 4,
  "view_count": 569,
  "created_date": null,
  "last_reply": "20230602T11:45:27-06:00",
  "posts": [
    {
      "post_id": "2344574",
      "post_title": "I'm looking for this T216 needle in this T216 Kotton haystack",
      "post_author_name": "ValKehl",
      "post_content": "Many of you are aware that I have been working on a back run of Hugh Jennings cards that show his famous \"Ee-Yah!\" pose with an orange background (see pic below). I have reached the point where I believe I'm down to missing 3 cards, assuming examples of them exist - they are (1) Blank back, (2) E92 Croft's Candy with a RED back, and (3) T216 Kotton Cigarettes with a \"NEVER GO OUT\" back (see pic below), which I shall call the \"KNGO\" back. If anyone has any of these three cards or knows of their whereabouts, kindly let me know, even if the cards are not for sale or trade, as I would love to at least see pics of them.\n\nBack to my search for a T216 KNGO of Jennings. In August 2006, Mastro auctioned a lot of 10 SGC-graded T216 cards with Kotton backs, including a Jennings. Unfortunately, the Mastro auction catalog listing (see pic below) did not show the backs of these 10 cards - just the fronts. I understand this lot of 10 cards was broken up and the cards sold individually on eBay in January 2007. Thanks to very helpful Net54 members, I have learned where several of these 10 Kotton cards currently reside, but not the Jennings card. The exciting news is that all of these Kotton cards that I have tracked down have the KNGO back!! This leads me to hope that the Jennings card from this Mastro auction lot also has the KNGO back! Please help me locate this Jennings card, and if it has the KNGO back, I'm willing to trade my first born for it.  :)",
      "post_time": "20230601T15:07:49-06:00",
      "timestamp": "1685653669"
    },
    {
      "post_id": "2344597",
      "post_title": "",
      "post_author_name": "Rhotchkiss",
      "post_content": "Val, if there is a VE, then KNGO should exist, right - Where there is one there should be the other? \n\nAnyway, good luck. I will keep an eye out \n\nPerhaps you can start a thread on the main page re the back run, the different Kotton variations and the connections between certain Kotton backs and other backs- it is informative, relevant for main page, and would get more eyeballs",
      "post_time": "20230601T17:03:44-06:00",
      "timestamp": "1685660624"
    },
    {
      "post_id": "2344648",
      "post_title": "",
      "post_author_name": "ValKehl",
      "post_content": "Ryan, thanks for your comments and suggestion. FYI, I have no specific knowledge re the T216 cards, and the only T216s in my collection are the Jenningses and a KNGO of another player. I did not know that if a VE of a player exists, then a KNGO of this player should also exist. Because of this, I wouldn't feel comfortable starting a T216 thread on the main board. I feel this is better left to a collector of the T216 set.",
      "post_time": "20230601T22:38:19-06:00",
      "timestamp": "1685680699"
    },
    {
      "post_id": "2344715",
      "post_title": "",
      "post_author_name": "ullmandds",
      "post_content": "good luck val.  I love your run almost as much as mine!!!!  T216 mild and sweet was my white whale for years.  Those t216's are tough esp whern you want/need a specific back.",
      "post_time": "20230602T08:50:20-06:00",
      "timestamp": "1685717420"
    },
    {
      "post_id": "2344780",
      "post_title": "",
      "post_author_name": "Casey2296",
      "post_content": "Good luck on your hunt Val, I'll keep my eyes peeled.  I too am looking for a Kotton Bender white cap \"Not in Trust\" for my back run, hopefully they'll pop up at some point.",
      "post_time": "20230602T11:45:27-06:00",
      "timestamp": "1685727927"
    }
  ]
}