{
  "id": "119138",
  "forum_id": "13",
  "title": "Off to REA 1911 T205 Johnson SGC 7",
  "author": "Pup6913",
  "reply_count": 2,
  "view_count": 455,
  "created_date": null,
  "last_reply": "20100101T15:28:32-06:00",
  "posts": [
    {
      "post_id": "771497",
      "post_title": "Off to REA 1911 T205 Johnson SGC 7",
      "post_author_name": "Pup6913",
      "post_content": "Due to a family medical emergency I have to sell this to cover the bills coming.  I am self employed and only have major medical which is picking up a very small part of the ER visit and other stuff.  I may also be selling a few more if this is not enough to cover it.\n\nThis card is low POP with only one higher and one the same. \n\nI would like to sell the card for $12000 with shipping and all that jazz.  You are welcome to make me a reasonable offer.  Please PM me if interested.  \n\nAndrew",
      "post_time": "20091230T17:49:20-06:00",
      "timestamp": "1262220560"
    },
    {
      "post_id": "771550",
      "post_title": "Andrew",
      "post_author_name": "cfc1909",
      "post_content": "you still have time for the REA deadline and the hospital will wait for payment-you can send them $100 a month until you get a check in June-\n\nyou could probably even work out some kind of deal where you can get some money now and the rest in June. Go to the REA website and get the phone number and call Rob -you wont regret it and you will get top dollar for your card.\n\nyou might also ask Rob to have SGC review the card-an 86 would be killer and you may get that if REA sends SGC the card.\n\nMy best wishes for you and your family",
      "post_time": "20091230T19:51:51-06:00",
      "timestamp": "1262227911"
    },
    {
      "post_id": "771945",
      "post_title": "",
      "post_author_name": "Bosox Blair",
      "post_content": "[quote name=\"cfc1909\" post=771550]you might also ask Rob to have SGC review the card-an 86 would be killer and you may get that if REA sends SGC the card.[/QUOTE]\n\nHi Jim,\n\nI agree with your advice to Andrew in general, but I recall reading an interview with Rob Lifson where he said as a matter of policy REA will not re-submit graded cards.  I think it has something to do with the fact that the auction house serves both the bidder and the seller...so applying his pressure to get a higher grade is acting contrary to interest of his bidders.\n\nCheers,\nBlair",
      "post_time": "20100101T15:28:32-06:00",
      "timestamp": "1262384912"
    }
  ]
}