{
  "id": "113312",
  "forum_id": "13",
  "title": "Very tough t210-3 Morris available -- only horizontal pose in t210 series!",
  "author": "shammus",
  "reply_count": 0,
  "view_count": 1351,
  "created_date": null,
  "last_reply": "20090616T20:34:11-06:00",
  "posts": [
    {
      "post_id": "730259",
      "post_title": "Very tough t210-3 Morris available -- only horizontal pose in t210 series!",
      "post_author_name": "shammus",
      "post_content": "Very tough and desireable t210 Morris available for sale or trade.  The card itself almost never comes up and is quite difficult to find even though Series 3 isn't known for having too many difficult cards.  This card is unique as it's the only t210 in any of the eight series to feature a horizontal pose.\n\nThe card itself is in VGish condition with one small, faint wrinkle.  Very little wear otherwise and the back is clean and damage free.  \n\nI'd definitely trade for anything off of my wantlist.  Right now, 1918 Zeenuts are of the most importance to me.  If no trade opportunities arise, I'd also sell the card for $800.  Here's my wantlist....\n\nw590 - Spencer, Ruth\nd311s (need 33) - Agnew, Arrelanes, Berry, Burrell, Byram, Castleton, Chadbourne, Christian, Daley, Danzig, Delhi, Delmas, Dillon, Gregory, Harkness, Heister, Holland, Howard, Kuhn, LaLonge, Lewis, Maggert, Mohler, Murray, O’Rourke, Pearce, Ryan, Stamfield, Steen, Tennant, Thompson, Van Buren, Wares\nt210 orange borders - need any\neunc orange borders (need 18) - Bergen, Bradley, Chase, Criger, Davis, Devlin, Doolan, Gibson, Laporte, Lord, McConnell and Miller....\n1911 Zeenuts - Bernard, Lindsay, Melchoir, Rapps, Ryan SF, Seaton, Smith SF\n1918 Zeenuts - need any\n1919 Zeenuts (need 11) - Lane (oak), Pinelli (sac), Prough (sac), Vance (sac), Spencer (saltlake), Seaton (SF), Smith, Bill (SF), Snell (SF), Arbuckle (Vern), Check (Vern), Meusel (vern)\nt207 napoleon backs\nt209-2s\n1920 zeenuts\n\nThanks in advance,\nBrian\n[url]redmaccie@hotmail.com[/url]\n\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=1720&d=1245205378[/IMG]",
      "post_time": "20090616T20:34:11-06:00",
      "timestamp": "1245206051"
    }
  ]
}