{
  "id": "114138",
  "forum_id": "13",
  "title": "Looking for any specific T206 Southern Leaguers?",
  "author": "Adam",
  "reply_count": 2,
  "view_count": 515,
  "created_date": null,
  "last_reply": "20090803T14:45:15-06:00",
  "posts": [
    {
      "post_id": "736298",
      "post_title": "Looking for any specific T206 Southern Leaguers?",
      "post_author_name": "Adam",
      "post_content": "I have made it my goal to thin out the duplicates I have of various T206 Southern Leaguers over the next few weeks.  If anyone is looking for any specific SLer (in the good to very good condition range), please feel free to shoot me an email with the player names you may be interested in, and I will respond to you before I make a formal For Sale posting on Net 54!  (I do not have a list of my duplicates, so please don't ask for one . . . I am sadly not that organized of a collector and do not have any plans to change my ways!)\n\nRegards,\nAdam\nEmail:  [url]aamoniz@yahoo.com[/url]",
      "post_time": "20090715T15:23:28-06:00",
      "timestamp": "1247693008"
    },
    {
      "post_id": "739519",
      "post_title": "",
      "post_author_name": "Adam",
      "post_content": "I just sent what I think is the last of the emails that were awaiting a response from me in my attempt to help fill any T206 SLer holes that board members have (based on SLer dupes I own).\n\nIf anyone emailed me with a list of SLers they would be interested in purchasing and has not heard back from me, sorry, please shoot me another email!  Otherwise I will make a general post consisting of the remaining SLer dupes I have tomorrow night and will just sell them first come first serve.\n\nRegards,\nAdam\n[url]aamoniz@yahoo.com[/url]",
      "post_time": "20090802T16:16:00-06:00",
      "timestamp": "1249251360"
    },
    {
      "post_id": "739633",
      "post_title": "",
      "post_author_name": "Gradedcardman",
      "post_content": "Email sent",
      "post_time": "20090803T14:45:15-06:00",
      "timestamp": "1249332315"
    }
  ]
}