{
  "id": "197073",
  "forum_id": "13",
  "title": "FS: T3 posters; 1935 Chicle added",
  "author": "rainier2004",
  "reply_count": 4,
  "view_count": 475,
  "created_date": null,
  "last_reply": "20151219T08:53:25-06:00",
  "posts": [
    {
      "post_id": "1345486",
      "post_title": "FS: T3 posters; 1935 Chicle added",
      "post_author_name": "rainier2004",
      "post_content": "Hello gang, I’d really like to thank everyone for all the support given in this project and even the folks that have just checked in from time to time. It has been more work and more enjoyable than anticipated so I decided to try another round. Today I have 2 more posters to offer for sale being the T3 and 1933 Goudey sets. They are a continuation of the 2 previous posters I offered previously; the 1915 Cracker Jack and master e107 set seen here: [url]http://www.net54baseball.com/showthread.php?t=192560[/url]\n\n\n\nI now have available both a T3 complete set poster and also a 1933 Goudey complete set poster. Both are full color printed in CYMK and printed in the same 24” x 30” size as were the first posters. The e107 and CJ posters were designed to be able to trim the borders for a 22” x 28” opening, the T3 and 33G were not designed to do that, and they will work in any standard 24”x30” frame. These are printed on styrene, the same material previously used. Styrene is a plastic that is supposed to be more durable in general and specifically to exposure to light over time. The e107, Cracker Jack, T3 and 1933 Goudey posters are all currently available.\n\n\n\nShipping: \nAll orders include basic shipping, snail mail, but I want to offer first class shipping USPS for an additional $7. The e107, Cracker Jack, T3 and 1933 Goudey posters are all currently available and you want you but would also like to add the 1st class shipping, the total would be $52. International orders will need to contact me. All posters will be shipped on or before Thanksgiving weekend and I will try to follow up with every collector.\n\nPrice: \nEach poster is $45 and includes basic shipping. A second poster of any kind is an additional $30 totaling $75. The e107, Cracker Jack, T3 and 1933 The e107, Cracker Jack, T3 and 1933 Goudey posters are all currently available.\n\nI am offering a set of all 4 with first class shipping for $125. If you would like another package that is not already mentioned feel free to ask me, I am sure we can work something out. Also, I need an address in the payment and what poster you would like plus additional shipping if it applies.\n\nPrice\nPrices are $45 for the first poster and that included basic shipping. You can add a 2nd poster of $30 ($75 total), add a third for another $30 ($105 Total)or get the 4 poster set for $125 with 1st class ship included. If you would like to upgrade from the standard and included basic shipping, please include another $7.If you use PP goods for payment please add 3% to your total. \n\nPayment:\nI accept anything; pp is easiest and quickest for me. Contact me for an address if you using check or MO, pp can be made at [url]stevensuckow@hotmail.com[/url]. If you are using goods then add another 3% to the total, if using the friends option there will be no additional charge. International orders will need to contact me. Also, I need an address in the payment and what poster you would like plus additional shipping if it applies.\n\nCustom PostersI am now doing custom poster jobs as well and am willing to try and make your vision come to life. This is a bit of work but could do custom posters of your own collection, rarities, combo sets together in one poster. I am open to ideas or even trades.\n\nUp Next:The Monster…yes the t206 poster with all 36 backs is my next challenge. This will be released with a 1914 Cracker Jack poster. I need more ideas for real posters, sets need to be at least 100 or they are just too small. \n\nMy GuaranteeI am doing this because I like this work; I like the people I am meeting and the correspondence that is a direct result from my work. I guarantee to treat each person with respect, follow through with all I promise and generally try and take care of each person. If you ever have any concerns or questions please contact me at [url]stevensuckow@hotmail.com[/url]. I also have several references if anyone needs anything. I appreciate everyone who shares a thought and especially those that have shared pictures of my posters hanging in their homes. Thanks for looking gang and happy holidays!",
      "post_time": "20141117T18:54:38-06:00",
      "timestamp": "1416275678"
    },
    {
      "post_id": "1346175",
      "post_title": "",
      "post_author_name": "EvilKing00",
      "post_content": "Idea for a poster..,... How about the t205's",
      "post_time": "20141119T19:30:11-06:00",
      "timestamp": "1416450611"
    },
    {
      "post_id": "1346754",
      "post_title": "",
      "post_author_name": "rainier2004",
      "post_content": "Hey gang, weekend bump on the thread for adding another poster.\n\nI should be off to the printers Monday so please LMK if you want any posters as the holidays are approaching us fast.  I can work with ya on multiples and if you want all 5 I can definitely deal.\n\nThanks gang.",
      "post_time": "20141121T18:38:43-06:00",
      "timestamp": "1416620323"
    },
    {
      "post_id": "1350068",
      "post_title": "",
      "post_author_name": "rainier2004",
      "post_content": "Alright guys, they are here and should go out tomorrow.  I have a few left of each poster if anyone is interested.",
      "post_time": "20141201T17:14:08-06:00",
      "timestamp": "1417479248"
    },
    {
      "post_id": "1483145",
      "post_title": "",
      "post_author_name": "pawpawdiv9",
      "post_content": "Sent Pm about other additions, WIsh i had asked months ago about maybe the T206 you mentioned in another thread and perhaps a 1952 topps for us postwar guys too.\nI love to obtain both of these, if they come out like the others posted here.\nWould made great xmas gifts for sure. Maybe next time. Starting to like the Goudey one tho as well. Perhaps hook me up with one of those.",
      "post_time": "20151219T08:53:25-06:00",
      "timestamp": "1450540405"
    }
  ]
}