{
  "id": "114789",
  "forum_id": "13",
  "title": "WTT:  Horrific condition 1909 Obak horizontal Martinke",
  "author": "Anthony S.",
  "reply_count": 3,
  "view_count": 340,
  "created_date": null,
  "last_reply": "20090807T20:05:26-06:00",
  "posts": [
    {
      "post_id": "740718",
      "post_title": "WTT:  Horrific condition 1909 Obak horizontal Martinke",
      "post_author_name": "Anthony S.",
      "post_content": "I feel like I need to soften the blow by adding a few words before you see the actual card.  Acquired this in trade a few months back and have recently upgraded to a card with multiple creases.  The bottom 1/4 inch of this card is gone, all the way across.  Tho it does measure properly lengthwise, so you got that going for you.  The edges on the back appear singed.  I also think it figured out how to use my Visa card.  The card is, however, authentic, and being a horizontal is one of the toughies in a tough set.  Ideal for the collector with limited space.  I'm hoping to trade it for a 1909 Obak in horrific condition which I don't have yet (see list below).  If your card is less horrific, I could toss some cash in.  My email:  [url]boboinnes33@gmail.com[/url]\n\nWANTLIST:  Bernard, Brackenridge, Coy, Easterly, Gandil (yeah right), W. Hogan, Jansing, LaLonge, Mundorff, Nagle, Nelson, Reidy, Speas, Whalen, Willett, J Williams",
      "post_time": "20090807T13:54:50-06:00",
      "timestamp": "1249674890"
    },
    {
      "post_id": "740730",
      "post_title": "",
      "post_author_name": "GrayGhost",
      "post_content": "Good luck sir. That card is HORRIFIC:o\n\nIf you can't trade it, consign to Coach's corner, and they'll have it graded by one of their fly by night grading companies they use. American star grading, or some such crap, and it'll come back Excellent plus..",
      "post_time": "20090807T14:31:10-06:00",
      "timestamp": "1249677070"
    },
    {
      "post_id": "740743",
      "post_title": "",
      "post_author_name": "Anthony S.",
      "post_content": "Popped it out of a PRO 8 holder.",
      "post_time": "20090807T15:00:08-06:00",
      "timestamp": "1249678808"
    },
    {
      "post_id": "740821",
      "post_title": "",
      "post_author_name": "B O'Brien",
      "post_content": "Dang, that is one messed up card!  I love it and must own it.  Let me know when you want to take some cash for it.  It will fit nicely into my beater line.\nThanks,\nBob\n[url]upperhandisforemost@yahoo.com[/url]",
      "post_time": "20090807T20:05:26-06:00",
      "timestamp": "1249697126"
    }
  ]
}