{
  "id": "163391",
  "forum_id": "13",
  "title": "WTT T207 for T206",
  "author": "Clark7781",
  "reply_count": 2,
  "view_count": 247,
  "created_date": null,
  "last_reply": "20130212T20:41:54-06:00",
  "posts": [
    {
      "post_id": "1087614",
      "post_title": "WTT T207 for T206",
      "post_author_name": "Clark7781",
      "post_content": "All:\n\nI'm starting to get back into actively pursuing the MONSTER after the events of my life the past few years.  I now find myself with some time to dedicate to one of the joys of my life.  With that being said, I have re-evaluated my collecting and have decided to only focus on T206s and T205s right now.  I am getting rid of most of my other cards to free up some funds to go after the MONSTER.\n\nI have a number of Recruit cards that I'm going to try to move first.  They are mostly commons and lower grade, but thought I would see if anyone out there would be interested in an even trade of these three specifc cards for your T206s.  I would prefer SGC graded cards (I'll take commons, beaters, authentics, etc) in trade, but will take PSA or raw.  I have a list of the cards I need for the set that I can email people.  My email is [url]paulehawk3@gmail.com[/url]\n\nHere are the three cards offered for trade:\n\n[IMG]http://i7.photobucket.com/albums/y283/Clark7781/Lotof3T207RecruitCards.jpg[/IMG]\n\nThe John Kling card appears to have a small crack on the bottom edge of the holder on the back.  Other than that the holders are fine.  The cards are as graded with no paper loss on the reverse.\n\nEmail me any offers anyone might be interested in.\n\nThanks,\n\nPaul",
      "post_time": "20130212T14:16:37-06:00",
      "timestamp": "1360703797"
    },
    {
      "post_id": "1087666",
      "post_title": "",
      "post_author_name": "Clark7781",
      "post_content": "Although I posted this as a trade, I will sell these together or individually.  PM me so we can talk.",
      "post_time": "20130212T16:13:33-06:00",
      "timestamp": "1360710813"
    },
    {
      "post_id": "1087803",
      "post_title": "",
      "post_author_name": "Clark7781",
      "post_content": "The Kling is SPF.",
      "post_time": "20130212T20:41:54-06:00",
      "timestamp": "1360726914"
    }
  ]
}