{
  "id": "118620",
  "forum_id": "13",
  "title": "Wanted 18 T207s to finish the set",
  "author": "Sixtofan",
  "reply_count": 2,
  "view_count": 288,
  "created_date": null,
  "last_reply": "20091214T11:47:18-06:00",
  "posts": [
    {
      "post_id": "767418",
      "post_title": "Wanted 18 T207s to finish the set",
      "post_author_name": "Sixtofan",
      "post_content": "Still need these to finish the set, some tough - some not so tough.  all help appreciated:\nBauman\nCarrigan \nCicotte\nDavis (blue C on cap)\nDonlin\nDonnelly\nFournier\nKelly\nLange\n Irving Lewis (no emblem on sleeve)\nIrving Lewis (emblem on sleeve)\nLivingston (little C on shirt)\nRoy Miller\nWard Miller\nMogridge\nMullin (D on cap)\nRasmussen",
      "post_time": "20091212T18:47:10-06:00",
      "timestamp": "1260668830"
    },
    {
      "post_id": "767493",
      "post_title": "Re: Davis",
      "post_author_name": "frohme",
      "post_content": "Hi David,\n\n   Good luck with your last 18 - that list looks very familiar.  You may have read various threads here regarding the [URL=\"http://www.network54.com/Forum/153652/thread/1108020415/T207+Davis+blue+C\"]Davis \"blue C\"[/URL] variation.  I'm sorry I missed seeing that image, but those I consider experts deferred on that thread and agreed that it exists.  I think the jury was out on \"variation\" or print freak, but I struck it from my list - as I think most of the new set listings have done.\n\nBest.\n--\nMike",
      "post_time": "20091213T07:14:16-06:00",
      "timestamp": "1260713656"
    },
    {
      "post_id": "767766",
      "post_title": "",
      "post_author_name": "tbob",
      "post_content": "David if you are just interested in completing the set, you can scratch the Davis Blue C and also the Lewis no emblem. Everyone I know considers the set complete with just one Lewis and you are going to find the Lewis emblem on sleeve easier to obtain as the no emblem is a killer. If you want the master set, go for the Lewis no emblem but realize unless you have incredibly good luck AND a wad of dough, that one will probably be unobtainable.\nThe others you mention are generally the toughest to find. All are obtainable though, provided you have some luck and some money to spend. I would recommend trying to find them even in P-F and then upgrade later and sell your original lower grade card.\nGood luck in your endeavor and I will mention to you that every card you list (minus the Lewis no emblem) has been on ebay for sale recently or in an auction so you can find them if you hunt.\ntbob",
      "post_time": "20091214T11:47:18-06:00",
      "timestamp": "1260816438"
    }
  ]
}