{
  "id": "117853",
  "forum_id": "13",
  "title": "FT: T206 Home Run Baker BL460 SGC 20",
  "author": "Kotton King",
  "reply_count": 1,
  "view_count": 523,
  "created_date": null,
  "last_reply": "20091118T18:04:41-06:00",
  "posts": [
    {
      "post_id": "762522",
      "post_title": "FT: T206 Home Run Baker BL460 SGC 20",
      "post_author_name": "Kotton King",
      "post_content": "I've been toying with the idea of trading my T206 Home Run Baker with a Broadleaf 460 back.  The grade is an SGC 20.  There are 2 known Baker BL460's and this is the highest graded.  The other is an SGC 10 with extensive back damage.  BL460's are scarce, but getting one with a HOFer front is quite difficult.  They rarely come up for sale.  \n\nI've included a front/back scan, high resolution scans, and a close up scan of the card.\n\nI'm open to listening to trade offers.  Particularly I'm looking for any T216's I don't own (especially MINO, Virginia Extras, and Kotton Type 3 backs and HOFers), and any E94 I don't own (would prefer purple).  The E94's I own are: Bates, Chance, Crawford, Davis, Jennings, Magee, and Moore.  Other possibilities are: E98 Cobb, E95 Cobb, E90-1 Cobb, E90-1 Speaker, E93 Matty, Wagner (throwing and batting), E95 Plank, T215 Red Cross HOFer, T211 Red Sun (mid-grade).  \n\nI'm not looking to sell the card, just possibly trading it for the right deal.  And for an absolute blockbuster deal, I would trade this BL460 Baker and a T206 Jennings (both hands) w/UZIT back PSA 2.  Scans of the Jennings are available upon request.  The Jennings is not available any other way.\n\nIf interested send me an email: [url]crazylocomerk@yahoo.com[/url] \n\n[IMG]http://i282.photobucket.com/albums/kk264/crazylocomerk3/For%20Trade/1909-11T-206BakerHomeRunBroadleaf46.jpg[/IMG]\n\n[IMG]http://i282.photobucket.com/albums/kk264/crazylocomerk3/For%20Trade/T206BakerBL460Front.jpg[/IMG]\n\n[IMG]http://i282.photobucket.com/albums/kk264/crazylocomerk3/For%20Trade/T206BakerBL460back.jpg[/IMG]\n\n[IMG]http://i282.photobucket.com/albums/kk264/crazylocomerk3/For%20Trade/T206BakerBL460highresscan.jpg[/IMG]",
      "post_time": "20091118T16:38:27-06:00",
      "timestamp": "1258587507"
    },
    {
      "post_id": "762534",
      "post_title": "Trading",
      "post_author_name": "teetwoohsix",
      "post_content": "email sent",
      "post_time": "20091118T18:04:41-06:00",
      "timestamp": "1258592681"
    }
  ]
}