{
  "id": "140827",
  "forum_id": "13",
  "title": "Fs: The most expensive overpriced t206 card on ebay, super rare tough blazer.. Wow !",
  "author": "broadhurstinc",
  "reply_count": 29,
  "view_count": 2412,
  "created_date": null,
  "last_reply": "20110828T10:22:03-06:00",
  "posts": [
    {
      "post_id": "919291",
      "post_title": "Fs: The most expensive overpriced t206 card on ebay, super rare tough blazer.. Wow !",
      "post_author_name": "broadhurstinc",
      "post_content": "Thats right... I now hold the top spot and have the most expensive overpriced t206 card on ebay, please read the description:\n\n[url]http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=300591118106&ssPageName=STRK:MESE:IT[/url]\n\nIf you buy it now i'll throw in a new flugal valve and full case of blinker fluid for you car !\n\nI can also offer you some other great deals: A uncut sheet of 1000 t206 wagner cards with drum backs, prime waterfront property in florida, a real baby sasquatch or an older loch ness monster that has plenty of life left in him - u chose or package deal for both (don't let them try to play with eachother cuz bad things happen), a delorean time machine with new flux capacitor, money tree that grows huge gold coins and other misc items i keep locked in my basement.\n\nThanks for looking",
      "post_time": "20110822T18:03:03-06:00",
      "timestamp": "1314057783"
    },
    {
      "post_id": "919302",
      "post_title": "",
      "post_author_name": "atx840",
      "post_content": "PM sent for flux capacitor.",
      "post_time": "20110822T18:53:51-06:00",
      "timestamp": "1314060831"
    },
    {
      "post_id": "919314",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "Chris,\nThe flux capacitor is yours.\n\nIf anyone else is interested in the delorean time machine it is now in need of a flux capacitor or some other source of power that can produce 1.21 gigawatts and the left rear tire is bald.",
      "post_time": "20110822T19:43:09-06:00",
      "timestamp": "1314063789"
    },
    {
      "post_id": "919433",
      "post_title": "",
      "post_author_name": "Ease",
      "post_content": "How much for the real baby sasquatch?",
      "post_time": "20110823T08:23:46-06:00",
      "timestamp": "1314109426"
    },
    {
      "post_id": "919460",
      "post_title": "Nessie",
      "post_author_name": "White Borders",
      "post_content": "Is the Loch Ness Monster authenticated?  (I got burned on a fake Nessie a couple years ago.  I should've known better - the guy said he found while cleaning out his grandfather's attic!)  :D\n\nBest Regards,\nCraig",
      "post_time": "20110823T10:51:16-06:00",
      "timestamp": "1314118276"
    },
    {
      "post_id": "919464",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "Eric,\nFor the baby sasquatch I was looking for 1 MILLION DOLLARS in either unmarked $1 bills in a black briefcase with attached handcuff which i prefer so i can be a hit at the strip bar or could just be a single 1 million dollar bill.. I have to warn you tho, it's a pain in the ass to find shoes for him and he is an elusive little bastard.. it sometimes takes hours to find him in the basement.. oh and he humps everything in sight but he's cute as hell.",
      "post_time": "20110823T11:02:24-06:00",
      "timestamp": "1314118944"
    },
    {
      "post_id": "919488",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "Craig,\n\nI know the guy your talkin about.. he screwed me too, gave me the same story.. at first when i opened the box he looked legit but once he started flyin around breathing fire i knew it was a plain old common dragon... sound familiar.. ? hopefully you got rid of him before he burned your house to the ground.. i wasn't so lucky.. oh well live and learn.. \n\nThis nessie is the real deal, webbed feet and no fire spitting, hooked him myself while fishin at lochness. I did send him to PSA but they called and said they had no doubt he was real but didn't have a holder he would fit in properly and sent him back raw, however i found out later through the grapevine that when he was there he realized they were going to try to put him in a cabinet card holder and undergrade him so he ate the grader. I confronted them about it but PSA refused to comment on it, supposedly there is more to the story tho.. i found out the grader that was eaten was the same guy who graded all the psa 6's i have tried to cross that have come back trimmed so i don't feel bad now... idk maybe SGC ?\n\nRite now i keep him in my genie lamp cuz he takes up too much space otherwise. My genie isn't too happy about it but it's his own fault.. i have 1 more wish he owes me, i tried wishing for more wishes but he refused so until i figure out what i want they are lampmates.",
      "post_time": "20110823T12:24:34-06:00",
      "timestamp": "1314123874"
    },
    {
      "post_id": "919500",
      "post_title": "good stuff guys",
      "post_author_name": "Leon",
      "post_content": "Very good stuff guys. I love it. And actually that card is super nice and some collector will love it, albeit at a bit less price (hence the make an offer).....Humor is always good...please keep it up!!!  (like she said)",
      "post_time": "20110823T12:48:18-06:00",
      "timestamp": "1314125298"
    },
    {
      "post_id": "919613",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "[quote name=\"Leon\" post=919500]Very good stuff guys. I love it. And actually that card is super nice and some collector will love it, albeit at a bit less price (hence the make an offer).....Humor is always good...please keep it up!!!  (like she said)[/QUOTE]\n\nyes forum owners have the power to do whatever they please \nThis is what he really wrote first before he changed it:\n\n[quote name=\"Leon\" post=919500]Very good stuff guys. I love it. And actually i love that card is super sexy nice and i wanna make it mine so i can breed it with an o'hara and make lots and lots of baby o'demmitts and some collector will love it, albeit at a bit less price (hence the make an offer).....Humor is always good...please keep it up!!!  (like she said)[/QUOTE]\n\nAhhhhhh... All peasant/forum slaves, Hail and bow down to thy master.. The great peasant/forum owner Leon has graced my thread.. better known by female peasant/forum slaves around the world as peasant/forum owner Leon The Great Mighty Giant Horned Barbarian Wizard King of the Testosterone Gods in bed.... (if u say that's wat she said no one will believe u.. i tried) Nothin for nothin Leon but this is my forum slave thread and it's a little unappropriate to be barging in and proclaiming your undying true love for my most ridiculously expensive overpriced t206 card on ebay... idk if the breeding thing will work but nonetheless i feel the love in your words and it touches my soul so it's yours for what i paid for it + 6 pack of guiness but no flugal valve or case of blinker fluid cuz that stuff is hard to come by and not cheap.. i'm sure you don't want them anyway.. it is common knowledge that peasant/forum owners have similiar incomes as brain surgeons and rocket scientists so one of your many assitants i would imagine handles petty vehicle maintenance items.. do you even have a car ? every time i recall u makin a public appearance you arrive in ur private jumbojet - forumforce 1 and then get swarmed by women but have never seen u arrive in a car... don't jumbojets get shity gas mileage ? What am i saying ??? what do you care about fuel mileage..you wipe you ass with $100's .... before u deny it may i remind u i have the video but rest assured i don't show it to anyone.. the original and only copy is locked in my safe inside the genie lamp. Nessie, myself and the genie are the only beings that have viewed the tape, No worries tho, Nessie can't talk and without me knowing it, that little scumbag genie made me use my first wish to swear him to secrecy about it, all ways remember to watch what u say to a genie.. if u spent the last couple thousand years stuck in a lamp with your only purpose being to get passed around granting 3 wishes to every tom dick and harry that rubs your lamp, you'd be a little synical too so they get a kick out of tricking u and then rubbing ur face in it.. yea funny..  so i used my 2nd and wished nessie would stay in the lamp until i wished my 3rd and final wish.. guess who's laughin now..  ain't that miserable little funny man in the lamp....",
      "post_time": "20110823T19:34:56-06:00",
      "timestamp": "1314149696"
    },
    {
      "post_id": "919617",
      "post_title": "",
      "post_author_name": "scooter729",
      "post_content": "That post was only missing references to tiger blood and warlocks, and we could have finally confirmed that Charlie Sheen is a board member!\n\nBest of luck with the overpriced sale!",
      "post_time": "20110823T19:49:13-06:00",
      "timestamp": "1314150553"
    },
    {
      "post_id": "919624",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "Ok fine but i'm not buyin it Chris.. Just tell me the real reason ??? No one uses a flux capacitor to make margaritas... that's a little overkill buddy.. seriously u could have all of canada wasted on margaritas in an hour.. all of ireland closer to 2 hrs..\n\nChris, don't read any further cuz below is what everyone else can read but not you.. talk to ya later  \n\nIf anyone can tell me why Chris really needs a flux capacitor without a time machine please enlighten me. flux capacitors were designed specifically to power stainless steel bodied 80's sportscar time machines which at the time i thought looked cool but now not too crazy about them, that's why i'm selling it, doesn't do it for me anymore. the only thing i can think is after a long nite of drinking margaritas and illegal after midnight canadian goose tipping, someone pulled the ole' \" Yea you can make Any card a 649 overstrike, alls u need is a flux capacitor dude \" line and he fell for it.. that makes sense.. 1.21 gigawatt margarita maker.. no",
      "post_time": "20110823T20:13:47-06:00",
      "timestamp": "1314152027"
    },
    {
      "post_id": "919633",
      "post_title": "",
      "post_author_name": "atx840",
      "post_content": "You are on to me, I have a delorean. I want to go back in time and help you find the Schlei",
      "post_time": "20110823T20:43:41-06:00",
      "timestamp": "1314153821"
    },
    {
      "post_id": "919634",
      "post_title": "",
      "post_author_name": "White Borders",
      "post_content": "[quote name=\"broadhurstinc\" post=919613] ...  every time i recall u makin a public appearance you arrive in ur private jumbojet - forumforce 1 and then get swarmed by women ...[/QUOTE]\n\nYeah, right.  Leon swarmed by women?  Nobody's gonna believe THAT!\n\nEdited to let everyone know this is my last post ... just got a PM from Leon that I'm getting banned for not believing that he get's swarmed by women!\n\nBest Regards,\nCr---\n\n:D",
      "post_time": "20110823T20:44:46-06:00",
      "timestamp": "1314153886"
    },
    {
      "post_id": "919636",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "[quote name=\"atx840\" post=919633]You are on to me, I have a delorean. I want to go back in time and help you find the Schlei[/QUOTE]\n\nAhhh.. That was my 2nd guess, that may be the only way.. i never imagined anything could be harder to find than a baby saquatch untill i searched for the elusive schlei.. come to think of it i had the baby sasquatch at the office for \"bring your baby sasquatch to work day\" i'll shake him down when i get home.. if he has it i'll get it, he breaks under pressure when confronted. i'll let u kno tmorrow..",
      "post_time": "20110823T20:57:04-06:00",
      "timestamp": "1314154624"
    },
    {
      "post_id": "919638",
      "post_title": "",
      "post_author_name": "atx840",
      "post_content": "No need to go back, I bought a nice 649 OP rubber stamp on t206museum.com. Barely used.",
      "post_time": "20110823T21:05:15-06:00",
      "timestamp": "1314155115"
    },
    {
      "post_id": "919655",
      "post_title": "",
      "post_author_name": "3-2-count",
      "post_content": "Kris your a marketing genius!! Pushing 600 views and counting. This thread should never die!! Great card and an even better seller.",
      "post_time": "20110823T22:08:49-06:00",
      "timestamp": "1314158929"
    },
    {
      "post_id": "919803",
      "post_title": "",
      "post_author_name": "hanksta",
      "post_content": "I think you listing could use a bit more pazazz like this guy...\n\n[url]http://www.ebay.com/itm/ROLLS-ROYCE-CAR-KING-IRAN-WHICH-PALACE-/350481790227?pt=LH_DefaultDomain_0&hash=item519a57b513[/url]",
      "post_time": "20110824T15:47:50-06:00",
      "timestamp": "1314222470"
    },
    {
      "post_id": "919805",
      "post_title": "",
      "post_author_name": "Doug",
      "post_content": "Personally I'd like to call dibs on the money tree that grows the huge gold coins since nobody else jumped on it yet. I figure after a few good harvests I'd be able to afford to go through with my plan to buy all of the Sasquatches and flux capacitors on eBay and corner the market... :D",
      "post_time": "20110824T16:03:08-06:00",
      "timestamp": "1314223388"
    },
    {
      "post_id": "920052",
      "post_title": "",
      "post_author_name": "JohnP0621",
      "post_content": "Maybe you can sell the Sasquatch and Nessie to Topps and they can cut them up into little pieces and insert them into their next card series.....\nOnly a suggestion..",
      "post_time": "20110825T11:58:45-06:00",
      "timestamp": "1314295125"
    },
    {
      "post_id": "920067",
      "post_title": "pleeeeeezzzzeeee",
      "post_author_name": "Leon",
      "post_content": "[quote name=\"JohnP0621\" post=920052]Maybe you can sell the Sasquatch and Nessie to Topps and they can cut them up into little pieces and insert them into their next card series.....\nOnly a suggestion..[/QUOTE]\n\nMy new slogan for Net54baseball\n\n\nDon't MESS with NESS :eek:.",
      "post_time": "20110825T12:56:43-06:00",
      "timestamp": "1314298603"
    },
    {
      "post_id": "920070",
      "post_title": "...",
      "post_author_name": "usernamealreadytaken",
      "post_content": "nevermind...",
      "post_time": "20110825T13:16:24-06:00",
      "timestamp": "1314299784"
    },
    {
      "post_id": "920686",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "[quote name=\"scooter729\" post=919617]That post was only missing references to tiger blood and warlocks, and we could have finally confirmed that Charlie Sheen is a board member!\n\nBest of luck with the overpriced sale![/QUOTE]\n\nHey Scott,\nThanks but when peasant/forum owner card lust in the air.. luck is but a question of when..  Leons words of pure desire and odd but wonderful card  procreation dreams have been felt deeply by collectors worldwide, i'm sure in usual character he's gonna try to give me double or triple the all ready ridiculously overpriced price however i will refuse it so he can direct the funds toward better uses such as loaning o'bama even more money which ok, yes, seems and is a complete waste but what the hell, it's only money.. odss are Leon's pocket change may eventually enable this twit to bring \"change\" i didn't say odds are good.. Even the vast monetary reserves of Leon's pockets may only be able to birth a even better campaign slogan like \" CHANGE.. HELLS YEA MAYBE BABY!\" idk what the outcome but feel a true heaping shitload of luck will be necesary.. \n\nAs for carlos i'm quite certain his energy is focused elsewhere these days and some things are just best left unconfirmed... i have a strong position on the tiger's blood and every warlock looks as though he will rip ur arm from the socket but at the end of the night when the bar gets out they all want an afterparty at your house and end up cryin about thier horrible past relationships as the sun is coming up.. i'm not saying all but every one i have partied with are emotional disasters and depressing to be around at that point.. it's annoying during sunrise or whenever so i don't let them come over anymore, i try to aviod them completely now but when they ask i just tell them my dragon burned my house down yesterday so no afterparty tnite and they stumble away depressed and wasted searching for someone to be thier free therapist and torture endlessly.\n\nif by chance u see email me ur # (kris@broadhurstindustries.com), had sum Winning to report.. my ball & chained personal hip mounted andriodian wee little black box of communications updated and lost everyones fone# i despise talkin to - Winning !... along with those i enjoy verbaly spanking repeatedly on how my lion blood is such of the King of all land predators and yea havin tiger blood is badass too.. just a little pussier than Lion's.. i still owe u for stealing that gold digging pirate whore of an exgirlfriend.. i told u she was a bitch.. talk soon.. Kris",
      "post_time": "20110827T06:28:39-06:00",
      "timestamp": "1314448119"
    },
    {
      "post_id": "920712",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "[quote name=\"White Borders\" post=919634]Yeah, right.  Leon swarmed by women?  Nobody's gonna believe THAT!\n\nEdited to let everyone know this is my last post ... just got a PM from Leon that I'm getting banned for not believing that he get's swarmed by women!\n\nBest Regards,\nCr---\n\n:D[/QUOTE]\n\nHey Leon ! holy shit ! quick turn around and look behind you ! o'bama has both hands in your pockets while he's getting a foot massage from a kinda ugly lookin thai hooker ! \n\nOK Now that i have oh so cleverly distracted the great Leon, time is of the essence.. come hither my fellow peasant/forum slaves and type the secret code to access and view the following message below which i have written in the secret invisible forum slave text on ancient self destructing digital papyrus paper so we can keep it on the down/low and fly well below our peasant/forum owners radar to bid farewell to the now banned Craig and at all costs avoid vaporization..  \n\n Craig,.\ncan't say i didn't see that coming, i'll give u this, u got balls man. good thing u didn't get vaporized.. whew.. i'll take a banning over vaporization any day. Where u gettin banned to ? hopefully just the peasant/forum slave dungeon and not the dreaded peasant/forum owners hot & sweaty hard labor factory.. aka \"the secret sexy breeding facility\" which no man has ever returned from. This is a wild guess but i take it u didn't get the underground peasant/forum slave memo that was goin around forever about just humoring him... pretty sure everyone knows what the dealio is there.. i just can't believe ur not vaporized rite now from that post.. thank goodness.. hopefully it's a dungeon banning u got which ain't so bad.. i break in there a couple nites a week cuz honestly it's the best party in town, some crazy shit goes down there late nite and a good time is had by all thanks to willy's moonshine. u can't miss him, 90 sumthin year old guy who's been chained by the neck to the wall at the end of d block/cave for like 50 years or so. he has two lazy eyes and can't see shit out of either, the biggest buck teeth i have ever seen, and something that appears to be a third testicle growing on the side of his forhead. Even tho he can't see for shit he can sense when someone is staring and he gets all self concious about it, he's pretty cool tho and makes kickass moonshine. I once asked why he was doin time and he started twitchin furiously and then exposed his terrets syndrome. I asked around but no one knows why he's there so don't bother asking unless ur lookin for a cheap laugh.. i nearly pissed myself when he had the terrets fit... \n\nWe are all prayin to the forum gods your destiny does not lie within the forsaken walls of the factory. Less is known of the secret sexy breeding facility than is even known of the production of T206's. If your fate is so written, all i can offer in the lines of advice is: if the soap hits the floor just leave it and finish showerin soapless.. it is rumored that when vintage sports cards are horny they don't take no for an answer so please be careful. Hopefully i'll se ya next thursday for happy hour in the dungeon, if so around 2 am i'll disguise my voice to pretend i'm a cop which makes him nervous as hell and then make him give a sobriety test so u can see him try to follow my finger with 2 lazy eyes.. it seriously never gets old..  We will all be waitin on the outside for ya buddy, hang in there !\n\nThis ancient digital paprus paper will self destruct in 3.. 2.. 1.. pooofff",
      "post_time": "20110827T08:37:16-06:00",
      "timestamp": "1314455836"
    },
    {
      "post_id": "920735",
      "post_title": "",
      "post_author_name": "BleedinBlue",
      "post_content": "So much for keeping the forum politics free. Must be nice living in a world where you are so damn righteous and history begins in 2009.",
      "post_time": "20110827T09:49:04-06:00",
      "timestamp": "1314460144"
    },
    {
      "post_id": "920769",
      "post_title": "",
      "post_author_name": "npa589",
      "post_content": "I don't know about anyone else, but I'm rather sick of seeing all of this on the BST page.\n\nI was ignoring it until it became rather vile, disgusting, and downright pathetic.\n\nJust my worthless 2 cents.",
      "post_time": "20110827T12:24:27-06:00",
      "timestamp": "1314469467"
    },
    {
      "post_id": "920782",
      "post_title": "Bst",
      "post_author_name": "Marty",
      "post_content": "Same here...",
      "post_time": "20110827T12:59:45-06:00",
      "timestamp": "1314471585"
    },
    {
      "post_id": "920809",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "Me Three",
      "post_time": "20110827T14:31:15-06:00",
      "timestamp": "1314477075"
    },
    {
      "post_id": "920912",
      "post_title": "",
      "post_author_name": "broadhurstinc",
      "post_content": "[quote name=\"npa589\" post=920769]I don't know about anyone else, but I'm rather sick of seeing all of this on the BST page.\n\nI was ignoring it until it became rather vile, disgusting, and downright pathetic.\n\nJust my worthless 2 cents.[/QUOTE]\n\nTenor Nate,\nwonderful to hear from you again.. sorry i missed your post. it was just a little line between the others cuz i still had you on my block/ignore members list from the last time you posted in a thread of mine. I just unblocked you so i could view your contribution to my new thread here and to my surprise it was just what i was hoping for.  I’m a little busy at the moment with my new uninvited friend hurricane irene blowin two trees down at my neighbors house so i have to go fire up the chainsaws & excavator to clear his driveway but as soon as i have a sec I’ll post my sincere apologies for your concerns and express how valuable your opinion is to me. i am very excited and looking forward to it.\n Just because I am soo fond of you i will place a rating of PG-13 (some adult content) on the thread title and my initial post as I should have in the beginning to properly warn u and other likeminded sensitive, underage, or underprivileged individuals who may be challenged in the appreciation of any specific or all types of humor. \nStay Dry..",
      "post_time": "20110828T00:46:49-06:00",
      "timestamp": "1314514009"
    },
    {
      "post_id": "920917",
      "post_title": "Hear ye ! Hear ye !",
      "post_author_name": "broadhurstinc",
      "post_content": "HEAR YE ! HEAR YE ! let it be known from the greatest of ocean depths to the highest of mountain tops that lie within this great peasant/forum country that some things cannot be explained and there is absolutely nothing wrong with anyone overlooking the obvious and actually taking any portion of this most ridiculous basically meaningless  bst thread seriously... It doesn’t make you a bad person or a weenie, it just means you are “special” if you don’t believe me or don't get it still, ask your mom who may be the only one that can tolerate you and she will explain it better over milk and cookies while rubbing your upset tummy.\n\nWe will now return you to the regularly scheduled purpose of this thread and reply to posts in the order they were submitted.\nThanks for tuning in.\n\nThis announcement was sponsored by, \nBroadhurst Industries. \nFabricators of Industrial Metal Products and meaningless but amusing stories to help break  the doldrums of the daily grind since 1946. \nGod Bless America\n\nDisclaimor: It is never our intention to hurt feelings or make grown men cry, but if they ask for it, we enjoy it thoroughly.",
      "post_time": "20110828T02:01:21-06:00",
      "timestamp": "1314518481"
    },
    {
      "post_id": "920968",
      "post_title": "thread",
      "post_author_name": "freakhappy",
      "post_content": "This thread is tired...very tired (yawn)",
      "post_time": "20110828T10:22:03-06:00",
      "timestamp": "1314548523"
    }
  ]
}