{
  "id": "121857",
  "forum_id": "13",
  "title": "Large Series 5 group of 41 cards for sale! -- PRICE LOWERED!",
  "author": "shammus",
  "reply_count": 1,
  "view_count": 749,
  "created_date": null,
  "last_reply": "20100503T19:16:12-06:00",
  "posts": [
    {
      "post_id": "791247",
      "post_title": "Large Series 5 group of 41 cards for sale! -- PRICE LOWERED!",
      "post_author_name": "shammus",
      "post_content": "Very nice start to one of the tougher high-series sets.  This large group of 41 series 5 t210s gives you about half the set.  Many of the cards are very nice too....not really any \"dogs\" in this lot.  In addition, many of the tougher cards in the set are included in this group.  There's even a couple cards in this lot that don't have any cards graded by SGC or PSA, and several more than only have an example or two.  So, there's some very tough cards here to try to find individually.  \n\nAsking $1650 for the group.  I'm also willing to consider trade offers for anything of value.  I would consider splitting cards up from the rest of the group but only if it would be in trade for something off of my wantlist (ie...e103s, t204s, 1918 Zeenuts, etc...)\n\nThanks guys,\nBrian\n[url]redmaccie@hotmail.com[/url]\n\nAbercrombie FR/GD - wrinkle across middle, some back damage \nAverett GD - no wrinkling, some back damage\nBigbie FR/GD - wrinkle in corner, some back damage\nBrannon GD/VG - corner chipping, no wrinkling/creasing, damage free on back\nBrazell GD - wrinkle across middle, tiny nick on back\nBrent FR - heavier crease across middle\nBullock GD - no wrinkling, some back damage\nCorbett VG - very nice, no wrinkling on front.  No back damage\nCoutts FR/GD - nice VG/EX on front, small areas of damage on back\nL. Cross GD - faint corner wrinkle, residue on back\nCrouch VG - mild corner chipping, no wrinkling, no damage on back\nDerrick GD/VG - vg/ex w/ no wrinkling on front, bits of residue and a nick on back\nEhrhardt FR - VG on front, no wrinkling, some back damage\nFairbanks GD - no wrinkling on front, two small areas of wear on back\nFinn GD - VG+ on front, no wrinkling, tiny spot of damage on back\nFrancisco GD/VG - wrinkle free and nice on front, mild residue on back\nGardin FR/GD - very nice front, no wrinkles, a couple tiny areas of damage on back\nGilmore GD - great catcing pose, mild corner wear on front, mostly clean back\nGorman FR/GD - wrinkle across middle, some back damage\nGuss GD - no wrinkling, some back damage\nHarrington FR - a couple tiny wrinkles, some back damage\nHartley GD - no wrinkling, tiny spot of damage on back\nHumphrey FR - corner chipping, one wrinkle, mostly clean and damage free on back\nJackson GD - nice wrinkle free front, tiny spot of damage on back\nJenkins FR - corner/edge chipping, no wrinkling, tiny dots of wear on back\nLaval FR/GD - very nice on front, no wrinkling...tiny areas of damage on back\nLothrop GD - wrinkle free front, tiny spot of damage on back\nMangum GD - wrinkle free front, tiny spot of damage on back\nJ. McCarthy GD - no wrinkling, very nice front, two tiny spots of damage on reverse\nMcFarlin GD - terrific pose, no wrinkling and great looking front.  Mild residue and wear on reverse\nMidkiff PR/FR - still a displayable card but has a couple wrinkles on front with some mild wear on reverse\nMoore FR/GD - faint corner wrinkle, residue and tiny areas of wear on back \nReis FR - missing left border, couple spider wrinkles on front, tiny areas of wear on reverse\nSmith GD - VG/EX on front, no wrinkling and mostly sharp corners, couple areas of wear on reverse\nTemplin PR/FR - wrinkling, corner wear, couple scrapes on back\nThrasher FR - corner wear, no wrinkling, a couple scrapes on back\nWalters FR - wrinkling on front, back mostly clean and damage free\nWehrell VG - a bit of edge chipping, no wrinkling, back mostly clean and damage free\nWilliams FR/GD - mild corner chipping, no wrinkling, some reside/scuffing on back\nWynne FR/GD - no wrinkling, some reside/scuffing on back\nWysong GD - faint pencil mark on front, no wrinkling, mostly clean and damage free on back",
      "post_time": "20100318T10:06:09-06:00",
      "timestamp": "1268928369"
    },
    {
      "post_id": "804683",
      "post_title": "",
      "post_author_name": "shammus",
      "post_content": "Price lowered to $1650 delivered.  Thanks much!\nBrian",
      "post_time": "20100503T19:16:12-06:00",
      "timestamp": "1272935772"
    }
  ]
}