{
  "id": "266186",
  "forum_id": "13",
  "title": "Auction Houses - Any Recommendations?",
  "author": "Batjac1",
  "reply_count": 3,
  "view_count": 478,
  "created_date": null,
  "last_reply": "20190224T18:02:10-06:00",
  "posts": [
    {
      "post_id": "1857791",
      "post_title": "Auction Houses - Any Recommendations?",
      "post_author_name": "Batjac1",
      "post_content": "Hi Guys,  This is my first time back in about 4 years.  You folks did me solid back then when I had that apparently one of a kind T206 Crandall with the UZIT back.  The advise I got on this forum was indispensable.  I am thinking of auctioning the remainder of the collection.  As you may remember I am not a collector, but I spent a lot of time on this forum, and got educated in the hobby and actually had a lot of fun doing it here.  I am about to retire, and would like to see the remainder of these cards in the hands of folks that will appreciate, enjoy, and safeguard them in the future.  Just looking for some direction and opinions as to where I stand the best chance of getting the most exposure auction wise.  There are:\n\n102 T205\n  44 T206\n    7 T201\n    1 T210\n    2 E91B\n    1 E92\n    4 E98\n    5 E101\n    1 T227\n    1 T51\n    1 T49 \n\nYour opinions and guidance is requested.  Thanks again!",
      "post_time": "20190224T10:00:04-06:00",
      "timestamp": "1551027604"
    },
    {
      "post_id": "1857799",
      "post_title": "",
      "post_author_name": "Peter_Spaeth",
      "post_content": "I think the answer might depend on whether they are graded, condition, HOFers or commons, etc.",
      "post_time": "20190224T10:16:47-06:00",
      "timestamp": "1551028607"
    },
    {
      "post_id": "1857818",
      "post_title": "",
      "post_author_name": "x2drich2000",
      "post_content": "[quote name=\"Peter_Spaeth\" post=1857799]I think the answer might depend on whether they are graded, condition, HOFers or commons, etc.[/QUOTE]\n\n100% agree.  You could easily be looking at $10/card or $100+/card and who to recommend would vary accordingly.",
      "post_time": "20190224T11:31:07-06:00",
      "timestamp": "1551033067"
    },
    {
      "post_id": "1857910",
      "post_title": "",
      "post_author_name": "kmac32",
      "post_content": "I have used Heritage for a couple of collections in my family. No issues and reasonable commissions.  Also wide exposure for the items.  REA is also great to deal with in my opinion but have only used them from the buyers side.  Al at Love of the game is a fair guy and very reputable.  Also like Steriling but smaller audience.  Just depends on what you have and condition.\n\nKmac",
      "post_time": "20190224T18:02:10-06:00",
      "timestamp": "1551056530"
    }
  ]
}