{
  "id": "146664",
  "forum_id": "13",
  "title": "t206 reprints?",
  "author": "jefferyepayne",
  "reply_count": 7,
  "view_count": 364,
  "created_date": null,
  "last_reply": "20120125T19:46:50-06:00",
  "posts": [
    {
      "post_id": "959858",
      "post_title": "t206 reprints?",
      "post_author_name": "jefferyepayne",
      "post_content": "I'm pretty new to collecting t206's and don't yet know how to detect reprints for this set.  Are there some known characteristics of t206 reprints you can easily spot?  (different details on the back, different color shades, etc.)  Or do you always need to go to more sophisticated methods and have the card in hand? \n\nI was looking at this lot, for instance, and have no clue whether these cards are legitimate. \n\n[url]http://www.ebay.com/itm/130632818986?ssPageName=STRK:MEWAX:IT&_trksid=p3984.m1423.l2649[/url] \n\nIn general I stay away from ebay lots that don't allow returns but thought this was a good example lot to analyze.\n\n\nthanks,\n\njeff",
      "post_time": "20120125T05:20:24-06:00",
      "timestamp": "1327494024"
    },
    {
      "post_id": "959863",
      "post_title": "",
      "post_author_name": "sandmountainslim",
      "post_content": "That lot looks genuine to me.  \nI am a novice collector also but I have learned most reprint T206 have the wrong color ink for the player names and teams.  As best I can see it's the proper brown on those cards.",
      "post_time": "20120125T05:48:12-06:00",
      "timestamp": "1327495692"
    },
    {
      "post_id": "959864",
      "post_title": "",
      "post_author_name": "Blitzu",
      "post_content": "Hi Jeff,\n\nThe photos aren't that high in resolution but I would say they all appear to be genuine based on the colors, fonts and overall combinations of front to backs.  Most reprints have backs that don't line up with the player on the front, and the colors are normally off.  The discolorations on some of the cards match what is commonly found on these cards.  Also the damage and appearance of some of the cards is also what's considered normal for the period. \n\nI think it's a great set with a large variety of HOFer's and a fantastic representation of the more common backs... including that one Sovereign 460 which is actually a fairly tough back.\n\nLooks like that set also includes nearly a complete set of all the Sweet Caporal variations too. It's hard to say because of the resolution and not being able to read the factories, but it's clear there are the overprints, and all the varieties from the 150, 350, and 350-460 series.  Very nice!\n\nTake a look at this site for more information about spotting fakes.\n\n[url]http://www.sellbaseballcards101.com/baseball-cards/how-to-spot-counterfeit-t206-tobacco-cards-part-i-font[/url]\n\nI usually can tell just by seeing them right away... but best thing to do is get a few of the real ones that you can handle (low grade beat up ones) and you'll start to see how unique they really are.  It's also important to know all the variety of backs and what they should look like.  Know all the colors because they're all unique to the specific company.  Fakes are usually in black and white or the color is wrong.  The font in the names on the front are usually the best give away too.  The printing is very specific for that era, and get acquainted with the norm. Finally the smell and overall look is another immediate sign.  The card should smell old, and possibly have a tobacco smell still to it.  This isn't always the case, especially with some of the nicer quality cards but it shouldn't be glossy, or have any sheen to it, front or back.  The printing on the fronts are also not that high of quality on the real ones... that's why you should grab one or two cheaply graded real ones, or ones you know came from a reputable seller to see what I mean.  Up close they're really not that fine of printing but they have a certain character to them.\n\n\nHope this helps.\n\nJared",
      "post_time": "20120125T05:52:59-06:00",
      "timestamp": "1327495979"
    },
    {
      "post_id": "959903",
      "post_title": "",
      "post_author_name": "dougscats",
      "post_content": "Hi, Jeff.\n\nClassic question.\nBack in the early 2000's, Ray Piskadlo told me there were four basics to look for in distinguishing genuine T206's from reprints.  As I remember:\n\nThe ink for the player's name is always brown [this can range greatly, however, from faded/light brown to blackish-brown];\nthe type-size of the player's name and team are different;\nthere must be borderlines around the picture, and these borderlines are distinctly drawn in ink, distinct from the player-image.\n\nI can't remember the fourth point, though.\n\nOne thing I'd add, as advised by Dr. Cycleback [I trust you've visited his branch on Net54, Detecting Card Alteration and Reprints]: Get yourself a pocket microscope [inexpensively available on ebay], and look at the cards under that.  The old [lithograph?] printing is quite beautiful sometimes and can't be replicated by modern machines.  Also, you'll see how the ink-drawn lines are much darker at the edges where the ink coagulates.\nDr. Cycleback also says that general impressions count a lot: If you get a sense that something isn't right about a card, it probably isn't.  \n\nAs to that bunch you're looking at, I was looking at them earlier [I need Karger] and never gave a thought as to them not being genuine.\n\nGood luck.\n\nDoug",
      "post_time": "20120125T08:25:16-06:00",
      "timestamp": "1327505116"
    },
    {
      "post_id": "959924",
      "post_title": "",
      "post_author_name": "iwantitiwinit",
      "post_content": "Seller puts this in the body of his sales write-up; \"I am confident they are real, as they were purchased with a great quantitiy of very nice, legit vintage cards.  But, I can't say for sure and a few may be reprint\"!!!!! \n\nI would stay away.",
      "post_time": "20120125T09:07:24-06:00",
      "timestamp": "1327507644"
    },
    {
      "post_id": "959928",
      "post_title": "",
      "post_author_name": "dougscats",
      "post_content": "Wow!\nCall me embarrassed!\nI didn't even read that, the seller's disclaimer [I broke a primary rule].\nThe cards still look good, but I'd never disregard such a disclaimer--that's a big red flag!--and, based on it, I'd be skeptical of these cards.\n\nRed-faced,\n\nDoug",
      "post_time": "20120125T09:18:35-06:00",
      "timestamp": "1327508315"
    },
    {
      "post_id": "959947",
      "post_title": "",
      "post_author_name": "Blitzu",
      "post_content": "I read that too but I think it's just an attempt to cya.  \n\nThose are fairly good reprints if indeed they are. Never hurts to ask for higher resolution scans.  I wouldn't discount the bidding based on that statement alone. Btw, I have no affiliation with this seller, and I'd tell you in a heart beat if I thought this was a scam or possibly sham cards.",
      "post_time": "20120125T10:36:29-06:00",
      "timestamp": "1327512989"
    },
    {
      "post_id": "960202",
      "post_title": "",
      "post_author_name": "jefferyepayne",
      "post_content": "Thanks all for the thoughts and pointers.  I'll dig through all of this and be better prepared the next time a lot like this shows up.\n\njeff",
      "post_time": "20120125T19:46:50-06:00",
      "timestamp": "1327546010"
    }
  ]
}