{
  "id": "311053",
  "forum_id": "13",
  "title": "T204 Ramly catchers",
  "author": "Vintagecatcher",
  "reply_count": 3,
  "view_count": 475,
  "created_date": null,
  "last_reply": "20220220T17:52:43-06:00",
  "posts": [
    {
      "post_id": "2168061",
      "post_title": "T204 Ramly catchers",
      "post_author_name": "Vintagecatcher",
      "post_content": "Looking to purchase T204  Ramly catchers. Prefer VG-EX condition.\n\nAlready have: Cliff Blankenship, Bill Carrigan, Lou Criger, Patrick Donahue, Red Kleinow, George Schlei, and Gabby Street.\n\nCan purchase outright or I have plenty of trade items.\n\nThanks,\n\nPatrick",
      "post_time": "20211125T10:22:43-06:00",
      "timestamp": "1637860963"
    },
    {
      "post_id": "2196286",
      "post_title": "Still looking for T204 catchers",
      "post_author_name": "Vintagecatcher",
      "post_content": "It's been a very slow start to the year for me.\n\nHoping to add a few T204 catchers this year.\n\nLooking for clean fronts. OK with back damage.\n\nList of current T204s on previous post.\n\nThanks.\n\nPatrick",
      "post_time": "20220212T16:00:29-06:00",
      "timestamp": "1644706829"
    },
    {
      "post_id": "2198520",
      "post_title": "",
      "post_author_name": "benge610",
      "post_content": "No longer available\n; sold at the show this weekend; 03/12/22.\nDean's Dugout Show, Naperville, IL.\n\nI know that it is not in the \"VG-Ex\" category but I asked my son to send me pics of his Archer that I added to his collection many years ago. (A Dad taking care of his little kid)\nEvery good post needs pics! (lol)\nOne of the many things I love about this group; we can share our passion for our hobby; coming at it from all directions, all perspectives. I tend to drift towards battery mates; Ol' Jimmy Archer was three Finger Brown's mate, at one time.\n\nAlways looking to travel back to my days as a kid; trades are cool.\nI am into, right now (looking for):\nE91A; J. Collins, Bresnahan, Tinker, Evers, Brown.\nE98: Meyers (Orange), Vaughn (Orange, Red),\nAny Brownie; I am a member of \"The St. Louis Brown's Historical Society\" group on Facebook; love to impress the group, lol.\nBeing a Cubbie fan from way back; battery mates of Chicago Nationals.\nAnything, Hank Aaron; my Dad was a Braves fan; when they won the '57 WS, era.\nToo much more to list; just my current hunts.\n\n\n[IMG]https://www.net54baseball.com/picture.php?albumid=1393&pictureid=32791[/IMG]\n\n[IMG]https://www.net54baseball.com/picture.php?albumid=1393&pictureid=32792[/IMG]\n\nBen\n\n\"I love baseball history backstory; especially when it involves cards.\"\n\nSuccessful transactions with: Casey2296, Jacklitsch, wolf441, shepbuckman, seablaster, Bridwell. brianp-beme, hatchetman325, quinnsryche, joejo20, Brian Van Horn, Thromdog, Webster, shammus.",
      "post_time": "20220220T11:20:14-06:00",
      "timestamp": "1645381214"
    },
    {
      "post_id": "2198613",
      "post_title": "",
      "post_author_name": "rjackson44",
      "post_content": "Pretty",
      "post_time": "20220220T17:52:43-06:00",
      "timestamp": "1645404763"
    }
  ]
}