{
  "id": "224989",
  "forum_id": "13",
  "title": "Gold Borders - Pick Your Price",
  "author": "frankbmd",
  "reply_count": 1,
  "view_count": 301,
  "created_date": null,
  "last_reply": "20160704T21:23:31-06:00",
  "posts": [
    {
      "post_id": "1558235",
      "post_title": "Gold Borders - Pick Your Price",
      "post_author_name": "frankbmd",
      "post_content": "I'm offering four graded T205 Gold Border cards.\n\nYou are invited to buy 1, 2, 3 or 4 cards.\n\nThere are therefore 15 possible combinations of cards you may want.\n\nBelow you will find scans of the four cards.  Please note that Murray is a Fact 42 reverse for what it's worth.\n\nAfter looking at the scans, decide which card(s) you want to purchase.\n\nBelow the scans are the prices for the 15 different combinations of cards.\n\nSelect the price that you think is correct for the combination you select.\n\nAll prices include shipping.  If you select the correct price for the cards you want, a discount of up to five dollars will be applied to your order.  The more cards you buy the larger the discount.\n\nSo starting with the scans\n\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/gold-borders/10736/evans[/IMG]\n\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/gold-borders/10741/kroh[/IMG]\n\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/gold-borders/10745/murray[/IMG]\n\n[IMG]http://www.collectorfocus.com/images/show/frankbmd/gold-borders/10757/wilson[/IMG]\n\nNow you have seen the scans.  Feel free to ask questions about the cards.\nWhen you are ready to select a card or cards, look at the price list and select your price.  You will only get one try for the discounted price.  I will notify you by PM what your final price will be.  Please understand that an attempt to obtain the discount by picking a price is considered an order whether you get the discount or not.  What form of harsh punishment will be used if you back out has not yet been determined.\n\nHere are the prices in whole dollars payable net to me.\n\n82\n39\n121\n40\n123\n76\n159\n74\n38\n84\n119\n49\n86\n72\n111\n\n\nI reserve the right to update the price grid if a sale of less than 4 cards occurs.",
      "post_time": "20160704T20:51:03-06:00",
      "timestamp": "1467687063"
    },
    {
      "post_id": "1558248",
      "post_title": "",
      "post_author_name": "Bliggity",
      "post_content": "Frank - the Murray is a 25, not a 42.",
      "post_time": "20160704T21:23:31-06:00",
      "timestamp": "1467689011"
    }
  ]
}