{
  "id": "115611",
  "forum_id": "13",
  "title": "FS: T200 Fatima Pirates Team Card incl Honus Wagner Likely Trimmed But Very Nice $200",
  "author": "packs",
  "reply_count": 3,
  "view_count": 1495,
  "created_date": null,
  "last_reply": "20091014T02:43:48-06:00",
  "posts": [
    {
      "post_id": "746598",
      "post_title": "FS: T200 Fatima Pirates Team Card incl Honus Wagner Likely Trimmed But Very Nice $200",
      "post_author_name": "packs",
      "post_content": "Hey guys,\n\nUp for sale is a very appealing T200 Pittsburgh Pirates team card. It has been graded a 6 by a company called NASA, although it appears to me that the bottom border has been trimmed. I definitely can't guarantee the card will get a 6 from another company, but I will guarantee that the card will grade authentic. Aside from the trimmed border, the card is virtually problem free. I don't see any creases in the card, just a few slight bends along the top edge that don't break the surface of the card. The back of the card is absolutely problem free, devoid of any stains, marks, or paper loss. Overall the card still portrays a crisp, clear image and the card remains very attractive despite a possible trim. Honus looks great. I'm looking to sell the card for $200 but am open to any and all offers.\n\nJust wanted to add that the stray lines you see in the scan are scratches to the holder and are not on the surface of the card.\n\ne-mail: [url]rare_baseballstuff@yahoo.com[/url]\n\n[IMG]http://s107.photobucket.com/albums/m294/madjams/fatima.jpg[/IMG]",
      "post_time": "20090831T17:14:52-06:00",
      "timestamp": "1251760492"
    },
    {
      "post_id": "747222",
      "post_title": "",
      "post_author_name": "packs",
      "post_content": "Bump for price reduction",
      "post_time": "20090902T14:46:18-06:00",
      "timestamp": "1251924378"
    },
    {
      "post_id": "747737",
      "post_title": "",
      "post_author_name": "packs",
      "post_content": "Bump for price reduction",
      "post_time": "20090904T15:14:07-06:00",
      "timestamp": "1252098847"
    },
    {
      "post_id": "755609",
      "post_title": "ignore the grade, its still a nice card!",
      "post_author_name": "bh3443",
      "post_content": "Ahhhhhhh  remember the countless other grading companies? We were haunted by Champ's grading here in the Northeast section of the US.\ng ideas and a get rich quick scheme was his idea and those deals seldome work ou\nI recall his first customer. This nice college aged guy had 10 Griffey rookie cards that were ok, probably 7's s! But the Chump's, I MEAN CHAMP'S guy slabbed them ALL 10's! They were decent, but the scratches on the hologram made them 7's or 8's!\n\nNow the customer was soooooooooooooooooooo happy and wanted the SCD graded card price. I'm not sure what he did with them, but he was not happy to say the least! \n\nThe Champ's guy bought a grading machine and a ton of arrow head holders but dissapeared soon after this show of mine in Mass. I heard he set up in Tyson's Corner, Va and packed it in shortly after that. But the hobby must have thousands of over-graded Chamops cards. \n\nIn closing, he knew 2 numbers, 1 and zero and  liked to combine them for grades! Sad but true! So, let's hear of your local shiester grading companies! \n\n\nThanks,\nBill in Mass.",
      "post_time": "20091014T02:43:48-06:00",
      "timestamp": "1255509828"
    }
  ]
}