{
  "id": "153881",
  "forum_id": "13",
  "title": "Piedmont, Polar Bear, Recruit coupons + others",
  "author": "T3s",
  "reply_count": 1,
  "view_count": 451,
  "created_date": null,
  "last_reply": "20120717T18:25:46-06:00",
  "posts": [
    {
      "post_id": "1014491",
      "post_title": "Piedmont, Polar Bear, Recruit coupons + others",
      "post_author_name": "T3s",
      "post_content": "Available are a few coupons issued during the T206 era.  Nice companion pieces to our precious cardboard.  Here are a few notes:\n\nNone of these coupons mentions baseball cards, as you can see from the scans.\n\nPolar Bear - I have coupons showing expiration dates of June 09, 10, 11 & 12.  Otherwise they are all similar.  If you have a preference, please let me know.  I am asking $7 each for these.\n\nPiedmont (white) - I have coupons showing expiration dates of June 09, 10 & 11.  Otherwise they are similar.  If you have a preference, please let me know.  I am asking $5 each for these.\n\nPiedmont (pink) - AJ Reach League Baseball offer - asking $10 each\n\nRecruit - asking $3 each for these\n\nI have many other brands available:  Fatima, Union Leader, Murad, Mecca, Duke's Mixture, Sensation Cut Plug, Big John Plug Cut, Egyptienne Straights, Sweet Caporal, Miner's Extra, Five Brothers, Col Longleaf, Omega Plug Cut, John J Bagley, Brotherhood Cut Plug, Red Man, Blue Hen, High Card, Day & Night, Pinkerton, Frishmuths, I Lewis Cigar, Karnak, Turkish Trophies, Picnic\nTwist.\n\nMost are simply coupons to send in for catalogue items.  However, a few of the Fatimas are for the big B32 felts, the Murad are for the T6s, I have one Pinkerton for the T5 series and the Turkish Trophies are for the T7-6 Flag Girl series.\n\nYou can email me, or pm me.  I have several of the ones in the scans, some are better quality than others.  First come, first serve.  Paypal gift is welcome.  If using a SASE, please deduct $0.50 from your total.  Thanks !!!\n\nHappy Collecting,\nCraig",
      "post_time": "20120715T15:05:38-06:00",
      "timestamp": "1342386338"
    },
    {
      "post_id": "1015293",
      "post_title": "",
      "post_author_name": "T3s",
      "post_content": "BUMP - thanks",
      "post_time": "20120717T18:25:46-06:00",
      "timestamp": "1342571146"
    }
  ]
}