{
  "id": "135445",
  "forum_id": "13",
  "title": "Chain Trade: T206 \"Large Ass\" Buck Herzog (Old Mill)",
  "author": "abothebear",
  "reply_count": 4,
  "view_count": 1232,
  "created_date": null,
  "last_reply": "20110414T16:21:30-06:00",
  "posts": [
    {
      "post_id": "885184",
      "post_title": "Chain Trade: T206 \"Large Ass\" Buck Herzog (Old Mill)",
      "post_author_name": "abothebear",
      "post_content": "Hey everyone,\n\nI picked up this Herzog beater thinking it would be fun to trade it.  Check it out and send me (PM) your trade offers.  I don't have anything in particular in mind that I want in return other than it be old.  Mostly this is for the fun of trading.  Obviously this Herzog is not \"worth\" much so I am not looking for any particular level of return value either.   Although, lately, this recently discovered, ultra-rare, \"large ass\" variation of the Old Mill Boston Herzog has been receiving Wagner-like buzz in some circles.  So you may want to get in on the ground floor of this wave.  \n\nThe rules for the trade are this:  \n- Large Ass Herzog must be made available for trade again upon receipt.  \n- He may be traded for multiples, but must not be traded with any other card.\n- He travels with a log book (which I will put together) that must be updated with dates and traded for info.\n- The traded for item(s) must remain confidential (except for those with current log book access) even to past owners.  If you want to know of LAH's travels you have to trade for him.\n- You must take a picture of yourself with LAH and post it on the site (if this first trade happens I'll start a thread for owner pics).\n- You must re-post these rules when you make it available for trade.  \n\n[IMG]https://static.wixstatic.com/media/5f27b7_51ae6f2ca17346a6a68849e15547dab8~mv2.jpg[/IMG]\n\n[IMG]https://static.wixstatic.com/media/5f27b7_b9b1847860ae4d3589f9cc5386754449~mv2.jpg[/IMG]\n\n.",
      "post_time": "20110408T11:52:12-06:00",
      "timestamp": "1302285132"
    },
    {
      "post_id": "885237",
      "post_title": "Rules Added",
      "post_author_name": "abothebear",
      "post_content": "I updated the original post with trade rules.",
      "post_time": "20110408T15:44:18-06:00",
      "timestamp": "1302299058"
    },
    {
      "post_id": "885989",
      "post_title": "",
      "post_author_name": "abothebear",
      "post_content": "4 days left to get your trade offers in.  I'm going on vacation next week so I want to close this out in time to get in in the mail before I leave.",
      "post_time": "20110411T14:19:56-06:00",
      "timestamp": "1302553196"
    },
    {
      "post_id": "885996",
      "post_title": "",
      "post_author_name": "milkit1",
      "post_content": "Email sent",
      "post_time": "20110411T15:03:54-06:00",
      "timestamp": "1302555834"
    },
    {
      "post_id": "886803",
      "post_title": "24 hours left",
      "post_author_name": "abothebear",
      "post_content": "24 hours left to get your trade offers in.  Otherwise you'll have to wait and try and entice the next owner.   \n\nSean had a great idea to take our pictures in front of local landmarks, so I went down to the State Capitol Building and got a good one.  I'll post it after the trade.",
      "post_time": "20110414T16:21:30-06:00",
      "timestamp": "1302819690"
    }
  ]
}