{
  "id": "161889",
  "forum_id": "13",
  "title": "T206 Oakes \"White Team Letters\"",
  "author": "sreader3",
  "reply_count": 10,
  "view_count": 885,
  "created_date": null,
  "last_reply": "20130121T23:45:35-06:00",
  "posts": [
    {
      "post_id": "1076385",
      "post_title": "T206 Oakes \"White Team Letters\"",
      "post_author_name": "sreader3",
      "post_content": "Hi All,\n\nI am gauging interest in the below depicted T206 Oakes “White Team Letters” card.  This particular card has never been offered to the hobby advertised as such.  The white team letters are a byproduct of the red ink layer having been completely missed.\n\nThe card is what I would call a “freak cubed.”  First, instead of the bold red “CINCINNATI” that we all are accustomed to seeing on Oakes’ jersey, this card has SNOWY WHITE team letters.  There is no residual pink tint that is sometimes seen on missing red ink specimens.  Second, this card has a near mint appearance (having been downgraded to PSA 4 due to back staining) which distinguishes it from the typically lower grade missing red ink examples that appear at auction every once in a while.  Third, Oakes is a T206 subject that hardly ever seen missing red ink.\n\nI have juxtaposed the “White Team Letters” Oakes with the common “Red Team Letters” Oakes for comparison.\n\nFeel free to PM any serious offers.\n\nThanks.\n\nScot",
      "post_time": "20130120T19:56:55-06:00",
      "timestamp": "1358737015"
    },
    {
      "post_id": "1076401",
      "post_title": "",
      "post_author_name": "Jantz",
      "post_content": "Nice card Scot!\n\n\nJantz",
      "post_time": "20130120T20:25:19-06:00",
      "timestamp": "1358738719"
    },
    {
      "post_id": "1076403",
      "post_title": "",
      "post_author_name": "freakhappy",
      "post_content": "Wow!  I double that jantz...that's a real beauty!  Sharp corners to boot!\n\nGood luck on the sale!",
      "post_time": "20130120T20:26:47-06:00",
      "timestamp": "1358738807"
    },
    {
      "post_id": "1076486",
      "post_title": "",
      "post_author_name": "obcmac",
      "post_content": "I was one of the underbidders on that one.  I would have went higher...but I didn't like the staining on the back...as some solvents/adhesives make colors disappear.  I thought it looked pretty neat though...congrats.\n\nMac",
      "post_time": "20130121T05:53:19-06:00",
      "timestamp": "1358772799"
    },
    {
      "post_id": "1076577",
      "post_title": "",
      "post_author_name": "sreader3",
      "post_content": "Jantz, Mike--Thanks for the comments.\n\nMac--If you are somehow suggesting that solvents are responsible for the missing red ink on this card you are wrong.  The back staining appears to be nothing more than the result of the card having been mounted and carefully removed from an album at some point, which also explains why the corners are so nice.\n\n(edited to say:  Mac--Let me revise and extend my remarks and say that I am merely skeptical of your take on this card.  I am not a PhD chemist.  If a known adhesive applied to the back of a card can through chemical reaction remove all of the red ink from the front of the card without otherwise disturbing the front of the card in any way, shape or form then perhaps that is what happened here.  But if that is the case I wonder why we haven't seen T206 doctors churning out missing red ink cards by the dozens.)",
      "post_time": "20130121T10:05:05-06:00",
      "timestamp": "1358787905"
    },
    {
      "post_id": "1076606",
      "post_title": "",
      "post_author_name": "Runscott",
      "post_content": "You could fix that so easily with some red water color.  Wonder if anyone every touched up T206's that way?",
      "post_time": "20130121T11:05:35-06:00",
      "timestamp": "1358791535"
    },
    {
      "post_id": "1076610",
      "post_title": "",
      "post_author_name": "t206blogcom",
      "post_content": "Here are two examples of missing color cards (I own these) that could be the result of the adheisive used to put them into albums. I could be wrong, but I believe this is what Mac was referencing. Great looking card. I could be interested if a price is added.\n\n[IMG]http://www.t206blog.com/wp-content/uploads/2012/12/t206-Oakes-Piedmont-350-MISSING-RED.jpg[/IMG]\n\n[IMG]http://www.t206blog.com/wp-content/uploads/2012/12/t206-Downey-Piedmont-350-MISSING-RED.jpg[/IMG]",
      "post_time": "20130121T11:19:33-06:00",
      "timestamp": "1358792373"
    },
    {
      "post_id": "1076655",
      "post_title": "",
      "post_author_name": "obcmac",
      "post_content": "Thanks Jason....that is what I was referring to.  You also see some cards that have been glued in a spot at the center...that are missing color right where the glue was.  \n\nWe have seen adhesives remove both single and multiple colors. \n\nWe both agree that your card was likely glued into an album...and shows the obvious evidence of such...back staining with sharp corners.\n\nTwo possibilities exist...the color was missing before it was pasted in or a frequently seen chemical reaction caused the missing color.  Do I know that it was the adhesive that caused the missing colors?  No I don't...but I don't think you know that it wasn't the adhesive either.  \n\nIt's a fun card, it looks cool...I bid $200 on it and was prepared to go higher...and backed off when I noticed the staining.   \n\nGood luck.\n\nMac",
      "post_time": "20130121T12:55:35-06:00",
      "timestamp": "1358798135"
    },
    {
      "post_id": "1076667",
      "post_title": "",
      "post_author_name": "sreader3",
      "post_content": "Hi Jason,\n\nFirst of all, thanks for the robust discussion.\n\nOn your cards (which I think are cool and don't mean to denigrate), all of the colors--red, blue green, yellow, etc.--seem more or less equally faded whereas on my card there is no fading at all.  The color differences on my card are of kind, not degree, and relate strictly to one color:  Red.\n\nHere are some of the particular differences:\n\n1.  Most standard issue Oakes cards (but not all--and the standard issue Oakes I have shown in this post is in the minority group) have a noticeable brush of red on his right cheek; this card doesn't.\n2.  Standard issue Oakes cards have a deep orange background; this card has a lighter orange (or deep yellow) background (note:  orange - red = yellow).\n3.  Standard issue Oakes cards have bold red team lettering; this one has snowy white team lettering.\n\nIt would be a very neat trick to (intentionally or by accident) have removed the red ink from this card after-the-fact (including dissembling the red ink from the yellow ink in the background) without otherwise disturbing the color scheme, without creating signs of surface wear and while retaining the vibrancy of this card.\n\nA final note:  On a standard issue Oakes, the red ink applied to the team letters slightly spills over onto the blue jersey and creates the impression of a dark purple outline around the team letters.  This card shows no evidence of that outline, which is consistent with a failure to apply red ink in the printing process.  (See close-up scans of team lettering above). \n\nScot",
      "post_time": "20130121T13:22:27-06:00",
      "timestamp": "1358799747"
    },
    {
      "post_id": "1076827",
      "post_title": "",
      "post_author_name": "t206blogcom",
      "post_content": "Scot - I don't disagree or take any offense to your comments; it's an interesting discussion. Nor do I want to take away from your really nice missing red card. I wouldn't mind having it in my collection.\n\nI have no clue for sure whether the glue on the reverse of mine was in fact what removed some of the ink on my cards or if the ink was missing in the first place, especially on the Oakes - nobody will know for sure. \n\nI've seen plenty of examples of Downey with a red belt and a white or not-as-red cincinnati on his shirt. My personal opinion is that this Downey is one of those that lacked the red on the shirt before being placed into an album. Again, we'll never know.\n\nThere are two things that I find interesting with the two cards I displayed:\n\n1) There appears to have been a massive amount of glue on the back of both of these cards. They might have been owned by the same person and pasted in the same album at one point. I believe because there was so much glue and it seemed to have been spread across the entire back of the card, the overall colors seem more dull. However, I will say both cards, at least in person, appear dirty on the front. One day I might soak them to see if the front improves.\n\n2) For two cards once pasted into albums, they sure are beat to hell, unlike your card. I wonder if they were beat up prior to album insertion or removed and 'played' with. I've also noticed the tops of both display similar wear patterns. Now that I think of it, one of my other missing red colors, below, clearly was once in an album, yet is beat up and has a similar top edge.\n\nSorry for the large scan:\n[IMG]http://www.t206blog.com/wp-content/uploads/2012/09/t206-Dahlen-Missing-B-Piedmont-150.jpg[/IMG]\n\nGood luck with the sale. You've got a real beauty of a card and I dig the white lettering. All the best.",
      "post_time": "20130121T19:41:23-06:00",
      "timestamp": "1358822483"
    },
    {
      "post_id": "1076893",
      "post_title": "",
      "post_author_name": "sreader3",
      "post_content": "Jason,\n\nThanks for the insightful comments.\n\nAll,\n\nAfter a day of fielding PMs with wildly disparate views and info I am inclined to consign the card to an auction house and let the market decide what it's worth.\n\nThanks to all who inquired.\n\nScot",
      "post_time": "20130121T23:45:35-06:00",
      "timestamp": "1358837135"
    }
  ]
}