{
  "id": "98854",
  "forum_id": "13",
  "title": "FT 1952 Topps lot of 31 for T206",
  "author": "Archive",
  "reply_count": 0,
  "view_count": 329,
  "created_date": null,
  "last_reply": "20081209T16:56:00-06:00",
  "posts": [
    {
      "post_id": "684953",
      "post_title": "FT 1952 Topps lot of 31 for T206",
      "post_author_name": "Archive",
      "post_content": "Posted By: Leslie Westbrook\nI'm narrowing my focus these days...I have 31 1952 Topps cards available for trade ($ offers will, of course, be considered). I'd like to make a trade deal for either a low-grade lot of T206's or one or two T206 HOF's. Condition is not an issue as long as the trade is fair.\n\nThe cards range in condition from Poor to NM. I'll be happy to send photos upon request. Card #'s and general descriptions are listed below. Some of the red backs are on gray card stock and some are on the whiter stock. I'll be happy to give you specifics if you'd like.\n\n13-Johnny Wyrostek (Reds), black back, Ex+, OC L to R\n15-Johnny Pesky (Red Sox), red back, Poor, creases and slight paper loss\n38-Wally Westlake (Cardinals), red back, Vg-ex, OC L to R\n48-Joe Page (Yankees), red back, Poor, Paper loss, corner crease\n63-Howie Polett (Pirates), red back, good, creasing, some corner rounding\n65-Enos Slaughter (Cardinals), black back, good, crease, some corner rounding\n67-Allie Reynolds (Yankees), black back, poor, creasing\n81-Vernon Law (Pirates), red back, fair, corner creasing, rounded corners\n84-Vern Stephens (Red Sox), red back, g-vg, light corner creasing and wear\n85-Bob Kuzava (Yankees), red back, vg-ex, touched corners, light crease on back\n90-Mickey Grasso (Senators), red back, fair-good, crease, OC, rounded corners\n97-Earl Torgeson (Braves), red back, Ex-Nm, OC T to B, a beauty\n106-Mickey Vernon (Senators), red back, fair-good, OC R to L, crease, mark and corner wear\n109-Ted Wilks (Pirates), red back, fair-good, front surface creases that don't go through\n    and slightly touched corners\n112-Henry Majeski (Athletics), red back, poor, tape residue, rounded corners\n114-Willard Ramsdell (Cubs), red back, pr-fr, horizontal creasing, rounded corners\n118-Ken Raffensberger (Reds), red back, g-vg, 1-corner crease, touched corners\n122-Jack Jensen (Yankees), red back, poor, writing (looks like a kid changed his team when                       h   he switched to the Red Sox and drew a little sock over the Yankees logo), poor corners\n123-Eddie Yost (Senators), red back, good, rounded corners, light wrinkles\n124-Monte Kennedy (Giants), red back, vg, some corner wear, 70-30 centering\n128-Don Bollweg (Yankees), red back, vg+, touched corners, looks nice\n146-Frank House (Tigers), red back, poor, chipping, rounded corners\n155-Frank Overmire (Yankees), red back, good, Looks great but has chipped bottom corners\n156-Frank Hiller (Reds), red back, fair-good, edge wear, rounded corners\n163-Stan Rojek (Browns), red back, good-vg, off center, rounded corners\n166-Paul LaPalme (Pirates), red back, Nm, OC L to R, factory indention on back, a real       \n    beauty\n168-Charlie Silvera (Yankees), red back, fair, rounded corners, creasing\n179-Frank Smith (Reds), red back, fair-good, light wrinkles, edge wear\n258-Steve Gromek (Indians), red back, pr-fr, creasing, corner wear, some surface wear\n302-Max Surkont (Braves), red back, good, crease, worn corners\n309-Jim Busby (Senators), red back, vg, nicely centered, light vertical surface crease",
      "post_time": "20081209T16:56:00-06:00",
      "timestamp": "1228866960"
    }
  ]
}