{
  "id": "185197",
  "forum_id": "13",
  "title": "***  Exceedingly SCARCE group of 15 t210-3 Orange Borders -- SOLD!!***",
  "author": "shammus",
  "reply_count": 7,
  "view_count": 871,
  "created_date": null,
  "last_reply": "20140505T12:25:16-06:00",
  "posts": [
    {
      "post_id": "1257074",
      "post_title": "***  Exceedingly SCARCE group of 15 t210-3 Orange Borders -- SOLD!!***",
      "post_author_name": "shammus",
      "post_content": "I don't think too many people have tried going after this rare subset so I can't imagine there's ever been a group of these this size that have been made available before.  So far, what we know is that there are 20 confirmed t210-3 OBs, most players with likely no more than 4-5 examples. This group here comprises a solid 75% of the set.  Perfect for a collector looking to pick up a tough new project that has only been attempted by very few individuals in our hobby.  As far as I'm aware, this would be the largest group made available to date.\n\nPlayers and their condition grades are listed below.  The cards range from some nicer examples, down to a couple examples that are kind of rough.  But for this set, you truly have to take what you can get with so few examples out there to work with.  The color is terrific on most of the cards...whereas t210s typically have bright fire-engine-red borders, these are a shocking neon orange instead!\n\nAlways up for trading for e107s, t204s or any sort of oddities/printing mishaps.  Would much rather prefer to trade than sell the group directly but I'm happy to listen to cash/trade offers while I try to think of a price I'd sell the cards for :)\n\nOne note, as the group is a very significant offering for this particular subset, I would likely not have any interest in splitting up the lot.  \n\nAdditional scans are available upon request. Thanks in advance for any interest....\n\n\n*** Cards are now sold ***\n\n\nBrian\n[url]redmaccie@hotmail.com[/url]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=138234&d=1395466386[/IMG]\n---------------------------------------\n\nBurch PSA 2 - solid card and undergraded...no real wear or wrinkling\nYantz PSA 4 - Solid card but appears to be overgraded\nGordon SGC 40 - great overall example...one tiny corner wrinkle\nNagel GD/VG - one corner wrinkle...back clean and damage free\nCurry FR+ - 2-3 light wrinkles and some corner wear...back clean and damage free\nKipp VG - one tiny corner wrinkle, sharp card...back clean and damage free\nHooks PR - missing corner...but decent card otherwise\nBlanding VG/EX - no wear/wrinkling.  One tiny ding in lower left...back is perfect\nNorthern GD - a couple very light wrinkles....clean and damage free back\nSlaven PR/FR - creasing on lower half of card.  Upper half very clean... clean and damage free back\nLeidy FR - a couple wrinkles and a notch on right edge ...clean and damage free back\nStringer VG but appears to measure short - no wrinkling, very little wear ...clean and damage free back\nFirestine PR - creases all over...clean and damage free back\nStinson PR - creases all over...clean and damage free back\nJones AWFUL - has some yellow to the borders but looks like it might have been wadded up at one point",
      "post_time": "20140321T23:38:45-06:00",
      "timestamp": "1395466725"
    },
    {
      "post_id": "1257075",
      "post_title": "",
      "post_author_name": "team-of-rivals",
      "post_content": "I love the look of these.....good luck in your trading/selling endeavor!",
      "post_time": "20140321T23:44:08-06:00",
      "timestamp": "1395467048"
    },
    {
      "post_id": "1257351",
      "post_title": "",
      "post_author_name": "Jacker_ Cracks",
      "post_content": "Beauties! Best of luck with the sale.",
      "post_time": "20140322T18:26:18-06:00",
      "timestamp": "1395534378"
    },
    {
      "post_id": "1257372",
      "post_title": "",
      "post_author_name": "shammus",
      "post_content": "Thanks Brady and JR, I appreciate the kind words!\n\nThought I might give people a small update.  I'm getting a few requests about splitting the group up, which I expected.  I will give some thought in the next couple days about doing so.  \n\nI'd still prefer to trade for cards that would help my immediate projects - e107s, t204s, d311s and printing oddities/mishaps from all sets.  But I suppose I'll open this up and listen to all cash/trade offers for the cards individually.  If it appears that most of the cards will go to new homes in this manner, I might go ahead and split the group up.\n\nThanks all....",
      "post_time": "20140322T19:10:40-06:00",
      "timestamp": "1395537040"
    },
    {
      "post_id": "1258953",
      "post_title": "",
      "post_author_name": "shammus",
      "post_content": "Guys,\n\nAfter giving this some thought, I'm probably going to hold off on splitting the group up for the time being.  I had some cash offers from some people that were very fair, but the reason I was considering moving the cards to begin with was to trade for cards I needed and that opportunity unfortunately didn't present itself.\n\nAsking $3800 and I'll still consider cash/trade offers for the group as a whole if anyone is willing. \n\nThanks all....",
      "post_time": "20140326T18:42:45-06:00",
      "timestamp": "1395880965"
    },
    {
      "post_id": "1259201",
      "post_title": "",
      "post_author_name": "joeadcock",
      "post_content": "Brian\n\nGood luck on the quest to reign in the E107 small set.",
      "post_time": "20140327T10:10:12-06:00",
      "timestamp": "1395936612"
    },
    {
      "post_id": "1269969",
      "post_title": "",
      "post_author_name": "shammus",
      "post_content": "Figured I'd wait until after REA to bump this lot again.  Asking $3800 on the group. If anyone out there was shut out during REA but still wants a unique item, this group may be perfect for you.  Also, there simply aren't many of these cards to go around so anyone wanting to make a run at this subset would have a very difficult time going about it starting from scratch.  This group would put you within shouting distance of completion immediately.\n\nAdditional/better scans available upon request....\n\nThanks in advance,\nBria",
      "post_time": "20140428T02:16:36-06:00",
      "timestamp": "1398672996"
    },
    {
      "post_id": "1272801",
      "post_title": "",
      "post_author_name": "shammus",
      "post_content": "I'll do a one-time bump with these before sending them back to the vault.  Knocked this group all the way down to $3400.  Will consider cash/trade offers as well.  Thanks in advance,\nBrian-",
      "post_time": "20140505T12:25:16-06:00",
      "timestamp": "1399314316"
    }
  ]
}