{
  "id": "260598",
  "forum_id": "13",
  "title": "FS: T215 Red Cross Type 1 Reulbach (SOLD)",
  "author": "edjs",
  "reply_count": 5,
  "view_count": 466,
  "created_date": null,
  "last_reply": "20181004T15:51:56-06:00",
  "posts": [
    {
      "post_id": "1817167",
      "post_title": "FS: T215 Red Cross Type 1 Reulbach (SOLD)",
      "post_author_name": "edjs",
      "post_content": "Selling my T215 Red Cross Type 1 Reulbach, No Glove Showing.  The only example I can find graded between PSA and SGC (edited to update: Steve let me know there is an SGC grade example, I did not see it when I checked, I only saw the type 2).  If you are actually trying to complete this set, you need this card.  I'm asking [STRIKE]$1500[/STRIKE] SOLDand for full transparency, I could think this card may go higher (or lower, for that matter).  It is hard to set the market on a population [STRIKE]1[/STRIKE] 2 card, so with that said, I will entertain offers before I sell, so being the first to say you will take it may not get you the card.  I will consider all offers and accept the best.  I understand that I may be off base with my asking price, so feel free to make your best offer, all offers will be considered.  Price is net to me,  though I will cover domestic shipping and insurance (I will work with  you if international).  PayPal only on this, please.  E-mail me with  your questions or offers, [URL=\"skeltone@rocketmail.com\"]skeltone@rocketmail.com[/URL].  Thanks.",
      "post_time": "20181003T14:11:22-06:00",
      "timestamp": "1538597482"
    },
    {
      "post_id": "1817174",
      "post_title": "",
      "post_author_name": "edjs",
      "post_content": "I have been told of an SGC graded example, I may have not seen it when I checked the pop report.  I will still look for the best offer on this, still a very rare card.",
      "post_time": "20181003T14:36:50-06:00",
      "timestamp": "1538599010"
    },
    {
      "post_id": "1817181",
      "post_title": "Red Cross",
      "post_author_name": "buymycards",
      "post_content": "Hi Ed, the SGC report is just a random list that is not in alphabetical order, so it is easy to miss something.\n\nSGC shows 1 Type I Reulbach card, which is an SGC 10.\nPSA only shows your card.\n\nFor Type II's, SGC has 1 Ruelbach and PSA doesn't have any listed.\n\nYours is a beauty for an SGC10 and it is extremely rare.\n\nGood luck with your sale!  Rick",
      "post_time": "20181003T15:24:29-06:00",
      "timestamp": "1538601869"
    },
    {
      "post_id": "1817184",
      "post_title": "",
      "post_author_name": "edjs",
      "post_content": "Thanks, Rick.  I did not want anyone to think I was being deceptive when I thought it was the only graded example.  I have no issue being wrong, and I am as honest about a card as I can be.",
      "post_time": "20181003T15:35:10-06:00",
      "timestamp": "1538602510"
    },
    {
      "post_id": "1817189",
      "post_title": "",
      "post_author_name": "ullmandds",
      "post_content": "nice card...I think your price is fair...a proverbial hens tooth!",
      "post_time": "20181003T16:46:00-06:00",
      "timestamp": "1538606760"
    },
    {
      "post_id": "1817375",
      "post_title": "",
      "post_author_name": "edjs",
      "post_content": "[quote name=\"ullmandds\" post=1817189]nice card...I think your price is fair...a proverbial hens tooth![/QUOTE]\n\nThanks Pete, and the card is sold.  Thanks to everyone for their offers and advice.",
      "post_time": "20181004T15:51:56-06:00",
      "timestamp": "1538689916"
    }
  ]
}