{
  "id": "189269",
  "forum_id": "13",
  "title": "FS/FT 1911 S74 Colored Silks WALTER JOHNSON 2nd Highest Graded BVG 4",
  "author": "GehrigFan",
  "reply_count": 0,
  "view_count": 287,
  "created_date": null,
  "last_reply": "20140610T17:23:35-06:00",
  "posts": [
    {
      "post_id": "1286102",
      "post_title": "FS/FT 1911 S74 Colored Silks WALTER JOHNSON 2nd Highest Graded BVG 4",
      "post_author_name": "GehrigFan",
      "post_content": "Massive Price Drop! Now $600.\n \nI am entertaining offers for this great card. It is the 1911 S74 Colored Silk (cream/off-white) of WALTER JOHNSON with Old Mill Advertising, graded BVG 4. Of all three grading companies, this is the second highest graded example among 7 total submitted, with an SGC 60 barely edging it out. Technically, I think this one is undergraded. Just look at the end threads that are usually mangled, or the fact that the Factory info and the Old Mill ad are both centered on the card and not cut off - this one is gorgeous! \n \nHard to determine a value on this due to a lack of sales history as these just don't come up often. The Beckett Almanac lists it at $1000 in VG-EX. I don't have a recent Standard Catalog. There is a BVG 2 on eBay now for $550 opening bid and $725 Buy It Now. I will start it out at XXX$800XXX (NOW $600!). $600 on this beauty is an absolute steal - I just am wanting to buy 2 other lower grade Walter Johnson Cards instead for my personal collection. I am not as concerned about high grade examples.\n \nI would also consider trading for other Walter Johnson, Ty Cobb, Honus Wagner, Cy Young or other pre-1930 top tier HOFer cards. Also specifically looking for a decent T206 Tris Speaker. \n \n[URL=\"http://s274.photobucket.com/user/Manderson9999/media/Vintage%20Baseball%20Cards/20140606_153218_zpslnvlnklb.jpg.html\"][IMG]http://i274.photobucket.com/albums/jj259/Manderson9999/Vintage%20Baseball%20Cards/20140606_153218_zpslnvlnklb.jpg[/IMG][/URL]\n \n[URL=\"http://s274.photobucket.com/user/Manderson9999/media/Vintage%20Baseball%20Cards/20140606_153226_zpsfxswvkf4.jpg.html\"][IMG]http://i274.photobucket.com/albums/jj259/Manderson9999/Vintage%20Baseball%20Cards/20140606_153226_zpsfxswvkf4.jpg[/IMG][/URL]",
      "post_time": "20140610T17:23:35-06:00",
      "timestamp": "1402442615"
    }
  ]
}