{
  "id": "114145",
  "forum_id": "13",
  "title": "*** Details on t210 Series 7 cards ***",
  "author": "shammus",
  "reply_count": 1,
  "view_count": 603,
  "created_date": null,
  "last_reply": "20090715T22:06:15-06:00",
  "posts": [
    {
      "post_id": "736347",
      "post_title": "*** Details on t210 Series 7 cards ***",
      "post_author_name": "shammus",
      "post_content": "Here's the t210 Series 7 group.  As with the t210-5s, I'll probably hang on to the bulk of these. However, I figure I'd list them out for everybody just in case I'm able to swing a few trades for cards I need to complete sets I'm close on. If there's a card that someone really needs, feel free to write and we can always talk about it too. I will probably keep the Mascot and a couple others for sure unless I'm blown away with an offer.\n\nConditionwise, these cards are probably a little rougher than the t210-5 group.  Still lots of nice ones and lots of toughies in here too!  Many attractive examples here and in many cases, the cards are even free from wrinkling altogether. What holds a lot of the cards back are small bits of paper loss on the back due to being attached to a scrapbook. \n\nThanks much,\nBrian\n[url]redmaccie@hotmail.com[/url]\n\n\n-- WANTLIST --\n\nt210 Orange Borders - need any. Pink and yellow borders too \nEUNC orange borders - any commons\nd311s (need 15) Burrell, Castleton, Christian, Daley, Delhi, Dillon, Gregory, Kuhn, Lewis, Maggert, Ryan, Stamfield, Steen, Tennant, Wares\n1918 Zeenuts - need any\n1919 Zeenuts (need 11) - Lane (oak), Pinelli (sac), Prough (sac), Vance (sac), Spencer (saltlake), Seaton (SF), Smith, Bill (SF), Snell (SF), Arbuckle (Vern), Check (Vern), Meusel (vern)\nw590 - REALLY, REALLY need a Spencer!!!\n\n\nSeries 7\nArmstrong FR/ GD - VG/EX on front, no wrinkling and mostly sharp corners, couple areas of wear on reverse\nBeatty GD - wrinkle free, corner wear, tiny spot of damage on back\nBonner GD - wrinkle free, corner wear, tiny bits of residue on back\nCabrol VG+ - VG/EX on front, no wrinkles, mostly clean and damage free on reverse\nCooney FR/GD - some corner chipping on front, no wrinkles, tiny bits of wear on reverse\nCowell PR/FR - creasing on front, small areas of damage on the back.\nCreagan PR/FR - few wrinkles on front...bits of residue and a bit of wear on reverse\nCrockett FR/GD - some corner chipping on front, no wrinkles, tiny bits of wear on reverse \nDailey FR/GD - some corner chipping on front, no wrinkles, tiny bits of wear on reverse \nDussault PR/FR - creasing on front\nEvans FR - nice VG front, one spider wrinkle, some residue and damage on back\nForgue  FR - nice VG front, no wrinkling, some residue and damage on back\nFulton  FR - very nice VG front, no wrinkling, some residue and damage on back\nGastmeyer (bat) FR/GD - one wrinkle on front, tiny bits of residue on reverse\nGastmeyer (field) FR - one wrinkle on front, mild residue on reverse\nGunderson PR/FR - nice VG front, no wrinkling, significant back damage\nHam GD - VG front, no wrinkling, tiny spot of damage on reverse\nHart FR - couple wrinkles, edge chipping on front, mostly clean, damage free on back\nHyames PR/FR - GD/VG on front, no wrinkles, some back damage\nIrving GD - nice GD/VG front, tiny spider wrinkle, tiny nick on back\nKaiser GD/VG - strong VG front, no wrinkling, bits of residue on back\nKelley (Raleigh) PR/FR - spot of damage on front, no wrinkling, \"dirty\" back\nKelly (Goldsboro) GD - couple wrinkles on front, mostly clean and damage free on back\nKelly (Mascot) FR/GD - mild edge chipping, no wrinkling, tiny scuff on back\nLuyster FR - solid VG front, no wrinkling, some back damage\nMalcolm VG - great on front, no wrinkling, mostly clean and damage free on back\nMcGeeham PR/FR - wrinkle w/ edge chipping on front, mild damage/residue on back\nMills FR/GD - great wrinkle free front VG/EX, mild residue and paper loss on reverse\nPhalean PR/FR - wrinkling, edgewear, some back damage\nPrim PR/FR - wrinkling on front, mild residue on back\nReeves PR/FR - crease on bottom, mild back damage\nSharp FR/GD - wrinkle on front, mostly clean and damage free on back\nSimmons FR - VG on front, no wrinkling, some residue/loss on back\nSteinbach FR - small \"streaks\" on front, mild residue on back\nTaylor FR - couple chips in borders, corner wrinkle, mild residue on back\nWright PR/FR - fading/residue on front, significant back damage\n\nI also have some dupes consisting, ironically of some of the toughest cards in the set.  I purchased most of these recently right before I won the larger groups.  I'm happy to sell them for my cost if anyone is interested....Those are below -\n\nHam SGC 20 - The ONLY example that has been slabbed by PSA, SGC, etc..\nHyames SGC 30 - no creases!\nIrving SGC AUT -  The ONLY example that has been slabbed by PSA, SGC, etc..\nGunderson SGC 10 - The ONLY example to be graded by SGC",
      "post_time": "20090715T19:51:09-06:00",
      "timestamp": "1247709069"
    },
    {
      "post_id": "736377",
      "post_title": "Graders?",
      "post_author_name": "Potomac Yank",
      "post_content": "*",
      "post_time": "20090715T22:06:15-06:00",
      "timestamp": "1247717175"
    }
  ]
}