{
  "id": "114527",
  "forum_id": "13",
  "title": "WTB: T206 Frank Chance Yellow Port. Back Variations",
  "author": "Harford20",
  "reply_count": 9,
  "view_count": 1467,
  "created_date": null,
  "last_reply": "20090822T17:34:56-06:00",
  "posts": [
    {
      "post_id": "738896",
      "post_title": "WTB: T206 Frank Chance Yellow Port. Back Variations",
      "post_author_name": "Harford20",
      "post_content": "I am putting together a back variation set of the \"super print\" of the T206 Frank Chance, Yellow Portrait.  I have acquired 8 different back over the past 2 years, and have confirmed the existance of 12 other backs (although these were either higher grades or out of my price range at the time).  The backs I currently have are :  \nT206 Frank Chance, Yellow Portrait:\n   1.  Piedmont 350, Fact 25\n   2.  Sweet Caporal 350, Fact 30\n   3.  Piedmont 350-460, Fact 25\n   4.  Sweet Caporal 350-460, Fact 30\n   5.  Sweet Caporal 350-460, Fact 42 OP\n   6.  Old Mill, Fact 25\n   7.  Polar Bear\n   8.  Tolstoi\n\nI am now asking if anyone has any other back variation, to include just simple Factory variations, they would be willing to sell.  With the 12 I have confirmed, and the 6 that I believe are in the \"super print\" backs, I am still missing 18 different backs.  \nIf you are not selling, but can confirm the existance of the AB 350, AB 460, Broadleaf 350, Cycle 460, Piedmont 350-460, Fact 42, or brown Lenox--that information would also be greatly appreciated\n\nI am looking at PSA 1/SGC 10 (complete cards due to the back emphasis) to PSA 4/SGC 50, but also raw cards considered.  With the incredibly rare backs (red Hindu, Broadleaf, etc.), I will likely have to pass on the higher grades due to budget constraints.  Would request scans of all raw cards and possibly others as well.  My email is [url]DHarford@satx.rr.com[/url]\n\nThanks\nDave H",
      "post_time": "20090729T18:59:02-06:00",
      "timestamp": "1248915542"
    },
    {
      "post_id": "738899",
      "post_title": "Error",
      "post_author_name": "Harford20",
      "post_content": "Sorry, error in above, mentioned looking for confirmation of AB 460, this is not in the \"super prints\".  Loast one for confirmation is EPDG.",
      "post_time": "20090729T19:22:06-06:00",
      "timestamp": "1248916926"
    },
    {
      "post_id": "740053",
      "post_title": "",
      "post_author_name": "Harford20",
      "post_content": "Bump after the National.",
      "post_time": "20090805T05:43:37-06:00",
      "timestamp": "1249472617"
    },
    {
      "post_id": "740059",
      "post_title": "",
      "post_author_name": "Kotton King",
      "post_content": "Hi Dave,\n\nThis one is not for sale but could possibly be available for trade.  I would need another HOFer with a Piedmont 350-460 factory 42 back (that I don't already have for my backs collection) in return.  If you locate one and it isn't a HOFer I already own, I would trade this Chance to you.  But here is a scan to confirm your P350-460/42 back.\n\n[IMG]http://i282.photobucket.com/albums/kk264/crazylocomerk3/T206%20Back%20Set/1909-11T-206ChanceFrankyellowportra.jpg[/IMG]",
      "post_time": "20090805T06:01:52-06:00",
      "timestamp": "1249473712"
    },
    {
      "post_id": "740063",
      "post_title": "",
      "post_author_name": "Kotton King",
      "post_content": "[quote name=\"Harford20\" post=738896]\n\n\nIf you are not selling, but can confirm the existance of the AB 350, AB 460, Broadleaf 350, Cycle 460, Piedmont 350-460, Fact 42, or brown Lenox--that information would also be greatly appreciated[/QUOTE]\n\nA little more help.\n\nVCP has a sale of a PSA 1 Broadleaf 350 Chance on 8/9/07 for $327.\n\nI think Lee B. has a Chance (yellow) Cycle 460 (or I know he used to).",
      "post_time": "20090805T06:21:16-06:00",
      "timestamp": "1249474876"
    },
    {
      "post_id": "744148",
      "post_title": "Last Bump with an Update",
      "post_author_name": "Harford20",
      "post_content": "Just a last request for helping identify the backs for the Chance Yellow Portrait.\n\nHowever, based on data from Ted Z......\n \nAt last count, we had 301 samples of the T206 red Cobb. And 8 other white-bordered red Cobb's. The final tally is listed below.\n\nThe new info garnered from this (and other) surveys is that American Litho. did NOT print this Cobb with a UZIT back. In fact, none of the 6 super-prints in the T206 set are found with the UZIT back or the American Beauty 460 back. However, these six subjects can be found with virtually every other White-Bordered Tobacco back that was issued from 1909 - 1919.\n\n\nNow I have to question if my Chance list of possibilities is correct.  I have used only my own visual confirmation of cards from auctions, ebay and shows to confirm my list of 25 back variations, but if the Uzit does not exist (and I already had it marked off as a \"true\" variation), then there must only be 24 variation possibilities.\n\nAny confirmed Frank Chance Yellow Port Uzit backs out there? (or others on my original list?)\n\nThanks",
      "post_time": "20090821T23:03:08-06:00",
      "timestamp": "1250917388"
    },
    {
      "post_id": "744175",
      "post_title": "Dave......re..Chance (portrait-yellpw)",
      "post_author_name": "tedzan",
      "post_content": "My info indicates a total of 22 confirmed backs. With a possibility of a 23rd....Broad Leaf 460.\n\nCompare this list with yours......\n\nAB 350 (frame)\nBL 350\nCy 350\nCy 460\nP 350/25\nP 460/25\nP 460/42\nSov 350\nSov 460\nSC 350/25\nSC 350/30\nSC 460/25\nSC 460/30\nSC 460/42\nSC 460/42 ovpt\nCarol. Brts.\nEPDG\nLenox\nOM\nPB\nTol\nRed Hindu\n\n\nGood Luck in your quest.\n\n\nTED Z",
      "post_time": "20090822T06:23:39-06:00",
      "timestamp": "1250943819"
    },
    {
      "post_id": "744245",
      "post_title": "",
      "post_author_name": "Harford20",
      "post_content": "Ted Z., awesome thanks.  My error seems to be the Uzit.  I do have the Broadleaf 460 confirmed (but I do not own one), and I also have the Drum 350 confirmed (do not own one, nor have a photo--I have been keeping photos of variations lately), but have it marked on the list.  This may be an \"assumption\" as SGC has a confirmed T206 Frank Chance Drum back Auth in their population report, and according to my chart the T206 Chance Red and T206 Chance batting were never offered in the Drum back--this could be in error.\n\nUzit is removed from the list.  Drum now a question mark.\n\nDave H",
      "post_time": "20090822T12:00:11-06:00",
      "timestamp": "1250964011"
    },
    {
      "post_id": "744279",
      "post_title": "",
      "post_author_name": "caramelcard",
      "post_content": "Hi Dave,\n\nI have a Chance Yellow Portrait with a Blank Back.\n\nBest of luck with your hunt!\n\nRob",
      "post_time": "20090822T14:28:17-06:00",
      "timestamp": "1250972897"
    },
    {
      "post_id": "744310",
      "post_title": "",
      "post_author_name": "cfc1909",
      "post_content": "Chance Drum authentic was in the Hunt find a few years ago.",
      "post_time": "20090822T17:34:56-06:00",
      "timestamp": "1250984096"
    }
  ]
}