{
  "id": "98562",
  "forum_id": "13",
  "title": "Very tough t207 Morris Rath SGC 40 (Anonymous back) for trade/sale",
  "author": "Archive",
  "reply_count": 1,
  "view_count": 552,
  "created_date": null,
  "last_reply": "20081016T18:33:00-06:00",
  "posts": [
    {
      "post_id": "684085",
      "post_title": "Very tough t207 Morris Rath SGC 40 (Anonymous back) for trade/sale",
      "post_author_name": "Archive",
      "post_content": "Posted By: Brian McQueen\nNot a player that's easily found in the t207 set at all.  The Rath actually makes for a very presentable card.  No creasing and no damage on the back.  No other surface nicks or wear exists on the card either.  Plus, the Anonymous back is one of the tougher t207 backs out there.  \n\nI'd prefer to trade and have my wantlist included below.  I'd also be willing to sell the card for $225 for those wishing to go that route.  Thanks in advance,\n\nBrian\nredmaccie@hotmail.com\n\n\nc46 - Adkins\nt207 Napoleon backs - need most\nt210 Orange Borders - need most\nw590 - Ruth, Spencer, Johnson\n1919 Zeenuts - Lane (oak), Nourse (oak), Pinelli (sac), Prough (sac), Vance (sac), Spencer (saltlake), Seaton (SF), Smith (SF), Snell (SF), Eastley (SEA), Arbuckle (Vern), Check (Vern), Houck (Vern), Meusel (vern)\n1918 Zeenuts - any\nv117 Maple Crispettes - Barnes, Dolan, Bassler, Meusel, Peckinpaugh & Jacobson\nd311 - Agnew, Arrelanes, Berry, Brashear, Burrell, Byram, Castleton, Chadbourne, Christian, Daley, Danzig, Delhi, Dillon, Fitzgerald, Gipe, Gregory, Harkness, Heister, Holland, Howard, Kuhn, LaLonge, Lewis, Maggert, Meikle, Mitze, Mohler, Moore, Murray, O’Rourke, Patterson, Pearce, Rapps, Ryan, Schmidt, Stamfield, Steen, Sutor, Tennant, Thompson, Van Buren, Wares\nt205 Broadleaf backs - need all\n\n\n\n[IMG]http://www.network54.com/Realm/tmp/1224203240.JPG[/IMG]",
      "post_time": "20081016T18:32:00-06:00",
      "timestamp": "1224203520"
    },
    {
      "post_id": "684086",
      "post_title": "Very tough t207 Morris Rath SGC 40 (Anonymous back) for trade/sale",
      "post_author_name": "Archive",
      "post_content": "Posted By: Mike Frohme\nMail sent, Brian",
      "post_time": "20081016T18:33:00-06:00",
      "timestamp": "1224203580"
    }
  ]
}