{
  "id": "158676",
  "forum_id": "13",
  "title": "WTT T206 Fred Clarke HOF Portrait Brown Hindu SGC10",
  "author": "wolf441",
  "reply_count": 2,
  "view_count": 505,
  "created_date": null,
  "last_reply": "20121113T10:29:24-06:00",
  "posts": [
    {
      "post_id": "1050936",
      "post_title": "WTT T206 Fred Clarke HOF Portrait Brown Hindu SGC10",
      "post_author_name": "wolf441",
      "post_content": "I recently picked up this beauty and although I need the HOF'er Clarke for my T206 set, I already have a Brown Hindu. I am looking to trade this T206 Fred Clarke Portrait with Brown Hindu back for another T206 rare back common of similar grade (SGC or PSA are both fine).\n\nI'm interested in the following T206 backs:\n\nBlack Lenox\nRed Hindu\nCarolina Brights\nPiedmont 350-460 Factory 42\n\nI'd also consider trading for a higher profile T206 Hall of Famer with a common back. I'm looking for any of the following:\n\nCobb (all variations)\nJohnson (portrait)\nMathewson (portrait)\nCy Young (portrait or glove shows)\nLajoie (portrait or batting)\n\nPlease PM with your trade proposals if you are interested. I'd also consider the Elberfield (port-Wash), Dahlen (Brooklyn) or Lundgren (Chicago) variations.\n\nThanks for looking,\n\nSteve",
      "post_time": "20121107T18:10:58-06:00",
      "timestamp": "1352337058"
    },
    {
      "post_id": "1051538",
      "post_title": "",
      "post_author_name": "wolf441",
      "post_content": "Thanks to everyone for their offers. So far, still no match. Please PM me if you are interested in trading for this T206 HOF Hindu back. I'd also consider some additional Hall of Famers (Keeler, Waddell) as well as some Southern Leaguers.\n\nSteve",
      "post_time": "20121109T21:19:13-06:00",
      "timestamp": "1352521153"
    },
    {
      "post_id": "1052372",
      "post_title": "",
      "post_author_name": "wolf441",
      "post_content": "Thanks for the offers thus far. I've received 3 offers in particular that were close to a match, but we couldn't pull the trigger. \n\nPlease PM or email me at [url]woelfmansteve@aol.com[/url] if you are interested in this T206 Fred Clarke Portrait with Brown Hindu back. \n\nAll offers are welcome (including scans in your offers would be appreciated). I am just looking for equal value and to pick up another T206 or T206s toward my set. If I don't find a suitable trade match in the next few days, I will sell the Clarke Hindu via ebay. \n\nThanks for looking,\n\nSteve",
      "post_time": "20121113T10:29:24-06:00",
      "timestamp": "1352827764"
    }
  ]
}