{
  "id": "136846",
  "forum_id": "13",
  "title": "SOLD T206 \"Magie\" Error Card SGC AUTH",
  "author": "wonkaticket",
  "reply_count": 6,
  "view_count": 1597,
  "created_date": null,
  "last_reply": "20110612T20:35:34-06:00",
  "posts": [
    {
      "post_id": "893968",
      "post_title": "SOLD T206 \"Magie\" Error Card SGC AUTH",
      "post_author_name": "wonkaticket",
      "post_content": "Considering the fact that I may not need two Sherwood Magee errors (Magie), accepting offers on the below.\n\nWonderful card fantastic color and clean overall, classic old timer trim job on the bottom. This is what happens when those pesky oversized cards just won’t fit into those sheets, his or her mistake your savings. :)\n\nCARD IS SOLD\n\nGreat way to have a “Magie” that doesn’t look rough and fill a tough spot that lots of T206 collectors still need checked off.\n\nI will get back to you as soon as I can and try to answer all offers.\n\nCheers,\n\nJohn",
      "post_time": "20110514T01:59:28-06:00",
      "timestamp": "1305359968"
    },
    {
      "post_id": "894031",
      "post_title": "",
      "post_author_name": "wonkaticket",
      "post_content": "Hey guys sorry to do this but can you make your offers via email and not PM's my PM box was full so I don’t want to ignore somebody because I missed your PM.\n\nAlso not trying to be picky but I really need you guys to offer what you want to pay emailing me and asking what I would take is technically asking me to make you an offer. :)\n\nCheers,\n\nJohn\n\nP.S. I am open to trades as well.",
      "post_time": "20110514T11:04:23-06:00",
      "timestamp": "1305392663"
    },
    {
      "post_id": "898775",
      "post_title": "",
      "post_author_name": "wonkaticket",
      "post_content": "Cough.....cough...",
      "post_time": "20110603T18:29:34-06:00",
      "timestamp": "1307147374"
    },
    {
      "post_id": "898776",
      "post_title": "Just a thought",
      "post_author_name": "HercDriver",
      "post_content": "Isn't you \"making an offer\" the same as setting a selling price, i.e. you are selling the card?  And if the prospective buyers \"make offers\" isn't that really an auction with a reserve?  Just a matter of how you look at it I suppose...you are essentially having an auction with a reserve, not a card for sale.\n\nJust my mindless rambling after happy hour...nice card, it will make somebody happy!\n\nCheers,\nGeno",
      "post_time": "20110603T18:35:15-06:00",
      "timestamp": "1307147715"
    },
    {
      "post_id": "898782",
      "post_title": "",
      "post_author_name": "wonkaticket",
      "post_content": "How about make an offer on the card or have another drink. :confused:\n\nNot really here to debate or listen to your views of selling structures.\n\nBut thanks for taking the time to chime in and comment on my method of proposed sale. \n\nGlad to hear you also feel the card is nice and could make someone happy whew! I had my concerns on selling the card to someone and bumming them out. :)\n\nBut now that we all have been given your seal of approval potential buyers should be able to offer with confidence.\n\nNext time I decide to toss something up for sale or to feel  out the waters here in the BST with my own inventory.  I’ll will be sure to run it by you prior to posting forgive me I’m new to this whole hobby thing.\n\nSimply put, my card listed to feel out for trade bait or cash etc.\n \nNot selling the card under any propaganda story about assisted living or linked front page shameless promoting posts that just happen to coincide with a listing to come or currently listed.\n\nNot relisting the card one hour after I won it in a very public venue for twice the price demanding a sale in 2 days hoping that folks have amnesia and didn’t just see the same card hours ago sell for half.\n\nNot listing card for 400x market price and bumping each time it gets below page one or each hour.\n \nTruth is I don’t necessarily need to set a price as I’m not really hard up to sell the card. If you know the market you can guess what roughly they are going for and offer something if you want to own it. The final thing that crossed my mind was I really don’t care about your thoughts unless you are a serious buyer and not some guy rolling out of a bar on a Friday night on his fourth Appletini with no offer other than advice. :)\n\nCheers,\n\nJohn",
      "post_time": "20110603T18:54:46-06:00",
      "timestamp": "1307148886"
    },
    {
      "post_id": "900807",
      "post_title": "",
      "post_author_name": "wonkaticket",
      "post_content": "Sold",
      "post_time": "20110612T17:56:01-06:00",
      "timestamp": "1307922961"
    },
    {
      "post_id": "900856",
      "post_title": "",
      "post_author_name": "Rob D.",
      "post_content": "[quote name=\"wonkaticket\" post=900807]Sold[/QUOTE]\n\nSo it met your reserve?",
      "post_time": "20110612T20:35:34-06:00",
      "timestamp": "1307932534"
    }
  ]
}