{
  "id": "98459",
  "forum_id": "13",
  "title": "Mayo Cut Plug unopened pack",
  "author": "Archive",
  "reply_count": 17,
  "view_count": 558,
  "created_date": null,
  "last_reply": "20080925T07:56:00-06:00",
  "posts": [
    {
      "post_id": "683802",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: NYHighlanderFan\nI've never seen an unopened 1900 Mayo Cut Plug pack. I've seen what seems to be hundreds of tins and lunch pails that are empty. But not something like this. Check out ebay #320299681787.",
      "post_time": "20080916T01:42:00-06:00",
      "timestamp": "1221550920"
    },
    {
      "post_id": "683803",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: Jon Canfield\nI've actually seen quite a few of these and they are not all that valuable or rare.  On my website, I've given a value of $50.00/pack...\n\n[url]http://baseballandtobacco.com/n301.htm[/url]\n\nI currently own one of these that is unopened with an 1897 stamp and have sold 6-10 unopened in the past.\n\nAlso, exact pack was purchased in a lot of a few tobacco packs for about $25.00 a month or so ago.  While I do not feel that price paid should bear any relevance with the price now being asked (in other words, if a buyer is able to get an incredible deal and resell for 1000x price paid, all the more power to you), I simply included the price paid for illustrative purposes to show the relative value of this pack.  Simply stated, this is another vintage collectible being sold for about 40 times its actual value.\n\n======================================\nFor the premier online souce of information on baseball-related cigarette packs, visit [url]http://www.baseballandtobacco.com[/url]",
      "post_time": "20080916T08:51:00-06:00",
      "timestamp": "1221576660"
    },
    {
      "post_id": "683804",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: Tim\nJon-\n\nI'm glad to see you post about this auction.  I saw it when the listing was first posted for $999.  Then it jumped to its current amount $2,999.  I was curious as to the details of the pack but didn't post not knowing if the seller was a board member and some get touchy about outing running auctions.\n\nThanks for sharing your knowledge.",
      "post_time": "20080916T09:09:00-06:00",
      "timestamp": "1221577740"
    },
    {
      "post_id": "683805",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: NYHighlanderFan\nThanks Jon!  I have never seen an unopened Mayo soft pack offered for sale anywhere before.  The only other Mayo soft pack I've ever seen is the one that you have pictured online.  One would think the rarity of it would be much greater than you stated.\n\nThe $50 price you have listed on your baseball tobacco website surely is for an opened package not sealed, right?  I've seen the opened empty Mayo lunch boxes alone sell for $200 at auction.",
      "post_time": "20080916T13:03:00-06:00",
      "timestamp": "1221591780"
    },
    {
      "post_id": "683806",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: Jon Canfield\nNo problem - glad to be of help.  As for the question regarding opened vs. unopened - the price of $50.00 on the website was meant for an opened pack dating to the correct year (1896).  However, the pack offered for sale is not the correct year for cards (and I don't believe to even be the correct style for the cards).  As such, I would apply the $50 value to that pack as well.  (To be honest, the range would probably be somewhere in the $50-$100 range for the unopened pack on eBay, depending on the day the item was sold and who was bidding.)  I admit that this was not clear at all in my initial post.\n\nThat being said, assuming for the moment that this unopened pack on eBay was correct in all aspects and may possibly contain a card - then my guess as to value would be somewhere in the $200-$300 range.  The value of unopened cigarette/tobacco packs dating to the correct year of card issues is all relative to the popularity and scarcity of the cards that they may contain.  While an unopened Mayo Cut Plug pack dating to 1896 may be very interesting, the die cut cards are not all that valuable and certainly not widely collected.  Therefore, the value of the pack, itself, will not be that great (however keeping in mind that the unopened pack would still be worth nearly 6 times what an opened one would be by my estimations.)\n\nNow, let’s say we found an unopened lunch pail from 1895 dating the pail to the N300 series… that would be a truly amazing discovery and worth possibly 5 figures.  I know you mentioned seeing one in your original post but I have to admit, I’ve never seen or heard of an unopened Mayo lunch pail from any year existing albeit new discoveries are made daily!\n\n\n======================================\nFor the premier online souce of information on baseball-related cigarette packs, visit [url]http://www.baseballandtobacco.com[/url]",
      "post_time": "20080916T18:58:00-06:00",
      "timestamp": "1221613080"
    },
    {
      "post_id": "683807",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: lindwayjc\nI totally disagree!  This pack has to be extremely rare.  How many can there actually be with a 1900 overstamp that are still sealed???  I think it's worth every penny.",
      "post_time": "20080924T10:04:00-06:00",
      "timestamp": "1222272240"
    },
    {
      "post_id": "683808",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: leon\nIf you aren't the seller you should be......very transparent.....\n\nI concur with Jon...he might even be being optimistic on value, imho",
      "post_time": "20080924T10:37:00-06:00",
      "timestamp": "1222274220"
    },
    {
      "post_id": "683809",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: Steve Murray\n[url]http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=320299681787&ru=http%3A%2F%2Fsearch.ebay.com%3A80%2Fws%2Fsearch%2FSaleSearch%3Fsofocus%3Dbs%26satitle%3D320299681787%26sacat%3D-1%2526catref%253DC5%26dfsp%3D32%26from%3DR7%26nojspr%3Dy%26pfid%3D0%26fsop%3D32%2526fsoo%253D2%26fcl%3D3%26frpp%3D50%26fvi%3D1[/url]",
      "post_time": "20080924T11:24:00-06:00",
      "timestamp": "1222277040"
    },
    {
      "post_id": "683810",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: lindwayjc\nI would think this Mayo pack has a much greater chance of holding a card like a T203 than some bogus GAI graded Sweet Caporal pack or those post deregulation Piedmont packs that people are trying to sell as T206 packs.  The date on the stamp tells me there's much great chance this has something of a card than the packs like the 1918 Piedmont 12 pack with Liggett and Myers on it that people are actually trying to pass off as T206 packs.",
      "post_time": "20080924T12:40:00-06:00",
      "timestamp": "1222281600"
    },
    {
      "post_id": "683811",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: leon\nThat is a poor argument. Saying a pack has a better chance of having a card in it than one that can't is a weak argument at best. I suspect you are the owner, and if you are, why don't you just feel the sides of the pack...if a card is in it then you will most likely be able to feel it. I have been able to feel cards in packs before..that were unopened. To get a true value of the pack just start it a .99 on ebay and let it run.....",
      "post_time": "20080924T12:56:00-06:00",
      "timestamp": "1222282560"
    },
    {
      "post_id": "683812",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: lindwayjc\nRead the item description!  Yeah, that is a poor argument.  But as poor as it may be, it's still a legitimate argument.\n\nThe bottom line is I personally haven't seen another one unopened.  Therefore, the very few that have survived and remain unopened are in collections and won't be seeing the light of day.  Overstamps tell it all.  This one has the correct overstamp date to go along with Mayo issues.  In the past 25 years of being in this hobby, I've seen unopened packs from many different sets and many brands.  With the exception of Lenox, I've seen every brand unopened from the T206 and T205 sets but not a Mayo.",
      "post_time": "20080924T13:08:00-06:00",
      "timestamp": "1222283280"
    },
    {
      "post_id": "683813",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: leon\nYou have seen an unopened Drum pack?  What did it look like? Did it have a tax stamp?  \n\nThe one thing I do agree with is that the overprint on the stamp is the ONLY way to definitely identify the date.....\n\nAlso, you didn't answer my question. Can you feel a card in the pack by gently squeezing it?",
      "post_time": "20080924T13:48:00-06:00",
      "timestamp": "1222285680"
    },
    {
      "post_id": "683814",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dave F\n\n\nI also didn't see an answer to if your the owner.  I would suspect the IP address puts him in Ohio though.",
      "post_time": "20080924T13:54:00-06:00",
      "timestamp": "1222286040"
    },
    {
      "post_id": "683815",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: lindwayjc\nYes...on the side opposite the tax stamp there is without a doubt something rectangular inside the foil.  It feels like it could be roughly 2x3.\n\nAs far as the Drum brand is considered there are a couple different theories.  I owned three different unopened Drum packs at one time.  I've sold two of them...both had 1910 tax stamps on them...but one had a 1913 overstamp.  One of those I sold is the one that is currently up on t206museum.  I just sold that one in particular within the past year.  It was not authenticated when I sold it.  So GAI just did that in the past eight months or so.  I had it appraised by Mr. Doug Allen of Mastro Auctions and he said around 2-3K.  I sold it in that ballpark.  I don't know why the current owner is trying to get 11.5K out of it?!!  Yikes...but that's imho! I also had several of the wrappers...still have a couple left if you're interested.\n\nI know some people believe the Drum baseball cards were inserted into the packs of cigarettes that were distributed by Drummund Tobacco out of St.Louis.  My major argument against that particular brand is the factory.  The Drum baseball cards were never issued out of a St.Louis factory but rather a factory in Virginia.  The Drum pouches/wrappers were ATC factories unlike Drummund Tobacco.  Drummund Tobacco continued in St.Louis and from all the research I've done, never moved to a factory outside of St.Louis let alone in Virginia.  So the Drummund Cigarette box that is seen every now and then has a slim to none chance that's the correct one.  And the ATC factory numbers point to the pouches/wrappers.  On a very interesting sidenote, were the cards randomly placed in the tobacco pouches or the wrappers with the rolling papers?  Some say the Drum cards show staining similar to the Polar Bear cards.  And to those that disagree with them being placed in the pouches, how about the theory they were placed in the rolling paper wrappers?\n\nIt's a very interesting argument!  Who knows!!  The only way we will ever find out is by discovery of an advertisement or ATC documentation!",
      "post_time": "20080924T14:04:00-06:00",
      "timestamp": "1222286640"
    },
    {
      "post_id": "683816",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: Jon Canfield\nTo add to the Drum discussion.  Since the photo I have on my website is the only known Drum cigarette pack that exists, I am fairly certain you are referring to that Drum cigarette box.\n\nIt has never been my contention that the Drum backed T-206 cards were issued under the Drummond Brand.  The American Tobacco Company purchased the Drummond brand in 1898.  From that date forward, Drummond products (including Drum cigarettes, Cannon cigarettes, etc) were issued under the American Tobacco Brand.  It just so happens that the only survivng Drum cigarette box known to exist comes from 1897, prior to the American Tobacco Company's acquisition of Drummond.  Hence, the Drummond's St. Louis info appears on the package.  However, the graphics from this 1897 box would be identical or nearly identical to the 1909era pack.\n\nAfter the 1898 purchase of Drummond, the American Tobacco Company shifted all Drummond cigarette production to Virginia, North Carolina, and NY - where all of the other major cigarette plants were being operated.  The manufacturing did not stay in St. Louis and any former Drummond product would have NY, VA, or NC as the state of production from 1898 on.  This is actually very easy to verify because most people aren't aware that the ATC's interest in Drummond was to acquire Chesterfield.  Chesterfield cigarettes were Drummond's most popular brand.  If one was to look at any Chesterfield pack prior to 1898, it would have been produced in St. Louis.  After 1898 - the east coast factories.  Also, if one was to search the public records on the purchase of Drummond by James Duke, there are documents showing the shift from the St. Louis production to east coast production.  Hence, after the Drum brand was acquired in october of 1898, production was shifted to VA.\n\nOn my website, I clearly state this in the description: \"T206’s bearing a Drum back advertisement were packaged in what is believed to be 10-count slide & shell boxes of Drum Cigarettes. To date, the only Drum cigarette box known to exist belongs to long-time collector Joe Hudgins and is pictured above. As can be seen in the photo, this box pre-dates the T206 issue (and actually pre-dates the American Tobacco Company's acquisition of Drummond Tobacco Company in 1898.) The graphics from the Drum cigarette box pictured above are believed to be identical to that of the 1910-era Drum cigarette box. The configuration of the 1910 box, however, would be a slide & shell.\"\n\n[url]http://baseballandtobacco.com/t206.htm[/url]\n\nSo, I am unaware of anyone claiming that Drum backed T206s were packaged in Drummond products out of St. Louis and what was stated above to that regard was a mistake or a misreading of my website.  Furthermore, the 1909 American Tobacco Circular (as well as the 1912 Circular) shows Drum Cigarette configurations as being available.\n\nWhile I choose not to elaborate here, it is strictly wishful thinking to believe that the Drum scrap pouches contained the T206 cards.  While the ATC did manufacture Drum pouches, they were not related to the distribution of the cards at all.  The American Tobacco Company issued many different types of products for the various brands.  For example, there were Sweet Caporal Cigars and Sovereing Cigars.  However, these products, while related, did not contain baseball cards.  This holds true for Drum tobacco pouches as well.  While others may believe to the contrary, there is no evidence supporting such a view that Drum pouches held cards.\n\nLastly, you stated above that the only pack you have never seen unopened is a Lenox.  I would be very interested in knowing where you were able to locate and/or see an unopened Broadleaf, Hindu or Uzit.  Heck, I'd even love to know where you saw opened examples!  To date, I have only been able to locate 1 opened Broadlead pack dating to the correct year of the T-206 set (and six total Broadleaf boxes).  To date, I have never located a Hindu box (opened or unopened) and our only images of one come from the Hindu ads.  Finally, I have only documented the existence of 2 opened Uzit boxes.",
      "post_time": "20080924T15:05:00-06:00",
      "timestamp": "1222290300"
    },
    {
      "post_id": "683817",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: Jon Canfield\nI forgot to add in my previous post that here is an image of another Mayo pack which is unopened:\n\n[url]http://baseballandtobacco.com/n301.htm[/url]\n\nIt is in my personal collection and has an 1897 overprint on it.  Also, as I stated above, I have sold many other unopened Mayo packs so I would estimate I have handled 9-10 in total (unopened).\n\n======================================\nFor the premier online souce of information on baseball-related cigarette packs, visit [url]http://www.baseballandtobacco.com[/url]",
      "post_time": "20080924T15:08:00-06:00",
      "timestamp": "1222290480"
    },
    {
      "post_id": "683818",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: lindwayjc\nThe gentleman who was responsible for getting me hooked on tobacco cards has them all in a private collection back in Tiffin Ohio...just because you've never seen them doesn't mean they don't exist!  Being in awe, I was hooked!  There are people out there with collections that keep them private.\n\nA Hindu box just sold as part of a cigarette box/tobacco lot back in the spring.  I believe it was empty though.  Check one of the larger sports auction houses.  They had it.\n\nDrummond Tobacco Co. out of St.Louis was a well-known plug and raw scrap tobacco company.  Now this is what I remember from my research.  I also was under the impression that once old man Drummond passed away in 1898 the ATC discontinued their cigarette making to focus on plug and long cut into the 20th century...since 1898 was known as the great Plug Tobacco War between Drummond, L&M and Duke.\n\nThe 1900 overstamp on the Mayo pack is what I think is the key.  That was the first year for the T203 set!",
      "post_time": "20080924T17:29:00-06:00",
      "timestamp": "1222298940"
    },
    {
      "post_id": "683819",
      "post_title": "Mayo Cut Plug unopened pack",
      "post_author_name": "Archive",
      "post_content": "Posted By: Jon Canfield\nThe Hindu pack that sold in the lot was the wrong style and configuration based on the advertisements relating to the T206 distribution.  As for unopened Uzit, Broadleaf and Hindu packs, I remain highly skeptical.  \n\nIn writing the guides on collecting baseball related cigarette packs, I spoke with countless collectors, many of whom have focused on collecting rare cigarette packs for 50+ years (such as Jim Shaw, Joe Hudgins, Joe Tipton, etc).  None of these gentlemen focus on baseball related packs but cigarette packs in general.  None of these men have ever found, seen, heard of or know of the existence of any such unopened packs.\n\n======================================\nFor the premier online souce of information on baseball-related cigarette packs, visit [url]http://www.baseballandtobacco.com[/url]",
      "post_time": "20080925T07:56:00-06:00",
      "timestamp": "1222350960"
    }
  ]
}