{
  "id": "147686",
  "forum_id": "13",
  "title": "Thread N/A",
  "author": "broadhurstinc",
  "reply_count": 3,
  "view_count": 617,
  "created_date": null,
  "last_reply": "20120216T19:09:53-06:00",
  "posts": [
    {
      "post_id": "967507",
      "post_title": "Thread N/A",
      "post_author_name": "broadhurstinc",
      "post_content": "I'm looking to buy a $700k cnc machine for my business and have decided to sell my T206 collection to help keep the payments down. \n\nThe set is 71% complete (approx 375 cards) Included is a magie error sgc 30, all other cards are graded 60 - 96 with quite a few being highest graded examples.\n\nlink to set:\n[url]http://www.sgccardregistry.com/set.aspx?cat=1&set=239&userset=6302[/url]\n\nI will Not sell individual cards or items at this time so please do not ask, I just don't have the time for scanning, emailing, and shipping them all. If there is no interest in the set as a whole i will be breaking it up and sending groups to various auction houses in the near future. \n\nI believe i have close to 200k invested. Going by psa's smr it adds up to 135k and thats not taking into acct backs or actual values of certain cards. For instance, i valued a lenox backed 5 the same as a piedmont 5. \n\nI am still working on coming up with a accurate number and will post it when i do. for the interim i will entertain and discuss offers from serious buyers. \n\nThank You,\nKristopher J. Lill",
      "post_time": "20120215T20:26:31-06:00",
      "timestamp": "1329362791"
    },
    {
      "post_id": "967632",
      "post_title": "",
      "post_author_name": "rp12367",
      "post_content": "Kris, No joke intended, I wish I had the money, so you could buy that machine, and you keep your cards. I hate to see your collection get split up and sold off, after all that hard work. You have built an amazing collection of cards. I have gotten quite a few of them on here and e-bay as you presumably upgraded cards. I wish you all the best with the sale. Hope you don't leave the hobby all together!!! Ralph",
      "post_time": "20120216T11:21:23-06:00",
      "timestamp": "1329416483"
    },
    {
      "post_id": "967645",
      "post_title": "",
      "post_author_name": "scottglevy",
      "post_content": "Delete (sorry didn't read the whole posting).",
      "post_time": "20120216T11:59:30-06:00",
      "timestamp": "1329418770"
    },
    {
      "post_id": "967801",
      "post_title": "",
      "post_author_name": "dickie1962",
      "post_content": "What type of CNC? I own a CNC job shop (turning and milling). Hope you get what you need to help with financing. Capital costs can be tough. Good luck!",
      "post_time": "20120216T19:09:53-06:00",
      "timestamp": "1329444593"
    }
  ]
}