{
  "id": "232433",
  "forum_id": "13",
  "title": "Found!!",
  "author": "conor912",
  "reply_count": 9,
  "view_count": 622,
  "created_date": null,
  "last_reply": "20170309T18:25:36-06:00",
  "posts": [
    {
      "post_id": "1610341",
      "post_title": "Found!!",
      "post_author_name": "conor912",
      "post_content": "Looking for VG-ish. Trying to upgrade a beater, which I'd happily trade plus some cash.",
      "post_time": "20161213T20:34:42-06:00",
      "timestamp": "1481686482"
    },
    {
      "post_id": "1615146",
      "post_title": "",
      "post_author_name": "conor912",
      "post_content": "Bump",
      "post_time": "20161229T21:06:45-06:00",
      "timestamp": "1483070805"
    },
    {
      "post_id": "1615260",
      "post_title": "Obak",
      "post_author_name": "JohnP0621",
      "post_content": "There was A real nice SGC 50 that ended in Sterling Auction last night\n\nJohn P",
      "post_time": "20161230T11:02:00-06:00",
      "timestamp": "1483120920"
    },
    {
      "post_id": "1615371",
      "post_title": "",
      "post_author_name": "conor912",
      "post_content": "[quote name=\"JohnP0621\" post=1615260]There was A real nice SGC 50 that ended in Sterling Auction last night\n\nJohn P[/QUOTE]\n\nYeah, I got blown out of the water. It was over $210 w/juice when I dropped out. It went for 4x what a lot of the other Obaks went for in the same grade....I'm happy to pay a premium, but that's stupid money.",
      "post_time": "20161230T16:01:27-06:00",
      "timestamp": "1483138887"
    },
    {
      "post_id": "1615480",
      "post_title": "Obak",
      "post_author_name": "JohnP0621",
      "post_content": "I also thought that card ended at a crazy price.\nI thought the Browning \"Just Right\" back was harder to find and it sold for $82. Same grade? \n\nJP",
      "post_time": "20161231T07:02:41-06:00",
      "timestamp": "1483192961"
    },
    {
      "post_id": "1615556",
      "post_title": "",
      "post_author_name": "conor912",
      "post_content": "Yup, same grade. Nice for the grade, but I think it's a testament to the rarity of that back. I'm obviously not the only one who's had trouble finding one. That said, yes, I have paid $60-80 for all of the other cards in the run. I'm willing to pay double that for the last one I need...any more than that would leave a bad taste in my mouth.",
      "post_time": "20161231T11:17:22-06:00",
      "timestamp": "1483208242"
    },
    {
      "post_id": "1615574",
      "post_title": "",
      "post_author_name": "VoodooChild",
      "post_content": "I needed 8 for the run going into Sterling.  There were 5 that I needed, won 3 including the Fisher \"Mais Paper Wrapper\".  I've only been at this for a little over 2 years.  Until recently, I had never seen a \"Just Right\" available, but then there were 2 Kusel's and now a Browning (I think the only 2 players with Just Right) available recently.  I got one of the Kusels.  Yes, it was a great deal on the Browning.  It crossed my mind to try and win it, but it's better off going to someone else try for the run.\n\nFor 25 of the 35, I averaged around $35-$50.  But then it got tough.  There has been a Briggs \"Mais Paper Wrapper\" PSA 6 for $450 listed by that Ypeg's eBay museum forever and I think I saw a Berry available when I first started.  But that's all the Mais Paper Wrappers I've seen.  Plus I thought the Fisher had good eye appeal for the grade and I like cards with the Vernon players.  Something about those hats.  So that's why I went all in on it.\n\nI still need 5 and have never seen a \"Immensly Popular\" or \"Delicate Aromatic\" so I'll be on the lookout for those.  \"Everyone Satisfies\", \"Perfect Aroma\", and \"They Please\" are the others but they are available, just waiting for the right one.\n\nI'm pretty sure Lee stated this was 1 of a 3 part T212 action.  So maybe there will be another Mais Paper Wrapper available.  I won't be bidding.  Good Luck and Happy New Year!",
      "post_time": "20161231T11:44:35-06:00",
      "timestamp": "1483209875"
    },
    {
      "post_id": "1615663",
      "post_title": "",
      "post_author_name": "conor912",
      "post_content": "Thanks for chiming in Jason. Congrats on the pickup....you just wanted it more than me. It was obvious I was going up against another run builder and I wasn't about to test your limit. It's funny, Just Right became available to me early on so I never thought of it as tough. MPW and Delicate Aromatic have proven to be the two toughies for me. I got the DA a few months ago finally and got a beater MPW thrown into the deal, which badly needs upgrading. It seems crazy to me that I finished my '33 Goudey set in less time than this slogan run, but c'est la vie.",
      "post_time": "20161231T15:48:06-06:00",
      "timestamp": "1483224486"
    },
    {
      "post_id": "1629473",
      "post_title": "",
      "post_author_name": "conor912",
      "post_content": "still looking",
      "post_time": "20170210T14:30:48-06:00",
      "timestamp": "1486762248"
    },
    {
      "post_id": "1639385",
      "post_title": "",
      "post_author_name": "conor912",
      "post_content": "Still looking. Just got outbid in yet another Sterling auction. Will happily trade crazily in your favor.",
      "post_time": "20170309T18:25:36-06:00",
      "timestamp": "1489109136"
    }
  ]
}