{
  "id": "112683",
  "forum_id": "13",
  "title": "COMPLETED AUCTION on Net54, Mullins T206 sold!!",
  "author": "FrankWakefield",
  "reply_count": 30,
  "view_count": 1677,
  "created_date": null,
  "last_reply": "20090605T06:43:45-06:00",
  "posts": [
    {
      "post_id": "726118",
      "post_title": "COMPLETED AUCTION on Net54, Mullins T206 sold!!",
      "post_author_name": "FrankWakefield",
      "post_content": "Let me attempt to auction this T206 of Wabash George Mullin.\n\nIf you want to bid, type in and post a bid. Post only a bid higher than the last one posted. Any cent increment is acceptable.\n\nThere is no time limit on the auction. Eventually, it will either reach a level at which I'll sell, at which time I'll post mentioning that the auction is about to close and then I'll give it a bit longer...  Or eventually I'll decide that the level reached is insufficient for me to sell and the auction will close.\n\nI'll notify the winner here.\n\nPayment by Paypal is fine, or I'll accept a USPS money order. I'll ship first class with delivery confirmation in a top loader with padding for $2.50. I'll ship any other way you want for additional cost. And I'll ship it for a dollar to the handful of folks I know well, without delivery confirmation, IF they want it sent that way.\n\nFinally, if you don't like the way this auction is done, please start a thread on the main board about it, please don't post complaints amongst the bids. Thank you.\n\nFrank.\n\n[IMG]http://www.net54baseball.com/picture.php?albumid=17&pictureid=431[/IMG]\n\n[IMG]http://www.net54baseball.com/picture.php?albumid=17&pictureid=432[/IMG]",
      "post_time": "20090527T21:12:46-06:00",
      "timestamp": "1243480366"
    },
    {
      "post_id": "726123",
      "post_title": "Let me step up and start the bidding !",
      "post_author_name": "DixieBaseball",
      "post_content": "$2",
      "post_time": "20090527T21:36:49-06:00",
      "timestamp": "1243481809"
    },
    {
      "post_id": "726133",
      "post_title": "",
      "post_author_name": "iggyman",
      "post_content": "Since I really want to win the first ever Net54 (2009 version) B/S/T auction and to show I mean business!  I will increment the bid on lot #001 a whopping 40%.  Thus, $2.80 is my bid!\n\nBy the way, when I win this card, does the envelope come with fancy wrapping tape?\n\nLovely Day...",
      "post_time": "20090527T23:11:19-06:00",
      "timestamp": "1243487479"
    },
    {
      "post_id": "726144",
      "post_title": "",
      "post_author_name": "scottglevy",
      "post_content": "Sure I'll play.....\n\n$4\n\nGood Luck,\nScott",
      "post_time": "20090528T01:17:11-06:00",
      "timestamp": "1243495031"
    },
    {
      "post_id": "726148",
      "post_title": "",
      "post_author_name": "tiger8mush",
      "post_content": "$5\n\nRob\n:o)",
      "post_time": "20090528T04:32:56-06:00",
      "timestamp": "1243506776"
    },
    {
      "post_id": "726149",
      "post_title": "Great Idea!!",
      "post_author_name": "mantleman",
      "post_content": "I'll bid 9.75.  Thanks, Andy",
      "post_time": "20090528T04:33:35-06:00",
      "timestamp": "1243506815"
    },
    {
      "post_id": "726159",
      "post_title": "",
      "post_author_name": "ullmandds",
      "post_content": "sorry Mr Great Wake.",
      "post_time": "20090528T06:14:45-06:00",
      "timestamp": "1243512885"
    },
    {
      "post_id": "726265",
      "post_title": "",
      "post_author_name": "FrankWakefield",
      "post_content": "Bidding is at a sufficient level where I will sell the card. I'll give more time for folks to bid, it's been up less than 24 hours.\n\nDentist, message sent.",
      "post_time": "20090528T12:23:09-06:00",
      "timestamp": "1243534989"
    },
    {
      "post_id": "726269",
      "post_title": "I'll Play",
      "post_author_name": "rdixon1208",
      "post_content": "$11",
      "post_time": "20090528T12:31:16-06:00",
      "timestamp": "1243535476"
    },
    {
      "post_id": "726349",
      "post_title": "",
      "post_author_name": "B O'Brien",
      "post_content": "Since I can't afford to bid in any real auctions, I'll toss out:\n$11.25\n\nThanks,\nBob\n[url]upperhandisforemost@yahoo.com[/url]",
      "post_time": "20090528T16:16:27-06:00",
      "timestamp": "1243548987"
    },
    {
      "post_id": "726358",
      "post_title": "",
      "post_author_name": "Edwolf1963",
      "post_content": "$12",
      "post_time": "20090528T16:37:59-06:00",
      "timestamp": "1243550279"
    },
    {
      "post_id": "726368",
      "post_title": "Oh I'll play",
      "post_author_name": "T206Collector",
      "post_content": "$12.50.  That'll make it a nice round $15 with shipping.",
      "post_time": "20090528T16:57:14-06:00",
      "timestamp": "1243551434"
    },
    {
      "post_id": "726410",
      "post_title": "",
      "post_author_name": "FrankWakefield",
      "post_content": "This auction is going well, thank you, bidders.\n\nThe auction will close at 10:05 am Saturday, May 30th, if there have been no bids after 10:00 that morning. If there is another higher bid, then the auction will end after 5 minutes have passed with no additional bids.\n\nSo.... \"Going once...\"",
      "post_time": "20090528T19:25:05-06:00",
      "timestamp": "1243560305"
    },
    {
      "post_id": "726461",
      "post_title": "",
      "post_author_name": "sbfinley",
      "post_content": "I'll offer $15 just to stick it to ebay! All hail LEONBAY!!",
      "post_time": "20090529T00:55:40-06:00",
      "timestamp": "1243580140"
    },
    {
      "post_id": "726648",
      "post_title": "",
      "post_author_name": "FrankWakefield",
      "post_content": "Thank you guys...\n\n\"We now have $15,  $15 going once...   going twice... \"\n\n\nIf you guys get this over $22 I'll send it 1st class with no charge for shipping.",
      "post_time": "20090530T06:28:43-06:00",
      "timestamp": "1243686523"
    },
    {
      "post_id": "726653",
      "post_title": "",
      "post_author_name": "FrankWakefield",
      "post_content": "Congratulations Steven...\n\nSOLD to the man from Nashville for $15...  \n\nPlease email me an address and I'll get Wabash George in the mail to you.  [url]fwakefield1@comcast.net[/url]",
      "post_time": "20090530T08:13:17-06:00",
      "timestamp": "1243692797"
    },
    {
      "post_id": "726671",
      "post_title": "Whoops",
      "post_author_name": "rdixon1208",
      "post_content": "You said the auction would end at 10 AM, and I just assumed we were all in the same time zone. Aside from that, I think it went OK. Thanks for demonstrating to all of us that an auction can be done on the BST. Maybe I will try my luck soon.",
      "post_time": "20090530T11:30:28-06:00",
      "timestamp": "1243704628"
    },
    {
      "post_id": "726674",
      "post_title": "",
      "post_author_name": "FrankWakefield",
      "post_content": "Robert, you are correct, and my apologies to you...\n\n\nWhen I set an ending time it was after T206Collecter had bid $12.50. With him as high bidder at the time, I asked him when would  he be around his pc, when would be a convenient time for the auction to end for him. Seemed a fair courtesy for the high bidder...  he said 10am EST...  I omitted the EST. Truly sorry.  Thanks to Robert, I'll make certain to specify time zone next time.\n\nThis has gone fairly well. I'll auction another T206 in the next few days.\n\nFW",
      "post_time": "20090530T11:49:10-06:00",
      "timestamp": "1243705750"
    },
    {
      "post_id": "726765",
      "post_title": "",
      "post_author_name": "sbfinley",
      "post_content": "Awesome! Winning Net54 lot #1 is great honor. I was going to go for the CJ ad in REA but this is history in the making.",
      "post_time": "20090531T02:26:30-06:00",
      "timestamp": "1243758390"
    },
    {
      "post_id": "726770",
      "post_title": "",
      "post_author_name": "tiger8mush",
      "post_content": "Steven, the awesomeness isn't over yet.  Imagine the aura that will surround the card if you send it in to SGC and have them encapsulate it with a tag that reads \"Net54 Lot #1\"!!  Talk about Pedigree!\n\nRob\n:o)",
      "post_time": "20090531T06:09:52-06:00",
      "timestamp": "1243771792"
    },
    {
      "post_id": "726778",
      "post_title": "nice one",
      "post_author_name": "Leon",
      "post_content": "I am happy this went fine. I don't mind them (auctions) as long as ya'll are understanding of the situation (and all were). I will reserve the right to nix them or specific people if they do one and it gets too muddied up. I strongly prefer to stay out of it, unless I am bidding :).....Caveat Emptor and Mr.Wakefield is given a big \"kudo's\"......\n \n[URL=\"http://www.sweetim.com/s.asp?im=gen&lpver=3&ref=10\"][IMG]http://cdn.content.sweetim.com/sim/cpie/emoticons/00020210.gif[/IMG][/URL]",
      "post_time": "20090531T08:12:20-06:00",
      "timestamp": "1243779140"
    },
    {
      "post_id": "726779",
      "post_title": "Nashville Book Ends...",
      "post_author_name": "DixieBaseball",
      "post_content": "Let me first start by Congratulating you Steven, on winning the first every Net54 Auction!\n\nI really liked Frank's idea and think it could be the birth of possibly more to come... There is no reason Net54bay can not start taking market share away from Ebay in the Baseball Vintage Collectible business.\n\nI like the SGC Encapsulate idea... That is hilarious, but actually cool too.\n\nI am honored to be the first bidder ever for the first auction on Net54. I am sure while you will have all the glory, I will be a part of some trivia contest in the future that no one will be able to answer !\n\nWay to go on the card !;)",
      "post_time": "20090531T08:15:01-06:00",
      "timestamp": "1243779301"
    },
    {
      "post_id": "727730",
      "post_title": "",
      "post_author_name": "FrankWakefield",
      "post_content": "As best as I can tell, this auction has successfully concluded.\n\nI mailed the card Monday, 6-1-09. And Steven sent payment. He's received the card, and I got payment today, 6-4. Foolish me sent it before payment was received, Steven's a good ol' boy down Tennessee way about an hour from here, about 15 minutes from where Hub Perdue grew up years ago. So I knew he'd be good for the card.\n\nI'll get another auction up soon. Might as well fool with this a few times more.\n\nAnd Steven, if you try to get the card slabbed as above, I'll send a letter on letterhead attesting to provenance!\n\nFW",
      "post_time": "20090604T18:10:38-06:00",
      "timestamp": "1244160638"
    },
    {
      "post_id": "727744",
      "post_title": "",
      "post_author_name": "Adam",
      "post_content": "Leon - \n\nDoesn't it make sense to have a separate spot in the B/S/T specifically for auctions if these are going to increase in frequency?  \n\nThe problem with \"auctions\" on the B/S/T is they keep getting \"bumped\" to the top whenever someone else bids.  An even bigger problem are these \"dutch auctions\" we have been seeing, in which the person conducting the auctions automatically \"bumps\" the auction to the top every single day due to the \"price falling.\"\n\nIt's almost like what we have now is eBay -- EXCEPT we don't have the wonderful eBay option of sorting between auctions and fixed price listings.\n\nThe B/S/T used to always be about fixed price listings.  I fear this new auction idea, and the signifiicant amount of \"bumps to the top\" that come along with that format, is entirely unfair to fixed price listings (the long staple of the forum).  \n\nA separate place on the B/S/T just for auctions could solve this problem.  Or, at minimum, a rule for all dutch auctions that a dutch auction seller has to just edit their listing with the \"falling price,\" as opposed to bumping their listing to the top every single day.\n\nBut maybe the solution is already here --- why shouldn't the auction folks just post and conduct their auctions in the already existing, applicable, and appropriately named \"Ebay/Vintage Card Auctions VBC Forum B/S/T\" section of the B/S/T??",
      "post_time": "20090604T19:12:50-06:00",
      "timestamp": "1244164370"
    },
    {
      "post_id": "727752",
      "post_title": "",
      "post_author_name": "FrankWakefield",
      "post_content": "This auction here wasn't bumped to the top to generate interest.\n\nI do see some regular BSTs that get bumped because the seller is lowering their price. I'm not sure what the harm is in that, Adam... \n\nI recall when I first found the old board I posted something about buying or selling, I forget which, on the regular board, not understanding that it should be on the other side. I was shot down for that, which I found annoying at the time, even though it was done fairly nicely. So I left the place alone for a year or two...  Still, today, someone will do what I did years ago. And we jump on them, and they go away. Now that I'm here I see that buying and selling on the regular board would detract from what we strive to do, but on the main board there's more visibility. To create yet another place to look for a card transaction seems an ineffective and incorrect way to deal with it. So rename it BATS for BuyAuctionTradeSell. Or maybe Adam is right, and if he is why stop where he says, with two places, BST and A? Change it to four places, B and S and T and A.  No, one place is enough, BATS.",
      "post_time": "20090604T19:52:20-06:00",
      "timestamp": "1244166740"
    },
    {
      "post_id": "727753",
      "post_title": "",
      "post_author_name": "Rob D.",
      "post_content": "Adam makes a valid point.",
      "post_time": "20090604T19:55:23-06:00",
      "timestamp": "1244166923"
    },
    {
      "post_id": "727754",
      "post_title": "",
      "post_author_name": "Anthony S.",
      "post_content": "I agree with Adam.   It's one thing if there's only one or two auctions running in a category on the BST.   But if the idea catches on, and I sense it will, fixed price sales are going to routinely get knocked pretty far down the forum pretty quickly.  I know from personal experience, ie the page view counter on my imageevent website, that when my sales listings are at the top of a BST forum I get a helluva lot more page views than I do when they get knocked down a few spots.  And that translates to sales.  And if someone is trying to sell 20 separate cards and they keep getting knocked further down the forum by multiple auctions in which people are raising bids for a solitary card from $7 to $7.50, I can see it becoming very frustrating for sellers.\n\nAll that being said, I like Frank's initiative and I think auctions will enhance the BST experience, but if a separate category can be created without too much hassle for the moderators, then it should.",
      "post_time": "20090604T20:03:31-06:00",
      "timestamp": "1244167411"
    },
    {
      "post_id": "727755",
      "post_title": "",
      "post_author_name": "caramelcard",
      "post_content": "I definitely agree with Adam,\n\nThis auction was a great idea, but I don't want to see a $15 auction or a $1000 auction on the B/S/T with 10-20 posts if they're going to increase in frequency.\n\nRob",
      "post_time": "20090604T20:06:08-06:00",
      "timestamp": "1244167568"
    },
    {
      "post_id": "727757",
      "post_title": "",
      "post_author_name": "Adam",
      "post_content": "[quote name=\"FrankWakefield\" post=727752]This auction here wasn't bumped to the top to generate interest.[/QUOTE]\n\nI know it's not you Frank, rather it's just the nature of \"the auction format\" of selling things that is responsible.  That's why I think people using this format going forward should not post here, rather they should post in the section of the B/S/T already designed specifically for \"vintage card auctions.\"  \n\nTake a look at the sheer number of replies to your original posting that it took to successfully sell a single T206 common (it took 14 by my count).  Now compare that to the average number of replies to sell something via the long-standing fixed price format (usually 3 or less).  And remember, each reply represents a \"bump to the top,\" which, of course, results in someone else being \"pushed to the bottom.\"   \n\nAn auction format sale, not conducted in the existing \"vintage card auctions\" section of the B/S/T, is just not fair to those who use the long-standing fixed price format in my opinion.  \n\nI entirely agree there is a place for auctions in this forum, and you did a great job of raising awareness.   I am just questioning where the appropriate \"home\" for those auctions is . . . . and in my opinion it is in the existing and appropriately named \"vintage card auctions\" section of the B/S/T.  It is a detriment to others for auctions to be conducted anywhere else (as, for example, evidenced by the sheer number of replies, or \"bumps to the top,\" that it took to successfully sell a single T206 common).",
      "post_time": "20090604T20:09:25-06:00",
      "timestamp": "1244167765"
    },
    {
      "post_id": "727802",
      "post_title": "",
      "post_author_name": "chaddurbin",
      "post_content": "if this \"n54 auction\" idea catches on...i want to throw my hat in as the official payment processor for a \"safe\" and \"worry-free\" experience.  i will only take 2.5% as opposed to paypal's 3%.",
      "post_time": "20090605T00:45:29-06:00",
      "timestamp": "1244184329"
    },
    {
      "post_id": "727822",
      "post_title": "",
      "post_author_name": "FrankWakefield",
      "post_content": "Quan....\n\n\nI shipped the card before payment was received. We didn't need a safe conduit for payment, we weren't concerned about payment or shipment.\n\nStill, others might benefit from your kind offer!!  Quanpay, the safe, sure way to transfer money!",
      "post_time": "20090605T06:43:45-06:00",
      "timestamp": "1244205825"
    }
  ]
}