{
  "id": "157696",
  "forum_id": "13",
  "title": "*** Very tough t209 BE Thompson ...now sold!! ***",
  "author": "shammus",
  "reply_count": 3,
  "view_count": 1041,
  "created_date": null,
  "last_reply": "20130424T16:19:22-06:00",
  "posts": [
    {
      "post_id": "1044144",
      "post_title": "*** Very tough t209 BE Thompson ...now sold!! ***",
      "post_author_name": "shammus",
      "post_content": "Very desireable and popular card in any grade.  Can't remember the last time this card came available anywhere but I believe it's been years since I've seen one made available publically.  I can't recall seeing more than 1-2 for sale in the past decade.  This one has it's flaws however the photo area of this particular card isn't too bad.  Does have chipping and wrinkling on front with some damage to the back. \n\nIn particular, I'm looking for a few cards in trade -\n\nCaramel cards with color variations on front\nt210 orange borders (need 5) maybe more?? - Johnston, Thebo, Alexander, Billiard, Munsell\neunc orange borders (need 7) - Davis, Devlin, Doolan, Laporte, Lord, and McConnell AND Wagner batting\nd311s (need 8) - Daley, Delhi, Lewis, Maggert, Mohler, Patterson, Peckinpaugh, Rapps\ne98 commons (need 4) - orange - Kling, Mullin; red - Kling; green - Vaughn; \n1909 Obaks (need 7) - Brashear, Gandil, Mundorff, Nagle, Reidy, Stovall, Wiggs,  \nd310s (Have 7...need the others) - Browning, Delmas, Maggart, Mitze, Ross, Steen, Tiedeman\nt204s (need 53): Ball (NY), Bates, Beebe, Blankenship, Bowerman, Bransfield, Burchell, Byrnes, Carrigan, Clymer, Coakley, Coombs, Crandall, Davis, Donahue, Dorner, Fromme, Ganley, Graham, Hoblitzel, Howard, Kahoe, Kleinon, Lobert, Lush, Manning, McAleer, McConnell, McCormick, McIntyre, Merkle, Mitchell, Moran, Morgan, Murname, Murphy, Niles, O’Hare, Pelty, Pfeister, Raymond, Reilly, Ruelbach, Sallee, Schlei, Schulte, Shipke, Smith, Spencer, Stahl, Stephens, Sweeney, Tenney\n1918 Zeenuts - need any\n\nNot too eager to sell it, however I'd let it go for $985 if anyone wanted to go that route.\n\nThanks in advance....\n\nBrian\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=76208&d=1350168904[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=76209&d=1350168917[/IMG]",
      "post_time": "20121013T16:59:17-06:00",
      "timestamp": "1350169157"
    },
    {
      "post_id": "1109255",
      "post_title": "",
      "post_author_name": "shammus",
      "post_content": "Bump...BE Thompson is still available. Updated my wantlist up above...\n\nThanks!",
      "post_time": "20130327T18:43:27-06:00",
      "timestamp": "1364431407"
    },
    {
      "post_id": "1109409",
      "post_title": "",
      "post_author_name": "bbcard1",
      "post_content": "This is an odd question....do you know the origin of the card...the \"40\" written on the back is in the same writing/position/hand as a t210 I have...Same number for that matter also in pencil.",
      "post_time": "20130328T06:39:22-06:00",
      "timestamp": "1364474362"
    },
    {
      "post_id": "1122790",
      "post_title": "",
      "post_author_name": "shammus",
      "post_content": "Thompson has found a new home...thanks to all for the interest!",
      "post_time": "20130424T16:19:22-06:00",
      "timestamp": "1366841962"
    }
  ]
}