{
  "id": "114136",
  "forum_id": "13",
  "title": "FS: St. Louis Cardinals T-cards (T3, T222, T204, T201, T202)",
  "author": "acowan19",
  "reply_count": 1,
  "view_count": 448,
  "created_date": null,
  "last_reply": "20090719T11:27:55-06:00",
  "posts": [
    {
      "post_id": "736286",
      "post_title": "FS: St. Louis Cardinals T-cards (T3, T222, T204, T201, T202)",
      "post_author_name": "acowan19",
      "post_content": "I'm looking to sell a few St. Louis T-cards of mine.  I'm not looking to trade or pick-up any other cards, just strictly selling.  All prices are negotiable so send me an email if you're interested.  I also have scans of all the cards which I'd be happy to provide upon request.  Please post a reply or email me at acowan19@gmail.com.  Here's the list:\n\nKonetchy/Hauser Triple Folder - G (RAW) - $50\nCard has multiple horizontal creases (mostly through the center image).  No tears, marks or scuffs.  Edges and corners are in very good shape (no rounding or corners.)\n\nT204 Brynes (RAMLY) - VG (RAW) - $110\nCorners show slight wear with bottom left corner showing some creases/wrinkles.  No tears, marks or scuffs on front side.  Reverse has some marks/scuffs on the \"TURKISK CIGARETTES 10 for 10 Cents.\"\n\nT204 Lush (T.T.T.) - Poor (RAW) - $450\nHere is a poor conditioned T.T.T. card that present rather nicely.  The flaws come from two pin holes in the top corners (not that visible) and a small piece of the card missing from the top center border and a very small amount of the filigree.  There is a slight stain on the reverse.  Corners and edges show wear with some rounding and wrinkling/creasing.\n\nT201 Lush/Hauser Double Folder SGC 50/4 - $45 - SOLD -\nGrade attributed to wear around edges and corners.  Very nice looking card.\n\nT222 Fatima Slim Sallee SGC 20/1.5 - $175\nThis card has a couple creases that start along the edge (one right, one left) and go in about an inch, so neither crease goes across the entire card.  There is some scuffing on the top right corner and the top left corner is clipped.\n\nT3 Turkey Red Slim Sallee - VG (RAW) - $300\nThis T3 has some very slight, intermittent staining along the edges/corners.  There is one wrinkle that run downs the left edge, another on the bottom right corner and another on the bottom left corner.  There is also a small area of chipping on the right edge (about 1/3 from the top).  This card pairs nicely with the T222 since they both share the same pose.",
      "post_time": "20090715T14:13:26-06:00",
      "timestamp": "1247688806"
    },
    {
      "post_id": "737045",
      "post_title": "",
      "post_author_name": "acowan19",
      "post_content": "bump",
      "post_time": "20090719T11:27:55-06:00",
      "timestamp": "1248024475"
    }
  ]
}