{
  "id": "190926",
  "forum_id": "13",
  "title": "T222 and T200 pre-purchase advice",
  "author": "marvymelvin",
  "reply_count": 3,
  "view_count": 420,
  "created_date": null,
  "last_reply": "20140717T14:48:41-06:00",
  "posts": [
    {
      "post_id": "1298432",
      "post_title": "T222 and T200 pre-purchase advice",
      "post_author_name": "marvymelvin",
      "post_content": "I am wanting to finish my Fatima NY Yankees T222's (Keating, Chance, and Maisel) and NY Americans T200. I have the Chance and Maisel so just need the Keating and team card. There are a few of each on Ebay right now and was hoping for advice on them. Also, if any of the sellers of these examples are board members please chime in as I am serious about buying.\n\nI have included pictures of the actual cards for sale. The first pictures are of the team cards. Scroll past the team cards and you will find pictures of the Keatings along with questions I have about those.\n\nAlthough the sellers declared to me that they are original and not trimmed or altered I have no way of knowing for sure.\n\nWhat are your thoughts on trimmed or not trimmed? Also, the price discrepancy between the two team cards is considerable. With very little sales history, it is difficult to determine fair market value. (one is $600 and the other one is $1500).\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=152890&d=1405502580[/IMG]\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=152891&d=1405502593[/IMG]\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=152892&d=1405502607[/IMG]\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=152893&d=1405502633[/IMG]\n\nThe next pictures are of the two T222 Keatings for sale. One is graded and well centered and the other is off center and raw. Price on both is quite high, out of range for me anyway. (the raw one is $579 and the graded one is $750). I realize that there is a premium for short prints and I believe the Keating is a short print, but $750? Wow. Also what are your thoughts on trimmed or not trimmed for the raw Keating?\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=152886&d=1405502350[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=152887&d=1405502367[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=152888&d=1405502379[/IMG]\n\n[IMG]http://www.net54baseball.com/attachment.php?attachmentid=152889&d=1405502394[/IMG]",
      "post_time": "20140716T03:33:09-06:00",
      "timestamp": "1405503189"
    },
    {
      "post_id": "1298719",
      "post_title": "",
      "post_author_name": "ccre",
      "post_content": "$600 is a decent price for any non trimmed or altered authentic NY American team card. The first team card looks to good to be true and I am not sure about that white back.",
      "post_time": "20140716T19:16:55-06:00",
      "timestamp": "1405559815"
    },
    {
      "post_id": "1298742",
      "post_title": "",
      "post_author_name": "Danny Smith",
      "post_content": "Both are original. Tough to tell if they are trimmed because they are paper thin and hard to tell without a great scan. The NY American is arguably the toughest card in the set. If unaltered 600 is not a bad price. It took me a while to find that one for my set.",
      "post_time": "20140716T19:47:15-06:00",
      "timestamp": "1405561635"
    },
    {
      "post_id": "1299005",
      "post_title": "Keating....",
      "post_author_name": "Kzoo",
      "post_content": "I would prefer the ungraded Keating due to it having better contrast, even if the grade is not as good. The graded one is too washed out, IMO........however, I don't like either price and that's why they've both been for sale for quite awhile. Also, in regards to the t200 price......I bought mine at last year's National for $275 (I was very happy) and it might grade GD at best. It has nice contrast and fits nicely in my set.\n\nMatt",
      "post_time": "20140717T14:48:41-06:00",
      "timestamp": "1405630121"
    }
  ]
}