{
  "id": "119458",
  "forum_id": "13",
  "title": "T206 Looking for a Mathewson",
  "author": "Max_Bear_31",
  "reply_count": 15,
  "view_count": 683,
  "created_date": null,
  "last_reply": "20100110T08:29:02-06:00",
  "posts": [
    {
      "post_id": "773712",
      "post_title": "T206 Looking for a Mathewson",
      "post_author_name": "Max_Bear_31",
      "post_content": "hello - i am looking for a decent cond Mathewson ( white or dark ) cap",
      "post_time": "20100109T12:46:43-06:00",
      "timestamp": "1263066403"
    },
    {
      "post_id": "773720",
      "post_title": "Mathewson",
      "post_author_name": "pow323",
      "post_content": "I have this one if your interested.  Thanks!   [url]mpowers23@verizon.net[/url]",
      "post_time": "20100109T13:04:00-06:00",
      "timestamp": "1263067440"
    },
    {
      "post_id": "773723",
      "post_title": "",
      "post_author_name": "Max_Bear_31",
      "post_content": "that looks really nice - i am only looking for graded cards though",
      "post_time": "20100109T13:31:02-06:00",
      "timestamp": "1263069062"
    },
    {
      "post_id": "773730",
      "post_title": "t-206",
      "post_author_name": "pow323",
      "post_content": "What ever happened before the STUPID grading companys came along?",
      "post_time": "20100109T14:07:31-06:00",
      "timestamp": "1263071251"
    },
    {
      "post_id": "773733",
      "post_title": "",
      "post_author_name": "Jim VB",
      "post_content": "[quote name=\"pow323\" post=773730]What ever happened before the STUPID grading companys came along?[/QUOTE]\n\nWell, for one thing, no one purchased cards based upon scans only, over the internet. Many people were taken in by dealers selling cards that were over-graded, or even trimmed. \n\nGrading companies, while not perfect, have established a baseline level of comfort, for people purchasing cards from people they don't know.",
      "post_time": "20100109T14:15:35-06:00",
      "timestamp": "1263071735"
    },
    {
      "post_id": "773737",
      "post_title": "T206",
      "post_author_name": "batsballsbases",
      "post_content": "Nicely Said Jim:D:D:D",
      "post_time": "20100109T14:27:53-06:00",
      "timestamp": "1263072473"
    },
    {
      "post_id": "773739",
      "post_title": "",
      "post_author_name": "pow323",
      "post_content": "You mean like PRO Grading! The T-206 mathewson that I show a picture of here is a beauty and comes with a 100% money back guarantee. anyway most everyone that sells on this site is honest. At least the ones I have delt with.",
      "post_time": "20100109T14:32:13-06:00",
      "timestamp": "1263072733"
    },
    {
      "post_id": "773752",
      "post_title": "",
      "post_author_name": "Jim VB",
      "post_content": "[quote name=\"pow323\" post=773739]You mean like PRO Grading! The T-206 mathewson that I show a picture of here is a beauty and comes with a 100% money back guarantee. anyway most everyone that sells on this site is honest. At least the ones I have delt with.[/QUOTE]\n\nDon't put words in my mouth. No. I don't mean like PRO Grading. I mean SGC, PSA and Beckett's. \n\nI wasn't questioning the condition or authenticity of your card. I was just explaining why someone would be focused on graded cards. \n\nAnd, finally, yes, I believe almost everyone on this site is honest. Anyone who is not honest on this BST doesn't last very long. Same can't be said for the internet in general.",
      "post_time": "20100109T15:15:55-06:00",
      "timestamp": "1263075355"
    },
    {
      "post_id": "773754",
      "post_title": "",
      "post_author_name": "pow323",
      "post_content": "No Hard feeling by me!  Have a good day!  :)",
      "post_time": "20100109T15:23:03-06:00",
      "timestamp": "1263075783"
    },
    {
      "post_id": "773755",
      "post_title": "",
      "post_author_name": "Jim VB",
      "post_content": "Nor by me.",
      "post_time": "20100109T15:25:19-06:00",
      "timestamp": "1263075919"
    },
    {
      "post_id": "773760",
      "post_title": "",
      "post_author_name": "Max_Bear_31",
      "post_content": "thanks for everyones help - i just wanted graded cards thats all - not ripping on that card  its REALLY nice",
      "post_time": "20100109T15:51:17-06:00",
      "timestamp": "1263077477"
    },
    {
      "post_id": "773767",
      "post_title": "pow323......",
      "post_author_name": "tedzan",
      "post_content": "\" What ever happened before the STUPID grading companys came along? \"\n\npow323......\nNow, that is a really great question. From the late 19th Century to the early 1990's this hobby grew, flourished, and\n was immensely enjoyable without plastic rectangles with  assigned #s (at times  arbitrary) encapsulating a BB card.\n Most of those years, BB cards were reasonably affordable and altering (trimming, re-backing, etc.) them was not worth\n the time, trouble or the risk.\nAs prices started to really escalate (circa late 1980's), sure some dealers in the hobby  resorted to these \"measures\". \nBut, in the long run, those dealer's reputations have suffered.\n\nYour Matty looks good to me.  And, I am upgrading cards in my all-PIEDMONT set. So, if you are interested in selling or\ntrading  it, then email me at......\n\n[url]tedzan11@comcast.net[/url]\n\n\nTED Z",
      "post_time": "20100109T16:21:11-06:00",
      "timestamp": "1263079271"
    },
    {
      "post_id": "773775",
      "post_title": "Mathewson",
      "post_author_name": "Bridwell",
      "post_content": "I have a Mathewson dark cap PSA 4 I would sell.  Nice card, no problems.  Contact me privately to make offer.\n\nRon",
      "post_time": "20100109T16:47:44-06:00",
      "timestamp": "1263080864"
    },
    {
      "post_id": "773797",
      "post_title": "Just to kick it a bit further...",
      "post_author_name": "williamcohon",
      "post_content": "I have some graded cards.  I figured it was better to have PSA or SGC do the authentication on Ruth, Cobb, and Young, than to run the risk of paying real money for fakes.  Also, these days, more and more cards ARE graded.  So, if I'm searching for a card, and I find a graded specimen at an acceptable price, I end up with it.\n\nHere's the thing:  I still like to play with my cards, and the slabs get in the way.  No, no, I don't flip raw cards against a wall, or clothespin them to my bike.  \n\nMost of my cards are in top-loaders, stored in a cabinet in my closet.  So, on my way to work, I reach in and select five or six cards at random and put them in my shirt pocket or jacket pocket.  I get to amuse myself at lunch; I  open my pretend pack and see who I got.  It's fun.\n\nGraded slabs are all about the grown-up concerns of authentication, evaluation, and preservation.  When you hold a slab in your hand, you are reminded of investment issues.  You think about how good the card is and what you paid, and maybe you think about the size of the population in that condition.  \n\nBut when I examine a card in a top-loader, my mind and emotions are free. I can travel back in time, as if I were opening a pack a century ago.  My mind can wander over different terrain.  I think about the words used to describe baseball heroes a hundred years ago, and whether people thought different thoughts, or merely used different words.  I think about the artists' choice of backgrounds, and the prevailing view of America pictured in those backgrounds.  I consider the continuum of baseball, looking for that which is the same, and that which changes. \n\nAnyway, it is true that PSA and SGC have made it easier to buy expensive cards from strangers.  I just wonder if there are others who share my views and predilections.",
      "post_time": "20100109T18:36:56-06:00",
      "timestamp": "1263087416"
    },
    {
      "post_id": "773809",
      "post_title": "",
      "post_author_name": "ullmandds",
      "post_content": "that matty is a beaut...William...I agree wholeheartedly...I detest slabs...but they have become a way of life!",
      "post_time": "20100109T20:07:59-06:00",
      "timestamp": "1263092879"
    },
    {
      "post_id": "773878",
      "post_title": "",
      "post_author_name": "BlueDevil89",
      "post_content": "$399 delivered - I ship well packaged for protection and pay for insurance and delivery confirmation to guarantee your receipt of the undamaged card or your money back.   PayPal, USPS Money Orders, and personal checks accepted.\n\n[IMG]http://i222.photobucket.com/albums/dd47/BlueDevilSportscards/T206%201909-1911/ChristyMathewson_DarkCapT206Pied-1.jpg[/IMG][IMG]http://i222.photobucket.com/albums/dd47/BlueDevilSportscards/T206%201909-1911/ChristyMathewson_DarkCapT206Piedmon.jpg[/IMG]",
      "post_time": "20100110T08:29:02-06:00",
      "timestamp": "1263137342"
    }
  ]
}