{
  "id": "200951",
  "forum_id": "13",
  "title": "T207 anonymous?",
  "author": "t206 cubs",
  "reply_count": 3,
  "view_count": 786,
  "created_date": null,
  "last_reply": "20150203T19:35:05-06:00",
  "posts": [
    {
      "post_id": "1375310",
      "post_title": "T207 anonymous?",
      "post_author_name": "t206 cubs",
      "post_content": "Are anonymous backs more desirable than other backs on T207's?\n\nThanks \nChad",
      "post_time": "20150202T19:33:40-06:00",
      "timestamp": "1422930820"
    },
    {
      "post_id": "1375347",
      "post_title": "",
      "post_author_name": "kmac32",
      "post_content": "Hi Chad,\n\ngood to text with you earlier.  Anonymous backs are more rare than Recruits backs and probably about the same in rareness as Broadleaf but not as rare as Cycle backs.  Value really depends on the card and obviously there are some fairly rare cards in T207.  Hope this helps.\n\nKen",
      "post_time": "20150202T21:00:08-06:00",
      "timestamp": "1422936008"
    },
    {
      "post_id": "1375399",
      "post_title": "",
      "post_author_name": "obcmac",
      "post_content": "I wouldn't say anonymous backs are more desirable, though they are relatively rare.  Cycles are more popular...probably because they look neat.  They are about equal to Anon-3's (within the broadleaf/cycle class), with Anon 25's being much more difficult.  (All based on Tim Newcomb's numbers).  Only the master set guys get excited about the anon backs...though they are often paired with desirable fronts.",
      "post_time": "20150203T06:37:27-06:00",
      "timestamp": "1422970647"
    },
    {
      "post_id": "1375632",
      "post_title": "Anonymous-ness",
      "post_author_name": "frohme",
      "post_content": "Hi Chad,\n\nAgree with the previous posters, and will say there are several levels of distinction.  It mostly depends on the card and the grade, the relative interest in any specific card will vary widely ... this is very much a case of the card specifics.\n\nThat said, a little generalization ... the \"T207 anonymous backs\" have a couple of groups:\n\n[*]Those found on Recruit-class cards.  There are 49 subjects confirmed with that back (I believe) and 50 hypothesized (read Tim's VCBC articles referred to by Mac in the previous post).  These are only found with \"Factory 3, LA\".  There appear to be varying levels of difficulty/scarcity within the group, but the sample sizes are pretty small, so it is somewhat inconclusive. That said, some appear with relative frequency ... \n[*]Those found on Broadleaf-class cards.  These are found on all 50 poses in the Broadleaf class, from both Factory 3 (LA) and Factory 25 (VA).  Not sure if the Lewis variation (no-emblem) has been found with Fac 25 but it definitely has with Factory 3.\n\n\nGeneral observations over the last few years:\n  * Anon 3 Recruits (A3R) are rarely found in grades above SGC 40/PSA 3.\n  * Anon 3 Broadleafs (A3) are infrequently found in grades above PSA 5, but seem to have fared better than their Recruit counterparts\n  * Anon 25 Broadleafs (A25) have survived better, and can be found in very high grade (PSA 8+).\n  * In order of availability (most to least), I'd put them A3, A25, A3R, with the latter two being close together and a gap between them and the A3's\n  * More print color anomalies appear to plague both the A3's and A3R's ... some can be found with what looks like purple printing, and sometimes it is brown, rather than black.  The same does not seem to be true of the A25's, though I'd not be surprised to see them show up.Threads on Net 54 have various discussion on the topic(s).\n  * They're all much less available than the Broadleaf cards, and likely less than the Cycle cards, which seem to carry a premium, likely due to attractiveness, color, etc...\n  * (etc...)\n\n\nAs voiced by others, no one cares much about the subtleties as they're scarce enough to have little interest, beyond those of us that are obsessed, (or have been possessed),  My opinions and terminology may or may not be shared by other T207 collectors - once you get into the weeds, it gets murky...\n\nThat said, its fun to review what's known and hypothesize about various things that may have happened.  There's much less general chatter about T207 than T206, for reasons that are pretty clear, I think.\n\nBest,\nMike",
      "post_time": "20150203T19:35:05-06:00",
      "timestamp": "1423017305"
    }
  ]
}