{
  "id": "292783",
  "forum_id": "13",
  "title": "NO LONGER AVAILABLE: T202 Tannehill & Lord / Joe Jackson SGC 45 - REDUCED",
  "author": "robw1959",
  "reply_count": 1,
  "view_count": 417,
  "created_date": null,
  "last_reply": "20201207T18:51:43-06:00",
  "posts": [
    {
      "post_id": "2041390",
      "post_title": "NO LONGER AVAILABLE: T202 Tannehill & Lord / Joe Jackson SGC 45 - REDUCED",
      "post_author_name": "robw1959",
      "post_content": "NO LONGER AVAILABLE: Pretty nice example - no creases, but there is a light vertical wrinkle that appears to be dead-center. Asking [STRIKE]$1250[/STRIKE] $895 net, PayPal preferred. So sorry about the somewhat hazy scans; the card is much sharper than depicted.\n\nSuccessful transactions with: Sean1125, 39special, Ericc22, asoriano, Econteachert205, oldcardboard, tolstoi, Jobu, simas7173, espomario, jmb, Charlie Faust III, Paul S, quitcrab, avalanche2006, Beatles Guy, Banjo, tjenkins, botn, trdcrdkid, jtschantz, longstreet766, greenmonster66, edjs, jb67, rhotchkiss, Puckettfan, mybuddyinc, frankbmd, Baseball*Collections, btcarfagno, Luke, vintageonlybb, bigfish, t206collector, marvymelvin, benginino9, bigedmachine, Stampsfan, Moonlight Graham, Rebublicaninmass, Gradedcardman, Tigerden, Smanzari, t206kid, clydepepper, Scott L., Brian Van Horn, t206whiteborder, polakoff, GoCubsGo32, Hxcmilkshake, Scott Garner, Goudey77, rdixon1208, Pat R, Bram99, bks14sr, Haybag, charlietheexterminator, fusorcruiser, Mutton Chap Yaz, ncinin, rootsearcher60, GoldenAge50s, thecomebacker, Kryksir, T206.org, seattlebaseball, banksfan14, slantycouch, forceplay sport, niembre, nickers, Kris19, bounce, aloondilana, lrush, fusorcruiser, cardsagain74, aronbenabe, JollyElm",
      "post_time": "20201202T21:17:33-06:00",
      "timestamp": "1606969053"
    },
    {
      "post_id": "2043086",
      "post_title": "",
      "post_author_name": "robw1959",
      "post_content": "Price has been reduced significantly.",
      "post_time": "20201207T18:51:43-06:00",
      "timestamp": "1607392303"
    }
  ]
}