{
  "id": "283909",
  "forum_id": "13",
  "title": "SOLD: Complete 153 card 1910 T218 set -nice mid-grade condition - 2 Jack Johnson, Att",
  "author": "scooter729",
  "reply_count": 2,
  "view_count": 272,
  "created_date": null,
  "last_reply": "20200529T13:35:51-06:00",
  "posts": [
    {
      "post_id": "1985371",
      "post_title": "SOLD: Complete 153 card 1910 T218 set -nice mid-grade condition - 2 Jack Johnson, Att",
      "post_author_name": "scooter729",
      "post_content": "Hi - selling a complete 153 card mid-grade set of the 1910 T218 set. \n\nThis is a fantastic set, highlighted by many legendary boxers, billiards players, golfers and track and field athletes.  This set is fairly consistent in condition, mostly mid-grade VG / VG-EX.  I scanned a bunch of the cards for you to see.  There are just a few with creases, nothing really of note, with the Hoppe Playing card the only real noteworthy card that has a few creases.\n\nSix of the cards in the set were graded, and got between PSA 3-5, which is about where I'd expect many of these to fall.  (Maybe closer to 3 than 5 on most, but probably a fair range.)\n\nThe Jack Johnson cards in this condition typically sell around $100 each - many other cards in this set bring in decent dollars, so I think I've priced it pretty fairly based on the value here.\nSOLD delivered for the set.  This is an average of $XX per card, whic is more than fair for the grade of the overall set.  No real beaters in the group.  PayPal (F/F preferred), Venmo, check, or any other payment method you would like to use, likely will be accepted.\n\nThanks for looking!\nScott",
      "post_time": "20200529T13:29:23-06:00",
      "timestamp": "1590780563"
    },
    {
      "post_id": "1985374",
      "post_title": "",
      "post_author_name": "scooter729",
      "post_content": "Closer look at the two Jack Johnson cards....",
      "post_time": "20200529T13:30:47-06:00",
      "timestamp": "1590780647"
    },
    {
      "post_id": "1985376",
      "post_title": "",
      "post_author_name": "brass_rat",
      "post_content": "I'll take it, email sent",
      "post_time": "20200529T13:35:51-06:00",
      "timestamp": "1590780951"
    }
  ]
}