{
  "id": "98245",
  "forum_id": "13",
  "title": "FINISH SEVERAL SETS",
  "author": "Archive",
  "reply_count": 1,
  "view_count": 400,
  "created_date": null,
  "last_reply": "20080810T10:11:00-06:00",
  "posts": [
    {
      "post_id": "683135",
      "post_title": "FINISH SEVERAL SETS",
      "post_author_name": "Archive",
      "post_content": "Posted By: Jeff Schwarz\nPlease help me finish several sets that my father started as a youth.  I have many items for trade or will buy outright.  VG is fine.  Dad was not very condition conscious.  He is 89 now and would get a kick out of getting anything on our list.  As you know, it is tough finding the last few that you need.  I thought this board could help us out.  Thanks for looking!\n\nB18 - Dee Walsh, Browns, red basepaths\nE98 - Wagner, Cobb, Jennings, Bender, Lajoie, Brown, Collins, Young, Vaughn, Bridwell, Mack, Meyers, Mullin, Dooin, Davis, Chance\nE120 - American Caramel, Series of 80, too many to mention\nPCC765-1-1 Dietsche 1907 Cobb - fielding\nPCC775 Grignon - Chance, Sheckard, Steinfeldt, Taylor\nOrbit Gum Pins (unnumbered) - Cissell, Earnshaw, Stephenson\nR309-2 - Bell, Greenberg, Cleveland Team\nR311-1 Glossy - National League Champions 1935\nR315 - Haas\nR324 - 1941 Goudey - Warstler, Crouch\nR332 Schutter Johnson - Cuyler\nR335 - 1940 Playball - Lazzeri\nW517 - Kelly Brooklyn\nW461 - 1923-24 Exhibits - Bottomley, Burns, Flagstead, Gonzales, Groh, High, Holke, McGraw, Piercy, Pipp, Ruth, Sand, Sewell, Simmons, S. Smith, Veach\nW461 - 1925 Exhibits - Alexander, Benton, Bottomley, Cobb, Decatur, Gehrig, Grimes, Harper, Henline, E. Smith, Terry, F. Williams\nW461 - 1926 Exhibits - too many to mention, but please let me know what you have\nW461 - 1927 Exhibits - Gehrig\nW463-2 - 1931-32 Exhibits (upper left corner) - Comorosky, Flowers, Root, Klein, Lary, Maranville, Richbourg, Roettger, Waner\nW463-3 - 1933 Exhibits (upper left corner) - Berry, Cochrane, Fitzsimmons, Lopez, MacFayden, Richbourg, Stephensen\n1925-31 Exhibits (Set 81-83) - Pipp, Scott, Smith, Wheat and silhouette backgrounds for Faber, Gehrig, Hartnett, Sisler, Speaker, Waner, Wilson \n\n\nThanks again!\n\nedit for items picked up through Board members and at the National.",
      "post_time": "20080716T18:27:00-06:00",
      "timestamp": "1216254420"
    },
    {
      "post_id": "683136",
      "post_title": "FINISH SEVERAL SETS",
      "post_author_name": "Archive",
      "post_content": "Posted By: Jeff Schwarz\nbump and thanks to all that have corresponded thus far.",
      "post_time": "20080810T10:11:00-06:00",
      "timestamp": "1218384660"
    }
  ]
}