{
  "id": "115055",
  "forum_id": "13",
  "title": "America's Toughest Want List Smoking Hot",
  "author": "Yankeefan51",
  "reply_count": 86,
  "view_count": 4900,
  "created_date": null,
  "last_reply": "20090821T21:04:06-06:00",
  "posts": [
    {
      "post_id": "742699",
      "post_title": "America's Toughest Want List Smoking Hot",
      "post_author_name": "Yankeefan51",
      "post_content": "Our most recent post produced four responses and we were able to secure three items for America's Toughest Want List. Each of which has been bought, paid for, and now rests comfortably in one of the world's preeminent baseball type card collections\n\nWhilst our critics swim aimlessly in the sea of mediocrity, we continue to aggressively pursue our quest for superior examples of rare type cards\n\nWe would like to acquire and/or upgrade examples from the following sets\n\nN 162\nLone Jack\nG&B Gum\nDarby Chocolate\nLections\nTexas Tommy (types 1 and 2)\nT 208\nT 216\nOld Mill Cabinet\nE 106\nE 221\nUncle Jacks Gum\n\nWe will pay top prices for the best examples extant\n\nPlease write in strict confidence to\n\nMr Bruce Dorskind\nAmerica's Toughest Want List\n[url]bdorskind@dorskindgroup.co[/url]",
      "post_time": "20090816T06:40:34-06:00",
      "timestamp": "1250426434"
    },
    {
      "post_id": "742707",
      "post_title": "T206",
      "post_author_name": "Marty",
      "post_content": "A card collector has critics?",
      "post_time": "20090816T07:22:25-06:00",
      "timestamp": "1250428945"
    },
    {
      "post_id": "742753",
      "post_title": "Derby Chocolates?",
      "post_author_name": "reisshead",
      "post_content": "Whilst I am familiar with Darby Chocolates, I am not as familiar with Derby Chocolates.  Could the Bruces show us a scan of any Derby, extant or otherwise?",
      "post_time": "20090816T11:26:41-06:00",
      "timestamp": "1250443601"
    },
    {
      "post_id": "742757",
      "post_title": "",
      "post_author_name": "Jim VB",
      "post_content": "[quote name=\"reisshead\" post=742753]Whilst I am familiar with Darby Chocolates, I am not as familiar with Derby Chocolates.  Could the Bruces show us a scan of any Derby, extant or otherwise?[/QUOTE]\n\n\nUltimate, penultimate or antepenultimate?",
      "post_time": "20090816T11:44:18-06:00",
      "timestamp": "1250444658"
    },
    {
      "post_id": "742769",
      "post_title": "",
      "post_author_name": "botn",
      "post_content": "Looks like the board's Magna Cum Laude dropped the 'm' in the .com of his email address.  Last thread he started was \"ultra high\" and this one is \"smoking\"...",
      "post_time": "20090816T12:21:07-06:00",
      "timestamp": "1250446867"
    },
    {
      "post_id": "742792",
      "post_title": "",
      "post_author_name": "Tex",
      "post_content": "[quote name=\"Marty\" post=742707]A card collector has critics?[/QUOTE]\n\nI'm critical of the canned and cocky \"we're awesome and have deep pockets, so sell us your cards\" advertisement.  Does that count?",
      "post_time": "20090816T13:38:42-06:00",
      "timestamp": "1250451522"
    },
    {
      "post_id": "742797",
      "post_title": "Fishing In The Sea of Mediocrity",
      "post_author_name": "Yankeefan51",
      "post_content": "Whilst the sea of mediocrity \nis anything but a sea of tranquility,\nwe are pleased to report that, thus far, we have \nbeen able to acquire four major items for\nour collection (America's Toughest Want List)\n\nSaid items have been bought, paid for and now rest\ncomfortably in one of the world's preeminent type\ncard collections.\n\nAs for the three musketeers, and assorted other critics,\nliars, and would be poets- we hear the sharks are very \nhungry. And when the sharks are full, there is an Ivy-League\ntrained school of piranhas ready to feast on the leftovers.",
      "post_time": "20090816T14:00:40-06:00",
      "timestamp": "1250452840"
    },
    {
      "post_id": "742808",
      "post_title": "",
      "post_author_name": "ibuysportsephemera",
      "post_content": "How about telling us what you bought with pictures, so we can all be impressed?  \n\nJeff",
      "post_time": "20090816T14:22:16-06:00",
      "timestamp": "1250454136"
    },
    {
      "post_id": "742816",
      "post_title": "",
      "post_author_name": "Matt",
      "post_content": "nevermind.",
      "post_time": "20090816T14:44:54-06:00",
      "timestamp": "1250455494"
    },
    {
      "post_id": "742837",
      "post_title": "",
      "post_author_name": "botn",
      "post_content": "[quote name=\"ibuysportsephemera\" post=742808]How about telling us what you bought with pictures, so we can all be impressed?  \n\nJeff[/QUOTE]\n\nHe will do neither--produce a list of what he purchased nor provide an image.  Pretty sure he has not actually bought anything from his list in several years.",
      "post_time": "20090816T17:09:51-06:00",
      "timestamp": "1250464191"
    },
    {
      "post_id": "742847",
      "post_title": "Talk about an Ultra Phoney .....",
      "post_author_name": "Potomac Yank",
      "post_content": "[quote name=\"botn\" post=742837]He will do neither--produce a list of what he purchased nor provide an image.  Pretty sure he has not actually bought anything from his list in several years.[/QUOTE]\n\n*\n\nI agree with every word of the above!\n\nHe's an Ultra Phoney.\n\nEven T206 Wagner reprints, are unaffordable to him, and would be on his list. :D",
      "post_time": "20090816T17:38:32-06:00",
      "timestamp": "1250465912"
    },
    {
      "post_id": "742851",
      "post_title": "",
      "post_author_name": "botn",
      "post_content": "[quote name=\"Yankeefan51\" post=742797] And when the sharks are full, there is an Ivy-League trained school of piranhas ready to feast on the leftovers.[/QUOTE]\n\nMore like a clam.  \n\nYou have really torn it up on ebay in the last 12 months closing out 13 transactions, 14 if you count the 56 Topps Alston PSA 8 you just won.  Of the 13 items purchased one came from a seller who sells nothing but altered cards in holders and one from a guy who sells cards he does not own but middle mans deals.  That purchase could have been had for 25% less had you had you been more astute and resourceful to pick it off directly from the webpage of the true owner.  \n\nYou definitely get the leftovers.  Will not deny you that.",
      "post_time": "20090816T18:04:10-06:00",
      "timestamp": "1250467450"
    },
    {
      "post_id": "742852",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "Bruce,\nI love how you call out \"liberals\" and yet you have contributed thousands of dollars to democrats over the past few years. \n\nMaybe you may want to look in the mirror before you start calling names.\n\nJoshua",
      "post_time": "20090816T18:10:56-06:00",
      "timestamp": "1250467856"
    },
    {
      "post_id": "742853",
      "post_title": "",
      "post_author_name": "carrigansghost",
      "post_content": "Ouch, nice homework.\n\nRawn",
      "post_time": "20090816T18:12:04-06:00",
      "timestamp": "1250467924"
    },
    {
      "post_id": "742859",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "But wait...there is more...I love the internet sometimes...Bruce, answer me this...you were elected to the Board of Directors in 2000 of Symposium Corp. Soon after they changed their name to Cross Media Marketing. I assume that the board stayed the same but cannot confirm that. Soon after that (2002) the company came under fire from the DOJ and FTC. I am not sure if you were named in the Federal suit but I do know that you were named in several suits pertaining to this investigation and defrauding investors. \n\nGuess what one of the chief complaints was?  \n\nTelemarketing scams...sounds sort of familiar every time you post on the board asking for stuff, you are starting to sound like the annoying telemarketer who calls during dinner.\n\nI find it funny that your moral high ground seems like a slippery slope.\n\nJoshua",
      "post_time": "20090816T18:31:22-06:00",
      "timestamp": "1250469082"
    },
    {
      "post_id": "742862",
      "post_title": "",
      "post_author_name": "Exhibitman",
      "post_content": "Whilst I am often selling cards I'd rather throw them away than sell to an arrogant tool.  What's his Ebay handle so I can add Mr. Fraudo to my banned bidders list?",
      "post_time": "20090816T18:50:27-06:00",
      "timestamp": "1250470227"
    },
    {
      "post_id": "742873",
      "post_title": "It is the Bottom of the Ninth for A Pack of Liars",
      "post_author_name": "Yankeefan51",
      "post_content": "To our \"sorted fans\":\n\n1)  We resigned from Symposium's board eight months before the company was\ninvestigated. We resigned because we did not trust the firm's management\n\n2) We gave $2500 to Caroline McCarthy because our biggest client, who had paid us a very substantial amount of money, asked to attend a fund-raiser in his penthouse apartment  All our other political donations were made to the Republican Party.\n\n3) As for Want List acquisitions- Bottom of the Ninth put your money where mouth is.  We'll put $10,000 tonight in escrow and give you the names and invoices from the dealers we obtained the cards.  If we prove correct we get the money, if not you get it. The Bottom of His Ninth's demise would  be cause for a national celebration, indeed.\n\n4) Finally, most of you critics have never seen and will never be able to afford most of the items we have.   So go play with your \"beaters.,\"and call it a day.",
      "post_time": "20090816T19:28:33-06:00",
      "timestamp": "1250472513"
    },
    {
      "post_id": "742874",
      "post_title": "",
      "post_author_name": "PGACPA",
      "post_content": "I agree - we should get back to the cards.\nIn the august words of Rodney King:\n\"Was I speeding officer?\"",
      "post_time": "20090816T19:33:06-06:00",
      "timestamp": "1250472786"
    },
    {
      "post_id": "742876",
      "post_title": "",
      "post_author_name": "carrigansghost",
      "post_content": "I never attended college, but I can spot the incorrect grammar in line one.\nBruce, you shared a great image of one of your cards with me, feed the masses and throw them a bone.\n\nRawn",
      "post_time": "20090816T19:39:25-06:00",
      "timestamp": "1250473165"
    },
    {
      "post_id": "742880",
      "post_title": "Bottom of the Ninth",
      "post_author_name": "Yankeefan51",
      "post_content": "The California wild fires must be getting close because there must be smoke  in your eyes- i.e. your facts on our 2009 E-Bay purchases are dead wrong.",
      "post_time": "20090816T20:19:06-06:00",
      "timestamp": "1250475546"
    },
    {
      "post_id": "742890",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "Looks like I had all my facts straight. \n1. I did state that I was unsure of whether you remained on the board.\n2. You were named in several lawsuits concerning that corp. Public record.\n3. You did give $2000 to a Democrat. In all fairness, I will then let the public know that the only other public donation that you gave to a politician was a $250. \n4. I have no doubt you have a superior collection. I have always said so. I am a beater collector but have held just as many high end cards as you probably have over the years. Including many of the ones that reside in your current collection. \n5. I have no idea what your talking about with ebay.\n6. I find it disgusting that you would joke about the wildfires. This is causing more problems for people, the environment, and CA's economy at a time when people are still trying to come together.\n\nJoshua\n\nPS Please do not PM me again.",
      "post_time": "20090816T21:09:02-06:00",
      "timestamp": "1250478542"
    },
    {
      "post_id": "742892",
      "post_title": "",
      "post_author_name": "Tex",
      "post_content": "[quote name=\"Yankeefan51\" post=742873]\n4) Finally, most of you critics have never seen and will never be able to afford most of the items we have.   So go play with your \"beaters.,\"and call it a day.[/QUOTE]\n\nMost of us here don't collect for bragging rights either.",
      "post_time": "20090816T21:10:07-06:00",
      "timestamp": "1250478607"
    },
    {
      "post_id": "742896",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "How about more from Bruce....\n\nIn the past Bruce has sent me scathing emails about my profession. I am an elementary school teacher. Mostly saying that I was too stupid to do any \"real work\" and calling me and my profession some very unflattering names. (Several board members have seen these emails and were appalled).\n\nBruce...another question...Is Glenn Dorskind of NY your brother? I see you and him are friends on facebook (I am not a friend of Bruce's for the record) and I see that you have a few other connections (Google is wonderful). It turns out that Glenn is a teacher. Should I forward your emails to him? I wonder what he would think. Maybe he already knows and accepts your views. \n\nJoshua\n\nPS Just did a bit of digging...Glenn really is Bruce's brother. I am now completely shocked that he would call me out for teaching.",
      "post_time": "20090816T21:22:28-06:00",
      "timestamp": "1250479348"
    },
    {
      "post_id": "742898",
      "post_title": "",
      "post_author_name": "Jim VB",
      "post_content": "[quote name=\"Yankeefan51\" post=742873]To our \"sorted fans\":[/QUOTE]\n\n\nBruce, \n\nWhat does your high level, Ivy League trained, macro mind, use as the definition of \"sorted\"? \n\nWould it be possible that a high brow such as yourself would not know that the word you were looking for is \"sordid.\"\n\nWhat a moron you are. My 15 year old daughter has a more extensive vocabulary than you do, and she uses it and spells it correctly.\n\nPlease stop trying to act smarter than you are. It's visible to all.",
      "post_time": "20090816T21:24:53-06:00",
      "timestamp": "1250479493"
    },
    {
      "post_id": "742902",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "Bruce, where did you get your money from? \n\nWas it Albert Dorskind? (grandfather maybe? Uncle?)...a (sshhh) Hollywood liberal insider. He was an interesting man who created much of Hollywood as we know it today. Oh, lived in California and spent much of his time trying to make this state better. The one you just trashed and made fun of. \n\nToo bad his relative has none of his qualities.\n\nJoshua",
      "post_time": "20090816T21:37:50-06:00",
      "timestamp": "1250480270"
    },
    {
      "post_id": "742904",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "I am wondering if you understand now that just because you have money, an ivy league education, and a nice baseball card collection does not make you better than us. It does not give you the right to call us  (or what we value) mediocre. It does not give you the right to trample our views or call us names. All it gives you is a sense of entitlement that you seem to have wasted. Maybe you should sell off some of your collection and use the money to help your fellow man. Make some friends instead of insulting your peers (yes, peers, you may not think so but we are), and finding some love in this world. I will stop posting for now but will come back with a vengeance if you insist on being an ass.\n\nBy the way, like I have said in the past, I have no problems with your collection or trying to find pieces for it but I would suggest that you limit your posts to just your wantlist. I have a feeling you would still get the cards you want and probably at better prices.\n\nPlease, take my advice.\n\nJoshua",
      "post_time": "20090816T21:44:08-06:00",
      "timestamp": "1250480648"
    },
    {
      "post_id": "742918",
      "post_title": "?",
      "post_author_name": "Reginald Marsh",
      "post_content": "Ummmmmmm....Joshua this is America and the last time i checked freedom of speech is still in the constitution so Bruce has a right to speak his mind.",
      "post_time": "20090817T00:27:25-06:00",
      "timestamp": "1250490445"
    },
    {
      "post_id": "742919",
      "post_title": "Joshua, you're waisting your time .....",
      "post_author_name": "Potomac Yank",
      "post_content": "Master Bruce Dorkskin is a Dunderhead, with grand illusions of grandeur. :D\n\nIt is obviouse that he's a lonely guy, a state of his own creation. :)\n\nIn order not to be totally lonely, he tries to create the \"We Illusion.\"\n\nIf he didn't stimulate dissension on the board, he wouldn't be getting any attention from anyone. :)\n\nHe sent me an I M, that I have not read, nor do I have any intention of reading.   ...  Why should I, if I'm to do battle  _ _ _  BRING ME GIANTS ...  not an unranked amateur.  \n\nIt's sad, that this is the only attention that Master Bruce gets.",
      "post_time": "20090817T00:35:05-06:00",
      "timestamp": "1250490905"
    },
    {
      "post_id": "742920",
      "post_title": "",
      "post_author_name": "botn",
      "post_content": "[quote name=\"Yankeefan51\" post=742880]The California wild fires must be getting close because there must be smoke  in your eyes- i.e. your facts on our 2009 E-Bay purchases are dead wrong.[/QUOTE]\n\nDid you have anything to do with those wildfires in CA?  Last time you emailed me you stated you were going to burn down my house and office so I can watch my family die.   \n\nI am quite confident my analysis of your ebay activity is 100% accurate.  Along with all of the other lies you tell are you going to now deny your ebay id is aliandmatt?",
      "post_time": "20090817T00:48:58-06:00",
      "timestamp": "1250491738"
    },
    {
      "post_id": "742924",
      "post_title": "",
      "post_author_name": "jlynch1960",
      "post_content": "Country kid goes off to Harvard on a scholarship.  First day he asks an upper classman \"where's the library at?\"  He is ignored.  He poses the same question to several others with similar results.  Finally, he says to another fellow, \"I keep asking where the library's at, but no one will tell me.\"  He is told that Harvard men don't answer questions that end in prepositions.  Kid replies - \"so OK, where's the library at, asshole?\"",
      "post_time": "20090817T05:06:58-06:00",
      "timestamp": "1250507218"
    },
    {
      "post_id": "742936",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "Reginald,\n\nJust for the record, Freedom of Speech is not a right in the Constitution. All the Constitution says about freedom of speech is that Congress will pass no laws that prohibit free speech. The Supreme Court has ruled that this will apply to the Executive and Judicial branch of government as well. \n\nIn the case of Bruce, I do not feel he has a right to call names, threaten, intimidate, or annoy other people. If you feel that he has that right then I suggest that Bruce PM you when he needs to spout off.\n\nJoshua\n\nPS Can you tell I am a teacher :)",
      "post_time": "20090817T07:25:18-06:00",
      "timestamp": "1250515518"
    },
    {
      "post_id": "742942",
      "post_title": "",
      "post_author_name": "daviddbreadman",
      "post_content": "Bruce, is a douche.   Whilst, an ugly one at that.   Love your boundless and defective use of, commas, bruce.  Whilst, anyone else on this board from here on in would consider selling a card, to this jackass is, beyond me.",
      "post_time": "20090817T07:41:13-06:00",
      "timestamp": "1250516473"
    },
    {
      "post_id": "742960",
      "post_title": "Bread Man",
      "post_author_name": "Yankeefan51",
      "post_content": "Whilst we have never met, it is clear that you butter your bread with salmonella.\n\nAs far as selling cards to us, many of those who claim they never would, often do.\n\nGo stick that in your managed brokerage account and chew on it.",
      "post_time": "20090817T08:54:47-06:00",
      "timestamp": "1250520887"
    },
    {
      "post_id": "742967",
      "post_title": "",
      "post_author_name": "barrysloate",
      "post_content": "Come on everyone, a little decorum please.",
      "post_time": "20090817T09:11:13-06:00",
      "timestamp": "1250521873"
    },
    {
      "post_id": "742970",
      "post_title": "Master Bruce is sooo lonely .....",
      "post_author_name": "Potomac Yank",
      "post_content": "Sooo lonely that his imaginary friends refuse to answer him back ..... \n\nThus  _ _ _  he's here with us.\n\nThe :confused: We World is not easy.  \n\nPoor poor Master Bruce.",
      "post_time": "20090817T09:19:45-06:00",
      "timestamp": "1250522385"
    },
    {
      "post_id": "742971",
      "post_title": "The name of the show is called .....",
      "post_author_name": "Potomac Yank",
      "post_content": "\"You Asked for It.\"",
      "post_time": "20090817T09:26:50-06:00",
      "timestamp": "1250522810"
    },
    {
      "post_id": "742973",
      "post_title": "Potomac Yank",
      "post_author_name": "Yankeefan51",
      "post_content": "Hey Potomac Yank\n\nGo play your beaters   Do they have newspapers down in Hillbilly Country, or do you all just spit at one another?\n\nA rhetorical question, indeed.  We hear that when you play with your beaters long enough they shoot tobacco juice.",
      "post_time": "20090817T09:38:09-06:00",
      "timestamp": "1250523489"
    },
    {
      "post_id": "742983",
      "post_title": "",
      "post_author_name": "botn",
      "post_content": "[quote name=\"Yankeefan51\" post=742973]Hey Potomac Yank\n\nGo play your beaters   Do they have newspapers down in Hillbilly Country, or do you all just spit at one another?\n\nA rhetorical question, indeed.  We hear that when you play with your beaters long enough they shoot tobacco juice.[/QUOTE]\n\nYour south Bronx side is showing, still.  Hopefully O'Keefe won't humiliate you again in front of your Facebook friends.",
      "post_time": "20090817T10:18:28-06:00",
      "timestamp": "1250525908"
    },
    {
      "post_id": "742988",
      "post_title": "",
      "post_author_name": "Tex",
      "post_content": "[quote name=\"Reginald Marsh\" post=742918]Ummmmmmm....Joshua this is America and the last time i checked freedom of speech is still in the constitution so Bruce has a right to speak his mind.[/QUOTE]\n\nNot that anyone is trying to lay down the law or anything, but since you brought it up:  This is a privately moderated forum so I'm pretty sure we'll all welcome to tell this guy to STFU, and god bless America.\n\n:)",
      "post_time": "20090817T11:15:30-06:00",
      "timestamp": "1250529330"
    },
    {
      "post_id": "742989",
      "post_title": "Bottom of the Barrel",
      "post_author_name": "Yankeefan51",
      "post_content": "Hey Bottom of the 9th \n\n\nKeep on trying...keep on lying.\nWe were born at a prestigious Manhattan Upper East side hospital, and grew up in one of the country's wealthiest suburbs.\n   \nWhat happened to your offer to challenge us with regard to our recent purchases?\n\nIf you don't choke on the smoke from the wildfires, maybe you will explode from all the hot air that you blow.",
      "post_time": "20090817T11:15:34-06:00",
      "timestamp": "1250529334"
    },
    {
      "post_id": "742995",
      "post_title": "",
      "post_author_name": "barrysloate",
      "post_content": "Anyone think it's time to lock it?",
      "post_time": "20090817T11:33:52-06:00",
      "timestamp": "1250530432"
    },
    {
      "post_id": "742997",
      "post_title": "Hilarious.....",
      "post_author_name": "Reginald Marsh",
      "post_content": "I think it is hilarious how everyone gets so revved up at Bruce. The reality of the situation is that if you do not want to sell the guy any cards why read any of his posts? If you do not plan on doing business with him why read his threads? \n\nRealy Joshua i think you missed your calling. Instead of being a teacher you should have gone into the private investigator line of work or better yet work for one of the sleezy tabloids because you are digging up some pretty good dirt.\n\nTex you are 100% right in that you and the others can tell Bruce whatever you want but then do not get pissed when he fires back, one thing i like about Bruce is he does not hold back and political correctness is thrown right out, i actually LMAO when i read his responses.",
      "post_time": "20090817T11:37:56-06:00",
      "timestamp": "1250530676"
    },
    {
      "post_id": "742998",
      "post_title": "",
      "post_author_name": "Adam",
      "post_content": "Come on everyone -- can we please buy, sell, or trade tobacco cards on this part of the board?  Is that unreasonable?\n\nBruce made a post seeking to buy certain cards, which is a logical thing to do here since he is seeking to buy certain tobacco cards.  If anyone has any of those cards to sell him, then they should email Bruce to see if they can reach a deal.   \n\nIt's absurd how many bumps this B/S/T thread has received.  Why don't we get back to B/S/T stuff here.",
      "post_time": "20090817T11:41:05-06:00",
      "timestamp": "1250530865"
    },
    {
      "post_id": "743013",
      "post_title": "Time to Say Goodbye",
      "post_author_name": "Yankeefan51",
      "post_content": "We would like to thank the gang of eight- their attacks led to hundreds of page views and while you were busy attacking, we have been contacted privately by three more sellers.\n\nSo to the special group of idiots who have devoted so much time and energy to attacking us, your efforts did just what he hoped- generate private leads. And just think they did not cost us a dime.  Guess we learned a few pointers at Wharton that they never taught you folks in trade school.\n\nBye for now.\n\nSee you again soon....",
      "post_time": "20090817T12:16:49-06:00",
      "timestamp": "1250533009"
    },
    {
      "post_id": "743015",
      "post_title": "",
      "post_author_name": "Tex",
      "post_content": "[quote name=\"Reginald Marsh\" post=742997]Tex you are 100% right in that you and the others can tell Bruce whatever you want but then do not get pissed when he fires back, one thing i like about Bruce is he does not hold back and political correctness is thrown right out, i actually LMAO when i read his responses.[/QUOTE]\n\nOh I'm not pissed, I'm as amused as you are at his ridiculous responses.  \n\nI did find his original post very disrespectful and I'm not quite sure why it's OK for him to solicit B/S/T with that kind of tone, and I find it backwards that it's the disrespected who are being told to \"cool it.\"  \n\nBut whatever, these aren't my boards that he's tainting, so it's no rain on my day.",
      "post_time": "20090817T12:28:31-06:00",
      "timestamp": "1250533711"
    },
    {
      "post_id": "743016",
      "post_title": "I agree with Barry & Adam",
      "post_author_name": "T2069bk",
      "post_content": "[quote name=\"barrysloate\" post=742995]Anyone think it's time to lock it?[/QUOTE]\n\nNothing against the \"Bruces\" or the \"Gang of eight\" but I have noticed that Bruce has his request out there in other categories, so why not give the sellers in the Tobacco section a break and pick this up on one of the other postings .....or better yet hash it out in the Chat Room or on the Main Board?\n\nThis is almost as bad as when eBay runs specials for sellers and amazingly 3800 Buy-it-Nows appear in a section over night!!!!",
      "post_time": "20090817T12:28:44-06:00",
      "timestamp": "1250533724"
    },
    {
      "post_id": "743017",
      "post_title": "",
      "post_author_name": "Rob D.",
      "post_content": "[quote name=\"Yankeefan51\" post=742989]We were born at a prestigious Manhattan Upper East side hospital ...[/QUOTE]\n\nAre you sure it wasn't a manger in Bethlehem?",
      "post_time": "20090817T12:29:57-06:00",
      "timestamp": "1250533797"
    },
    {
      "post_id": "743029",
      "post_title": "To the 24/7 TV watchers on board .....",
      "post_author_name": "Potomac Yank",
      "post_content": "Long before Seinfeld.\n\nLong before SNL.\n\nDuring a period when 24/7 TV watching wasn't around.\nThere was a program that started in 1950 called \"You Asked for It.\"\nThe title says it all.\nExcept for the delicate, and truly slow, no explanation needed.\n\nThe poster that really borders on the super natural, is the Puritan that keeps reading the thread, although he's not happy with it.\nThe solution for this poster is really simple ... Stop reading it!\n\nHis solution is the Old Prussian Solution ...  Lock it up, censorship, burn the books.\n\nMaster Bruce has lamely attempted to put down some of the members of this community, and some of them have slammed back.\n\nWere they suppose to turn the other cheek???  _ _ _  Hell No!\n\nIf I did it, and I have  _ _ _  I expect to be slammed back, but then again, I have thick skin.\n\nNo sir:\nThis is not Seinfeld, nor SNL.\nIt's ___ \"You Asked for It!\"",
      "post_time": "20090817T13:24:38-06:00",
      "timestamp": "1250537078"
    },
    {
      "post_id": "743034",
      "post_title": "",
      "post_author_name": "Potomac Yank",
      "post_content": "[quote name=\"Rob D.\" post=743017]Are you sure it wasn't a manger in Bethlehem?[/QUOTE]\n\n*\n\nRob, he probably couldn't give you the name of that prestigious Manhattan Upper East side hospital. :)",
      "post_time": "20090817T13:42:22-06:00",
      "timestamp": "1250538142"
    },
    {
      "post_id": "743292",
      "post_title": "See what I mean Rob _ he doesn't know the name",
      "post_author_name": "Potomac Yank",
      "post_content": "Master Bruce never made it to the hospital.  :D",
      "post_time": "20090818T17:52:16-06:00",
      "timestamp": "1250639536"
    }
  ]
}