{
  "id": "194718",
  "forum_id": "13",
  "title": "1910 S74 Baseball Tobacco Silks Collection of 66  / $1,750",
  "author": "Qcards",
  "reply_count": 0,
  "view_count": 195,
  "created_date": null,
  "last_reply": "20140929T08:21:08-06:00",
  "posts": [
    {
      "post_id": "1328091",
      "post_title": "1910 S74 Baseball Tobacco Silks Collection of 66  / $1,750",
      "post_author_name": "Qcards",
      "post_content": "1910 S74 Baseball Tobacco Silks Collection of 66  / $1,750 \n\n \n\nIn the teens, tobacco companies issued quite a few sets printed on silks or felts, featuring a variety of subjects. These \"fabric cards\" were intended to be used as the building blocks for quilts, pillow cases, blankets, tapestries, etc. The silks featuring baseball players are by far the most highly prized by collectors today. This large tapestry, which measures an impressive  20 inches wide, 16 inches top to bottom , was created using the S74 Baseball Silks issued in 1911. S74 silks are related to the T205 Gold Border series, and share the same basic player designs. Individually they are very attractive collectibles.  Sixty six  of them sewn together create a stunning display. The silks have been meticulously sewn together, creating a unique work of folk art. There are loads of Hall of Famers among the 66 silks, including Ty Cobb, Cy Young and  Christy Mathewson. The tapestry is in Excellent condition overall. This is a very attractive display of these colorful tobacco premiums, which by any measure represent one of the very best values of all 1910-era baseball tobacco issues. \n\n\n\nPlease note; I am primarily a hockey guy  and because some of these names are in script, I tried to get the names as close as possible so there may be some errors. \n\n \n\n \n\nCubs; Archer, Brown, Chance, Evers, Hofer, Needham, Reulback, Steinfeld, Tinker, Oveneal\n\n \n\nWhite Sox; Duffy, Parent, Payne, McConnell, Tannehill, White, \n\n \n\nBrooklyn Nationals; Bell, \n\n \n\nPirates; Byrne, Leifield, Philippe, Leach, Wilson, Carmitz, Gibson, Clark, Byrne\n\n \n\nGiants; Ames, Becker, Budwell, Doyle, Derker, Derdin, Fletcher, Marquard, McGraw, Mathewson, Raymond, Schlei, Meyers, Murray\n\n \n\nSenators; Johnson, Elberfeld, Street, \n\n \n\nPhillies; Lobert, Dovey, Bates, \n\n \n\nCardinals; Bresnahan, Evans, Howser\n\n \n\nCleveland; Young, Turner, \n\n \n\nReds; Fromme, Flesher, Mitchell\n\n \n\nPhiladelphia Athletics; Baker, Murphy, \n\n \n\nYankees; Knight, Hemphill, Chase, \n\n \n\nBrowns; Wallace\n\n \n\nTigers; Willett, Summers, Cobb, Delahanty\n\n \n\nBoston Nationals; Mattem, Graham",
      "post_time": "20140929T08:21:08-06:00",
      "timestamp": "1412000468"
    }
  ]
}