{
  "id": "155316",
  "forum_id": "13",
  "title": "FS: T206 Gilbert Missing Red Ink",
  "author": "t206hound",
  "reply_count": 9,
  "view_count": 843,
  "created_date": null,
  "last_reply": "20120820T15:05:08-06:00",
  "posts": [
    {
      "post_id": "1026054",
      "post_title": "FS: T206 Gilbert Missing Red Ink",
      "post_author_name": "t206hound",
      "post_content": "I've tried three times to have this graded at SGC.  Each time I was told that it would be slabbed, and each time the slabbing was canceled by the senior grader.  \n\nI have no doubts that this card is missing red ink.  There were separate pink/buff color passes from the red.  Below see the distinction between my SGC 40 with red ink vs. the same image of the card missing red ink.  Notice on the with red ink card that there is a layer of pink/buff under the red which shows since the red is skewed left.  Notice that the belt has no pink/buff on either card.\n\nAsking $500, will consider other offers.  Feel free to ask any questions... refer to scans below:\n\n[IMG]http://www.collectorfocus.com/images/show/t206hound/raw/6103/gilbert-no-red-ink[/IMG]\n[IMG]http://www.collectorfocus.com/images/show/t206hound/raw/5974/gilbert-with-red-ink[/IMG][IMG]http://www.collectorfocus.com/images/show/t206hound/raw/5975/gilbert-missing-red-ink[/IMG]",
      "post_time": "20120814T20:01:19-06:00",
      "timestamp": "1344996079"
    },
    {
      "post_id": "1026242",
      "post_title": "",
      "post_author_name": "dog*dirt",
      "post_content": "Erick,\n\nNice card.",
      "post_time": "20120815T12:43:17-06:00",
      "timestamp": "1345056197"
    },
    {
      "post_id": "1026261",
      "post_title": "Slabbing canceled?",
      "post_author_name": "sando69",
      "post_content": "hey erick-\nthat is a great looking card!\nam a little confused about why the slabbing/authenticating process was canceled...\ndid sgc (or it's graders) provide any reason for the change of heart?\nmark",
      "post_time": "20120815T13:14:05-06:00",
      "timestamp": "1345058045"
    },
    {
      "post_id": "1026285",
      "post_title": "No official reason given",
      "post_author_name": "t206hound",
      "post_content": "I've never been given the opportunity to speak to the senior grader.  In my opinion, I don't think SGC recognizes that there was a pink color pass separate (and prior to) the red color pass.  I believe that they are concerned that the pink that displays is faded red.  I even gave them my SGC 40 as an exemplar to compare with that red color shift and they still said no.  I'd really like the time to be able to definitively research which colors were used in which order.  I've seen several cards with color shifts that reveal the \"mixing\" of colors.  \n\nIn the following thread, Jamie has a card that appear to only have yellow, brown and (in my opinion) buff.  Look closely and there is a right shift of the buff revealing a separate yellow pass, but an orange background.  Krueger looks ghostly from the missing pink and obviously the missing red background.  Chris also has a lithographic print in the thread that shows separate red, buff and pink.  Essentially, just because the color looks red doesn't mean that it wasn't mixed/layered with other colors.\n[url]http://www.net54baseball.com/showthread.php?t=154424&highlight=pink+buff[/url]\n\nBelow is a scan from a card IrishDenny had on eBay (hope that he doesn't mind that I stole the scan).  It shows a fairly dramatic vertical pink shift.  In my opinion, orange is a mix of pink and yellow.  The Stephens does have red on the cap, mitt and undershirt.  Notice that the red on the cap is in no way shifted, and thus I conclude a separate color pass from pink.  I also think it demonstrates that pink was one of the last colors, with red being the final color.\n\nAgain, all my opinion, and I understand that they have to stand behind every card they slab.  At the moment, they aren't comfortable doing it.",
      "post_time": "20120815T13:52:01-06:00",
      "timestamp": "1345060321"
    },
    {
      "post_id": "1026318",
      "post_title": "",
      "post_author_name": "Runscott",
      "post_content": "Erick,  that's great diligence on your part.  Very impressive how many of you are giving this stuff this kind of attention.\n\nEdited to add:  what's really silly about SGC's take on this, is that the 'buff' you describe is also used here as skin color - which makes complete sense (plus a layer under the red), while red is used to hilight the skin features, as well as to color uniform areas.  Seems simple enough.  Are they saying (without saying) that if buff wasn't used beneath the red in the uniform, that they would slab it?  Then you would have a player with a white face and red cheeks - kind of a creepy look.\n\nI love the card, just don't have the cash at the moment to spend on my personal collection :(",
      "post_time": "20120815T14:58:08-06:00",
      "timestamp": "1345064288"
    },
    {
      "post_id": "1026333",
      "post_title": "",
      "post_author_name": "MVSNYC",
      "post_content": "PM sent.",
      "post_time": "20120815T15:28:45-06:00",
      "timestamp": "1345066125"
    },
    {
      "post_id": "1026382",
      "post_title": "",
      "post_author_name": "Blunder19",
      "post_content": "Hi Erick,\n\nYour explination on why the card will not be slabbed is spot on.. I went to SGC in person last week with my raw scraps.. after alittle while the head grader  came out and spoke with me. Right now they are only slabbing very obvious freaks with the 3rd line notation of the error on the flip... ghosts.. multi prints... and yellow brown scraps are all ones that will make the slab with the error notation.\n\nIf your card has more than just the yellow and brown ink run..... but missing 1 or more of the other colors... that is where it is done on a case by case basis.. at this point SGC isnt willing to take the risk on these missing 1 or 2 color cards. Even though they are very obvious in some cases. I think it also has to do with how new the error market is.. the demand for t206 errors has skyrocketed...SGC slabbing missing color T206s is still in its infancy. Erick is right... SGC does not recognize the difference between the Red and Pink pass... hopefully through more education they will start to recognize more scraps..\n\nSee below image of one of my scraps they would not slab.. missing color.. ink shift... clear as day... but in SGC's eyes it is not obvious..  you be the judge.. see the normal card with the pink layer.. this normal pic is a great example because the pink is not lined up exact(it over lays by itself on the top of the card).. so you can see it was its own color... whereas the scrap I have clearly does not have that..The pink layer was used ontop of the yellow to create the orange.... in addition my card has the ink shift, hand cut etc. all the right signs for scrap. This card was never in a pack.\nmy scrap:\n[IMG]http://i251.photobucket.com/albums/gg309/blunder19/Hempstead-20120111-00227.jpg[/IMG]\nthe normal card (pink by itself on top):\n[IMG]http://i251.photobucket.com/albums/gg309/blunder19/mory.jpg[/IMG]\n\nUntil SGC recognizes Pink as its own color.. they wont recognize any card missing it.... still cool cards slabbed or not..",
      "post_time": "20120815T17:00:20-06:00",
      "timestamp": "1345071620"
    },
    {
      "post_id": "1026386",
      "post_title": "",
      "post_author_name": "irishdenny",
      "post_content": "Erick,\n\nNot to worry my friend... I'm sorry that I didn't realize sooner that this card would of aided you in your research.\n\nI would like to say that I've been Looking, Listening, Reading, Noting, & Discussing Scrap & Misfits centered around white boarder cards for sum 12 years now. I am very happy to of owned quite a few of them... and even happy to of passed them on to you, my prestigious colleagues in the dead ball era.\n\nWith all that said, imho, I believe that Erick is \"Right on!\" For SGC even to believe that there isn't Color missing, is beyond the scope of reasoning.\n\nThis is a Very Handsome Piece Erick... I'm sure it will find a NeW Home here shortly!",
      "post_time": "20120815T17:16:16-06:00",
      "timestamp": "1345072576"
    },
    {
      "post_id": "1026393",
      "post_title": "",
      "post_author_name": "t206hound",
      "post_content": "I'm probably not looking to trade unless I use this card as part of a trade for a T206 Cobb (any).",
      "post_time": "20120815T17:24:08-06:00",
      "timestamp": "1345073048"
    },
    {
      "post_id": "1028162",
      "post_title": "One more week...",
      "post_author_name": "t206hound",
      "post_content": "I'll leave the Gilbert out there for another week, and then he's going back in the vault.  LMK if you have any interest...",
      "post_time": "20120820T15:05:08-06:00",
      "timestamp": "1345496708"
    }
  ]
}