{
  "id": "126148",
  "forum_id": "13",
  "title": "T205 Set and More at My National Booth",
  "author": "Steve_NY",
  "reply_count": 5,
  "view_count": 880,
  "created_date": null,
  "last_reply": "20100731T22:46:48-06:00",
  "posts": [
    {
      "post_id": "826004",
      "post_title": "T205 Set and More at My National Booth",
      "post_author_name": "Steve_NY",
      "post_content": "If you jump to the Non Sports listing, you will find a listing of my new non sports acquisitions during 2010 which I will have at Booth 125P at the Baltimore National next week. Some of my new sports items include:\n\n1- T205 set -- it's a great looking set that you can buy ungraded from me for grading. Check it out -- you will be surprised. \n\n2- Best condition graded Toleteros -- Easter, Wilson, Perez, Collins, Fields, Easterling and more\n\n3- Gorgeous graded Venezuelan Spahn. Many (Over 100) more Cuban rare older cards.\n\n4- Japanese Kabaya Leaf graded and ungraded. Many other earleir Japanese cards.\n\n5- Johnston Cookies unopened.\n\n6- 50+ Unopened 1964 Standups packs -- stars showing Mantle, Clemente, Aaaron; Semistars - Boyer, Cepeda, Groat, etc.; Most single prints\n\n7- Uncut 1941 Play Ball sheet 8 cards -- 6 are high numbers; 2 of those are stars -- Chuck Klein -- stunning condition.\n\n8- Just picked up 1948-49 Leaf cards\n\n9- Check out my T205's (over 200), T 206's (over 500), T210's (over 50, many Old Mill Series 8's), and many other early tobacco cards. I also now have 3 stunning Sawyer Biscuit cards. \n\n10- Almost Forgot -- 1955 and 1960 Amour Coins -- many rare colors -- including light orange/peach Snider, lime green Snider, Yellow Snider, Black Snider, and more.\n\nRARE Daley 1960 coin in a 1 of 1 color -- PSA graded -- come see it on display -- but it is for sale.\n\nJust too much to remember--\n\nSteve Sabow\n914-522-3853 cell\nBooth 125 P \n[url]Dynamictwo@aol.com[/url]\n\nBaltimore National",
      "post_time": "20100729T22:55:00-06:00",
      "timestamp": "1280465700"
    },
    {
      "post_id": "826019",
      "post_title": "",
      "post_author_name": "barrysloate",
      "post_content": "deleted as it has been moved to the proper section. Thank you",
      "post_time": "20100730T04:27:13-06:00",
      "timestamp": "1280485633"
    },
    {
      "post_id": "826042",
      "post_title": "",
      "post_author_name": "Pup6913",
      "post_content": "pm sent",
      "post_time": "20100730T07:17:19-06:00",
      "timestamp": "1280495839"
    },
    {
      "post_id": "826141",
      "post_title": "",
      "post_author_name": "Matt E.",
      "post_content": "Steve,\n\nNice talking with you on the phone.\n\nLooking forward to your email.\n\n\nMatt",
      "post_time": "20100730T11:51:33-06:00",
      "timestamp": "1280512293"
    },
    {
      "post_id": "826247",
      "post_title": "",
      "post_author_name": "Steve_NY",
      "post_content": "I posted the following at the Non sport site but it mostly relates to my baseball tobacco cards. Thanks and if you are as honest as I am then this should not offend you in any way. If not, such is life!\n\nI would love to hear from some tobacco card dealers about their experiences as well.\n\nSteve\n\n***************\n\nNational Dealers: How do you protect against Theft?\nJuly 30 2010 at 9:20 PM\nNo score for this post Steve Sabow   (Login Steve_NY) \n\n--------------------------------------------------------------------------------\n \nI've done 27 of the National shows and have noticed a large jump in people stealing things in the past few years as the economy went sour. Last year, I also only accepted checks from people who left the merchandise with me for future delivery--they paid the shipping and insurance. This years it's cash - or -checks with merchandise held -- no exceptions. Truthfully, most customers are fine with that. \n\nThis year, I have talked with my partner Mitch and we are also instituting a new policy: We will only help one customer each at a time. If we have merchandise from the showcase out for one customer, we will not help another customer until the finish of the current transaction. We will also not be handing large stacks of cards to anyone throughout the show. We will be limiting the number of cards that we remove from our showcases to 20 cards each in a stack that we provide to customers to review. We will be making sure that we get all 20 cards back. \n\nMy big beef is not with the non sports dealers or customers, my main beef is with some of the sports card dealers themselves (and some of their customers). In particular, the Tobacco card entusiasts. Without going into too much detail, they are very good at palming cards that they move to the top or bottom of the stack. I also know who they are -- so I'll be on alert for them. But there are many more from where they come from. \n\nAnyone have any better ideas? How do you protect against theft from your booth at a large show such as the National? \n\nSteve",
      "post_time": "20100730T19:37:10-06:00",
      "timestamp": "1280540230"
    },
    {
      "post_id": "826491",
      "post_title": "",
      "post_author_name": "Steve_NY",
      "post_content": "I've added the following today to bring with me to the National:\n\nTOBACCO CARDS:\n1- T201s, T202s, T200s, and T222's (7-10) including a clean \nVERY RARE Lelivelt (#25)\n\n2- B-18 Blankets Pillow case with Huggins Yellow Pennants (9 players sewed in)\n\n***************\nNon - Tobacco:\n\n3- Wheaties 100 years of Baseball set (with Casey at the Bat)\n\n4- 1930s Matchbooks (Hockey -- unused)\n\n5- Watches -- Ruth; Mantle, Maris 1961; Mantle Maris with Koufax 1962; Footbal 1962; Football 1963\n\n6- Many more nonsports items too.\n\nSteve Sabow\nNational Booth 125P\n914-522-3853 Cell",
      "post_time": "20100731T22:46:48-06:00",
      "timestamp": "1280638008"
    }
  ]
}