{
  "id": "172987",
  "forum_id": "13",
  "title": "FS: T210 Series 3 Old Mill Backs",
  "author": "wcsportscards",
  "reply_count": 1,
  "view_count": 389,
  "created_date": null,
  "last_reply": "20130801T23:58:13-06:00",
  "posts": [
    {
      "post_id": "1162906",
      "post_title": "FS: T210 Series 3 Old Mill Backs",
      "post_author_name": "wcsportscards",
      "post_content": "Have the following T210 Series 3 Old Mill backs available for sale. All prices include bubble mailer delivery with tracking. Please PM to reserve\nThanks\n\n[IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/001-7_zps99991862.jpg[/IMG] [IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/002-6_zps99b2695c.jpg[/IMG] [IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/001_zpsd84ea665.jpg[/IMG]\nT210-3 Hirsch - This card has tremendous eye appeal, but was rejected for grading by PSA for not meeting the minimum size requirement $42 \n\n[IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/004-8_zps9dbfdfb0.jpg[/IMG] [IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/005-4_zps1771e97f.jpg[/IMG]\nT210-3 Blue - Great eye appeal; corner wear with a clean back. 1 other PSA 2 has been graded, with only 2 higher. $179\n\n[IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/002_zps5de228a9.jpg[/IMG] [IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/003_zps702dff58.jpg[/IMG]\nT210-3 Davis - Nicely centered front with a super clean back. Only Davis graded by PSA. $325\nT210-3 Jolley - Nicely centered, with signs of wear on corners. Reverse is strikingly clean. Only Jolley graded by PSA. $325\n\n[IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/004_zpsdb5700e5.jpg[/IMG] [IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/005_zpsdc00316d.jpg[/IMG]\nT210-3 Conaway - Slightly off-center, right to left and corner wearReverse is off-center, left to right but is clean. 1 of only 5 Conaways graded by PSA, with only 1 higher. $310\nT210-3 Salazor - Nicely centered with minor wear. Reverse is slightly off-center, right to left, but extremely clean. 1 of 2 highest graded by PSA. $325\n\n[IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/006_zps26f5db53.jpg[/IMG] [IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/007_zpsf3e15a3e.jpg[/IMG]\nT210-3 Tesreau - Off-center, left to right, along with some corner wear. Reverse is off-center, right to left, but extremely clean. 1 of only 2 graded by PSA, with this being the highest grade. $325 \nT210-3 Conaway - Slightly off-center, right to left, with minor corner wear. The reverse is slightly off-center, top to bottom, but very clean. This is the highest graded Conaway ever graded by PSA. $375\n\n[IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/008_zps28bbcb70.jpg[/IMG] [IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/009_zps8b8f38a2.jpg[/IMG]\nT210-3 Barenkemp - Great centering with minor corner wear. Reverse is slightly off-center, top to bottom, but clean as can be. 1 of 4 Barenkemp's graded by PSA, with only 2 higher. $325\nT210-3 Cowan - Slightly off-center, left to right and top to bottom, along with minor corner wear. Reverse is slightly off-center, top to bottom. 1 of 7 Cowan's to be graded by PSA, with only 1 example graded higher. $320\n\n[IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/010_zps93231d07.jpg[/IMG] [IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/011_zps1bbb1dc2.jpg[/IMG]\nT210-3 Williams - slightly off-center, right to left and bottom to top, with minor corner wear. Reverse is clean. 1 of only 4 Williams to be graded by PSA, with none higher!! $325\nT210-3 Burk - Slightly off-center, right to left, with corner wear. Reverse is off-center, right to left, but clean. 1 of 2 graded by PSA. This is the highest grade!! $325\n\n[IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/012_zpsf097cdca.jpg[/IMG] [IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/013_zpse01281ee.jpg[/IMG]\nT210-3 Francis - Slightly off-center, right to left, with minor corner wear. Reverse is slightly off-center, left to right,l and clean. 1 of 3 graded by PSA, with only 1 higher. $325\nT210-3 Hinninger - Slightly off-center, top to bottom, with minor corner wear. Small printers mark to right of portrait on front. Reverse is slightly off-center, top to bottom, but very clean. 1 of 2 graded by PSA, with only 1 higher. $325\n\n[IMG]http://i1236.photobucket.com/albums/ff450/wcsportscards/014_zpsb7809519.jpg[/IMG] \nT210-3 Shindel - Slightly off-center, right to left, with minor corner wear. Reverse is off-center, top to bottom. 1 of 3 graded by PSA, with only 1 higher. $325\nT210-3 Harbison - Decent centering with minor corner wear. Reverse is sliughtly off-center, top to bottom. 1 of 3 graded by PSA with none higher. This is the highest graded Harbison! $325",
      "post_time": "20130725T16:22:27-06:00",
      "timestamp": "1374790947"
    },
    {
      "post_id": "1165614",
      "post_title": "",
      "post_author_name": "wcsportscards",
      "post_content": "Thursday bump with price reductions. Feel free to make reasonable offers on any of these",
      "post_time": "20130801T23:58:13-06:00",
      "timestamp": "1375423093"
    }
  ]
}