{
  "id": "127355",
  "forum_id": "13",
  "title": "WTB low grade T206 HOFers",
  "author": "Luke",
  "reply_count": 2,
  "view_count": 344,
  "created_date": null,
  "last_reply": "20100904T02:40:43-06:00",
  "posts": [
    {
      "post_id": "834014",
      "post_title": "WTB low grade T206 HOFers",
      "post_author_name": "Luke",
      "post_content": "Some of you may have seen my thread about beginning to collect The Monster.  Thanks a lot for all your replies.  I've decided to focus on HOFers and keep an open mind to larger lots that may pop up.  I've been a little bit hesitant to post this for a couple reasons.  First, I have a somewhat limited budget, so if I get a bunch of great offers, I'm going to have to select only a few.  Second, the way I tend to collect cards is that \"I know I like it when I see it.\"  In other words, I could look at 2 different psa 2 Cobbs and fall in love with one and not really be interested in the other.  Don't know if that makes sense, but basically, I'm saying that I would love to see any cards that you guys are looking to sell, but I may not be able to make offers/accept offers on all of them.  \n     So, enough rambling:  I'm looking for low grade cards (probably nothing ablove a psa 3 or sgc 40.  ungraded cards are fine.  Beat up cards are fine.  I'm not exactly sure how this works, and I'll probably need help with Paypal (I do have an account though).  So, if you're willing to put up with all this, maybe we can make a deal.  \n     Thanks for reading this super long post.\n     You can PM me or email to [url]lukealyon@gmail.com[/url]\n\nLuke",
      "post_time": "20100903T20:25:21-06:00",
      "timestamp": "1283567121"
    },
    {
      "post_id": "834054",
      "post_title": "Got a few",
      "post_author_name": "Jaybird",
      "post_content": "Good luck in your quest...I've got some options for you.  I'll send you a few pics tomorrow.\n\n\nSam Crawford (throwing) PSA 2.5  $80\nChief Bender (w/ trees) PSA 2.5 $80\nVic Willis (throwing) probably a \"2\" ungraded $50\n\nI might have a few others and will let you know.\n\nJason",
      "post_time": "20100904T00:15:25-06:00",
      "timestamp": "1283580925"
    },
    {
      "post_id": "834063",
      "post_title": "t206 HOFers in lower grades",
      "post_author_name": "mart8081",
      "post_content": "PM sent\n\nMartin",
      "post_time": "20100904T02:40:43-06:00",
      "timestamp": "1283589643"
    }
  ]
}