{
  "id": "97534",
  "forum_id": "13",
  "title": "Looking for Partner on REA - SL T206 (lot 199)",
  "author": "Archive",
  "reply_count": 0,
  "view_count": 602,
  "created_date": null,
  "last_reply": "20080324T20:38:00-06:00",
  "posts": [
    {
      "post_id": "681137",
      "post_title": "Looking for Partner on REA - SL T206 (lot 199)",
      "post_author_name": "Archive",
      "post_content": "Posted By: Scott Levy\nWe need about half of the cards listed in this lot as upgrades....would anyone be interested in teaming up with us on this lot?  If so, I'd be happy to either split the cost or work out some other reasonable arrangements for the partner to receive my downgrades (all PSA 4s) at a discount.  If interested, shoot me a line at scottglevy@yahoo.com\n\nDESCRIPTION IS BELOW..........\n\nCollection of sixteen rare T206 Southern Leaguers (out of the 48 cards which comprise the entire “Southern League” subset), each graded and encapsulated EX 5 by PSA. The collection is comprised of the following:  Bernhard - Nashville (Old Mill back), Carey – Memphis (Piedmont back), Coles – Augusta (Piedmont back), Cranston - Memphis (Piedmont back), Guiheen – Portsmouth (Piedmont back), Hooker - Lynchburg (Piedmont back), Lafitte - Macon (Piedmont back), Molesworth - Birmingham (Old Mill back), Orth – Lynchburg (Piedmont back), Perdue - Nashville (Piedmont back), Rockenfeld – Montgomery (Piedmont back), Seitz – Norfolk (Piedmont back), Stark – San Antonio (Old Mill back), Thornton – Mobile (Old Mill back), Westlake – Danville (Piedmont), and White – Houston (Piedmont back). The Southern Leaguers have always been appreciated for their scarcity and as a popular subset to the T206 series. Collectors find it particularly challenging to assemble a complete set. This is a very attractive high-grade collection of sixteen cards, which could provide a strong foundation for a set of T206 Southern Leaguers, or contribute significantly in the assembly of a high-grade T206 set. The SMR value for the assigned grades is $3,360. Total 16 cards. Reserve $1,000. Estimate $2,000/$3,000.",
      "post_time": "20080324T20:38:00-06:00",
      "timestamp": "1206412680"
    }
  ]
}