{
  "id": "141033",
  "forum_id": "13",
  "title": "***HUGE group of 50 1909 Obaks Available!!  Price lowered!!***",
  "author": "shammus",
  "reply_count": 1,
  "view_count": 532,
  "created_date": null,
  "last_reply": "20111021T22:38:03-06:00",
  "posts": [
    {
      "post_id": "920888",
      "post_title": "***HUGE group of 50 1909 Obaks Available!!  Price lowered!!***",
      "post_author_name": "shammus",
      "post_content": "Have a large group of nearly two-thirds of a set of 1909 Obaks I'm making available for sale or trade. There are even a few high grade - 50s, 60s and 70s in here too. In addition to those, there are several SGC 30s and 40s, several of the more desireable horizontal poses, and a few of the tougher cards in the set such as Whalen, Harkins, etc... Also present are a couple cards missing color palettes giving those examples sort of a unique look.\n\nMany of the cards in this group are very nice considering 09 Obaks are typically found in bad shape. Even the cards that are in AUT holders are still very nice. Many of these actually are the handcut/frameless variation which typically end up in AUT holders anyway. \n\nAll in all, this would instantly give someone 49 out of 76 cards in the set.  Plus add in a 50th card, which is a dupe of Hogan, but kind of a neat card as it's missed a blue color pass during it's original print run so the colors are off.  The opportunity to acquire a group of this size only comes around once in a great while.  Asking $5800 delivered which is a tiny percentage of what the complete 09 Obak set went for in REA a couple months back.  That went for $25k plus if I recall....  \n\nScans available upon request and I'm happy to trade for cards on my wantlist.  I'll also listen to offers on individual cards if anyone wants to go that route.  Thanks in advance!\n\nBaum SGC 20\nBeall SGC 30\nBodie PSA 1\nBrown (horizontal) SGC 70\nD. Brown SGC 10 - gorgeous card...should be a 40...not sure why the low grade\nBrowning SGC 10 - gorgeous front...back damage\nCameron SGC 50\nCarrol GD (corner wrinkle)\nCarson PR - little wear, but card skinned on back\nChristian GD - wrinkle across middle\nCoy SGC AUT - gorgeous card, no wear or wrinkling\nEagan GAI 1\nEasterly SGC 20\nEhman SGC 20\nFansing SGC 30\nFisher PSA 1\nFitzgerald SGC AUT - gorgeous card, no wrinkling, tiny pinhole\nFlannigan SGC 40\nGarrett - FR - wrinkling\nGraney SGC 30\nGriffin GD - residue on front, no wrinkling\nGuyn PSA 2 (mk)\nHaley SGC 30\nHarkins PSA 1\nHenley PR (hole punch)\nHitt SGC A\nW. Hogan (horizontal) PSA 1\nHogan SGC 20\nHogan SGC AUT - borderless, however missing blue color palette\nHoward SGC 20\nHowze FR - wrinkling\nLaLonge PSA 1\nD. Lewis SGC 50\nMartinke (horizontal) PR (part of card is burnt off and missing...not pretty)\nMcArdle GD/VG\nMcKune SGC 40\nMelchoir SGC 30\nMohler (horizontal) FR (gorgeous front...back damage)\nMurphy SGC 10\nNelson (horizontal) SGC 30\nOrt FR - wrinkling across middle\nRagan SGC 20\nRaymer SGC 20\nSmith SGC 40\nTennant SGC A\nWhalen VG - no wrinkling\nWheeler SGC 20\nR. Williams SGC 40\nWillis VG (no creasing)\nZeider SGC 30",
      "post_time": "20110827T20:12:22-06:00",
      "timestamp": "1314497542"
    },
    {
      "post_id": "933630",
      "post_title": "",
      "post_author_name": "shammus",
      "post_content": "Price for the lot lowered to $5800.  Would consider selling or trading individual cards as well so send me your offers if there are cards you need!\n\nBrian",
      "post_time": "20111021T22:38:03-06:00",
      "timestamp": "1319258283"
    }
  ]
}