{
  "id": "317050",
  "forum_id": "13",
  "title": "WTB T205 gold lots for my set",
  "author": "1956 Fan",
  "reply_count": 4,
  "view_count": 688,
  "created_date": null,
  "last_reply": "20220327T15:05:49-06:00",
  "posts": [
    {
      "post_id": "2208122",
      "post_title": "WTB T205 gold lots for my set",
      "post_author_name": "1956 Fan",
      "post_content": "I will be submitting so they will match my set. If after the grading fee the cost of the card is higher I’ll just buy it graded. Appreciate any help.",
      "post_time": "20220323T05:52:48-06:00",
      "timestamp": "1648036368"
    },
    {
      "post_id": "2208462",
      "post_title": "",
      "post_author_name": "T205 GB",
      "post_content": "[quote name=\"1956 Fan\" post=2208122]I will be submitting so they will match my set. If after the grading fee the cost of the card is higher I’ll just buy it graded. Appreciate any help.[/QUOTE]\n\nJust buy graded cards and save yourself, and all of us, the hassle of hearing the mistakes to be made on this fruitless endeavor. What does your set consist of? What grades are you after? What grader do you prefer? What is most important to you when buying the cards? Who are the players you need or want? Are certain variations needed and what condition is acceptable for those?  All this info is needed for what your asking. Waste of a post IMO!",
      "post_time": "20220324T11:19:35-06:00",
      "timestamp": "1648142375"
    },
    {
      "post_id": "2208656",
      "post_title": "",
      "post_author_name": "1956 Fan",
      "post_content": "Thanks for chiming in! What a great guy! \nA) the contents of my set are inconsequential \nB) not specifying on condition should be a clue that it doesn’t Matter\nC) what grader I use is pointless to the seller. Much like my favorite color \nD) see C. Nothing to do with asking what raw are for sale. Mostly helpful sellers that aren’t snarky to me for no reason at all. \nE) Only 45 cards In so most cards I need. I’m not making a checklist. It’s much easier to see what people have. I’ve done this fruitless endeavor for over 30 years on many sets. \nF) Waste of a reply IMO. Added nothing of value except showing everybody else who not to deal with. \n\nTo the 3 guys who understood my post without having to break it down to 1st grade reading level.. thank you for the messages. You have made this a fruitful endeavor.",
      "post_time": "20220325T01:28:39-06:00",
      "timestamp": "1648193319"
    },
    {
      "post_id": "2209228",
      "post_title": "",
      "post_author_name": "T205 GB",
      "post_content": "Your welcome Bruce II :D",
      "post_time": "20220326T18:03:20-06:00",
      "timestamp": "1648339400"
    },
    {
      "post_id": "2209492",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "I have a small lot that might interest you. Some have been submitted but don't match my set. Price includes grading fees or not. Appreciate your help.",
      "post_time": "20220327T15:05:49-06:00",
      "timestamp": "1648415149"
    }
  ]
}