{
  "id": "134547",
  "forum_id": "13",
  "title": "FS - T206 wooden boxes (T205 etc)",
  "author": "jp1216",
  "reply_count": 12,
  "view_count": 1817,
  "created_date": null,
  "last_reply": "20120223T14:04:48-06:00",
  "posts": [
    {
      "post_id": "879444",
      "post_title": "FS - T206 wooden boxes (T205 etc)",
      "post_author_name": "jp1216",
      "post_content": "My father-in-law is FINALLY ready to sell some of his work.  His work is amazing!  I LOVE my box and want everyone to enjoy these!  I've posted before about graded card boxes (those will likely come later this spring):\n\n[url]http://net54baseball.com/showthread.php?t=117532[/url]\n\nHis first project is to sell these \"T206 boxes\":\n\n[IMG]http://i732.photobucket.com/albums/ww330/jp1216a/Net54/t206box02.jpg[/IMG]\n\nPlease visit his website @:  [url]http://www.dakotawoodcrafts.com[/url]\n\nClick on the 'Baseball Card Boxes' section and both T206 Box photos for more information!\n\nPlease contact me for ANY information.  Purchases can be made via PayPal through his website - BUT please contact me with special requests either before or after purchasing.  I want to be the middle man on these to help everyone out.  Please email me after you make a purchase to specify your options (wood, dividers, logo/design on top).\n\nCurrently he is offering the boxes with or without the T206 logo, with Oak or Walnut wood, with brown or clear dividers.  Limited quantities of each.  He will make more based on demand.  Please visit his website for detailed information and contact ME via PM/EMAIL too.",
      "post_time": "20110318T18:16:34-06:00",
      "timestamp": "1300493794"
    },
    {
      "post_id": "879769",
      "post_title": "",
      "post_author_name": "jp1216",
      "post_content": "One weekend bump...\n\nSold about 5 boxes so far.  A few finished boxes will remain at this price - until they are gone.  New boxes can be ordered as well - but the price may go up.  \n\nKeep the feedback coming in!  Please email me with questions/orders.\n\nJon",
      "post_time": "20110320T05:32:59-06:00",
      "timestamp": "1300620779"
    },
    {
      "post_id": "881382",
      "post_title": "",
      "post_author_name": "jp1216",
      "post_content": "Another bump.  First shipment of boxes that were purchased by Net54 members went out last Monday.  The feedback has been OUTSTANDING. Some ordered the Oak.  Some the Walnut.  Some with the T206 logo.  Some without.\n\nDesigns are underway for future graded card and other card boxes.\n\nKeep the ideas coming (and purchases):)",
      "post_time": "20110326T11:26:08-06:00",
      "timestamp": "1301160368"
    },
    {
      "post_id": "881498",
      "post_title": "",
      "post_author_name": "gnaz01",
      "post_content": "Absolutely love the work, but I don't have my cards raw, so I will have to wait for the graded card boxes.  Are you going to let us know when your father in law can do them?",
      "post_time": "20110326T19:45:06-06:00",
      "timestamp": "1301190306"
    },
    {
      "post_id": "881535",
      "post_title": "Great woodwork!!",
      "post_author_name": "Comiskey",
      "post_content": "Hi you guys\n\nI just wanted to let everybody know that these boxes are really well done! I received mine yesterday and am blown away by the quality and craftsmanship that went into it!\n\nThanks again\nJeff",
      "post_time": "20110327T00:47:57-06:00",
      "timestamp": "1301208477"
    },
    {
      "post_id": "882499",
      "post_title": "",
      "post_author_name": "Vol",
      "post_content": "[quote name=\"gnaz01\" post=881498]Absolutely love the work, but I don't have my cards raw, so I will have to wait for the graded card boxes.  Are you going to let us know when your father in law can do them?[/QUOTE]\n\nThe boxes look amazing. I am going to  wait to see if your father in law makes boxes for graded cards as well. He does fine work.",
      "post_time": "20110330T10:56:40-06:00",
      "timestamp": "1301504200"
    },
    {
      "post_id": "882517",
      "post_title": "",
      "post_author_name": "jp1216",
      "post_content": "Graded boxes are next.  I'm still looking for people to email ideas.  He has made boxes for me that hold nearly 270 graded cards - but they are big/heavy.  I'm thinking about smaller, customizable boxes.  Movable/removable dividers, drawers, etc.\n\nThe T206 'raw' boxes are a neat 'cigar style' smaller box that look great to display.  Graded card boxes tend to be too big to 'show'.  My 'graded' boxes are nice to display - but they are much bigger and not as easy to carry as MBMiller's custom Pelican cases.  \n\nMy father-in-law will be making graded card boxes based on demand.  I just need some more ideas to give them that custom look and unique quality.\n\nT206 boxes have sold well.  A couple still remain for immediate shipment.  More orders would require a couple weeks to produce.",
      "post_time": "20110330T12:37:15-06:00",
      "timestamp": "1301510235"
    },
    {
      "post_id": "885889",
      "post_title": "",
      "post_author_name": "jp1216",
      "post_content": "Update: \n\nOnly a few \"T206\" boxes remain at the intro price.  Sale ends 5/1/2011.  So far, everyone receiving a box has been very satisfied.  \n\nKeep the ideas coming for future boxes.  Graded cards, raw, etc etc.",
      "post_time": "20110411T08:15:38-06:00",
      "timestamp": "1302531338"
    },
    {
      "post_id": "889467",
      "post_title": "",
      "post_author_name": "jp1216",
      "post_content": "4 boxes are ready to ship right away.  Additional boxes will require some time to make.\n\nSo far, feedback remains outstanding from those that have received their boxes.\n\nPM me with questions!",
      "post_time": "20110425T11:56:42-06:00",
      "timestamp": "1303754202"
    },
    {
      "post_id": "933243",
      "post_title": "",
      "post_author_name": "jp1216",
      "post_content": "OK - a few left over!  A dozen + sold!\n\nPrice drop - a few left.  No more planned in production.  Only a few left.\n\n\n\nPlease email me @:  [url]jp1216@gmail.com[/url] to reserve and customize.",
      "post_time": "20111020T14:33:42-06:00",
      "timestamp": "1319142822"
    },
    {
      "post_id": "939877",
      "post_title": "",
      "post_author_name": "jp1216",
      "post_content": "ONLY 4 LEFT!  2 of each style.  My father-in-law is looking to move the final ones and move on to other projects.  Next stop - eBay.\n\nPM me first to confirm style etc.",
      "post_time": "20111115T19:15:42-06:00",
      "timestamp": "1321409742"
    },
    {
      "post_id": "967462",
      "post_title": "",
      "post_author_name": "jp1216",
      "post_content": "2 remaining - both are the lighter colored Oak.  With or without logo on top.\nBoth are now sold!!  Thanks!  Please PM for future Ideas.",
      "post_time": "20120215T17:08:08-06:00",
      "timestamp": "1329350888"
    },
    {
      "post_id": "969757",
      "post_title": "",
      "post_author_name": "Runscott",
      "post_content": "I received mine today.  Very solid, very nicely done.  If you remove one of the dividers, it fits postcard top-loaders or slabbed T222's perfectly.\n\nThis gives me more incentive to crack out tobacco and caramel cards.",
      "post_time": "20120223T14:04:48-06:00",
      "timestamp": "1330031088"
    }
  ]
}