{
  "id": "112628",
  "forum_id": "13",
  "title": "Question about The National",
  "author": "forazzurri2axz",
  "reply_count": 1,
  "view_count": 916,
  "created_date": null,
  "last_reply": "20090526T08:18:36-06:00",
  "posts": [
    {
      "post_id": "725805",
      "post_title": "Question about The National",
      "post_author_name": "forazzurri2axz",
      "post_content": "If I were looking to put together a raw set of t206's and possibly t205's, are there usually plenty of those at the National or primarily graded cards(of which I already have a graded set). And more importantly, are the prices at the National for average condition commons generally higher than Ebay or the B/S/T??\n\n   Additionally, even though this is a vintage forum, if I'm filling numerous sets in the mid 50's-late 60's (raw cards) are the prices the typical $1-3.00 for an average common or higher just BECAUSE it's the National??\n\nthanks, Bill",
      "post_time": "20090526T08:13:08-06:00",
      "timestamp": "1243347188"
    },
    {
      "post_id": "725806",
      "post_title": "",
      "post_author_name": "tiger8mush",
      "post_content": "Hi Bill, not trying to be cynical, but couldn't you buy graded cards and crack them out and then they are raw?  In general, buying raw t206s doesn't get you more per dollar than buying graded.  If anything, buying graded and cracking out may be cheaper.  For example, if you are looking at cards in the VG range, a raw card with great centering and lightly touched corners but a hairline surface crease on the back would likely be considered \"EX\" in raw terms, but a grading company would probably calling it VG cuz of the crease, so it'd be cheaper buying it graded and taking it out of the holder.\n\nJust a thought.\n\nAlso, I've never been to a National (plan on going to next year's in Baltimore) but from what I hear cards are often priced higher with plenty of negotiation room.\n\nGood luck!\nRob\n:o)",
      "post_time": "20090526T08:18:36-06:00",
      "timestamp": "1243347516"
    }
  ]
}