{
  "id": "363070",
  "forum_id": "13",
  "title": "FS - T200 Fatima Team Cards - Set Break",
  "author": "jayshum",
  "reply_count": 2,
  "view_count": 876,
  "created_date": null,
  "last_reply": "20250722T04:17:12-06:00",
  "posts": [
    {
      "post_id": "2527767",
      "post_title": "FS - T200 Fatima Team Cards - Set Break",
      "post_author_name": "jayshum",
      "post_content": "For sale are the following T200 Fatima Team Cards.  Payment through PayPal F&F or Venmo with no fees.  If you want additional information or pictures for any cards, please PM me.  \n\nExcept where noted, listed prices include priority shipping with signature confirmation for purchases under $2500 and priority express shipping with signature confirmation for purchases over $2500.  Shipping only to the continental US.\n\n\n$3200 – Boston Nationals SGC 3 – Beautiful card with some minor corner creases and wear.\n\n$1600 – Brooklyn Nationals PSA 4 – Beautiful card with some minor corner creases and wear.\n\nSOLD $300 – Chicago Nationals SGC 1.5 – Multiple creases and slightly clipped corner.\n\n$250 – Cincinnati Nationals PSA 1 – Nice looking card for the grade. Some creases and 2 corners with damage. (shipped by USPS Ground Advantage)\n\n$900 – New York Nationals SGC 1.5 – Two vertical creases through the card and a few smaller creases as well.\n\n$700 – Pittsburgh Nationals SGC 1 – Significant creasing and corner damage. Small piece of tape on back.\n\n$750 – St. Louis Nationals PSA 1 – Nice looking card for the grade with just some minor creasing.\n\n$350 – Boston Americans SGC 1 – Small missing piece on left side of card and some creases and what looks like a small tear on bottom of card.\n\n$250 – Chicago Americans SGC 1 – Creases and 2 damaged corners.  Back has paper or glue residue.  Small piece of slab edge missing from lower, left corner on back (as pictured). (shipped by USPS Ground Advantage)\n\n$2250 – Cleveland Americans – Good (ungraded) – Beautiful looking card with a few light creases and small bit of paper loss on left border.\n\n$1200 – Detroit Americans SGC 2 – Two vertical creases through the card but otherwisea nice looking card.\n\nSOLD $2500 – New York Americans PSA 2 – Beautiful looking card with a few small creases.\n\n$100 – Philadelphia Americans – Trimmed along top edge and several creases. (shipped by USPS Ground Advantage)\n\n$750 – St. Louis Americans – SGC A – Trimmed along bottom edge which is jagged but otherwise a nice looking card with a small crease.\n\nSOLD $350 – Washington Americans – PSA 1 (MC) – Nice looking card with a few small creases and miscut top to bottom.",
      "post_time": "20250716T16:03:05-06:00",
      "timestamp": "1752703385"
    },
    {
      "post_id": "2528581",
      "post_title": "",
      "post_author_name": "jayshum",
      "post_content": "All reasonable offers will be considered.",
      "post_time": "20250721T14:23:33-06:00",
      "timestamp": "1753129413"
    },
    {
      "post_id": "2528681",
      "post_title": "",
      "post_author_name": "Danny Smith",
      "post_content": "Thanks for the card!\n\nGreat seller here, folks!!",
      "post_time": "20250722T04:17:12-06:00",
      "timestamp": "1753179432"
    }
  ]
}