{
  "id": "98469",
  "forum_id": "13",
  "title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
  "author": "Archive",
  "reply_count": 21,
  "view_count": 4470,
  "created_date": null,
  "last_reply": "20080928T10:39:00-06:00",
  "posts": [
    {
      "post_id": "683845",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\n     I had this card sold, but buyer backed out.  Card would probably graded an SGC 30 (that is the highest grade they will allow with a pen mark).  The card was in a PSA 3 (MK) holder but was removed.  The card is unaltered and 100% authentic.  I am looking for some nice vintage in return and do not mind trading for up to three cards, but no more unless it is a really good deal.  Would like to get a nice Cobb, I am open to any big names and prefer T206, but again, open to anything.  Thanks, and email works best ( dustinthompson@comcast.net ).\n\n[IMG][IMG]http://i24.photobucket.com/albums/c3/jdtcards/51mantlerc.jpg[/IMG][/IMG]\n[IMG][IMG]http://i24.photobucket.com/albums/c3/jdtcards/51mantlercback.jpg[/IMG][/IMG]\n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080924T18:47:00-06:00",
      "timestamp": "1222303620"
    },
    {
      "post_id": "683846",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Mike Mccullough\nYGM",
      "post_time": "20080924T21:52:00-06:00",
      "timestamp": "1222314720"
    },
    {
      "post_id": "683847",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: JP\nThat card looks awfully pixelated to be real...\n\nThis is also errantly in the tobacco card section.",
      "post_time": "20080924T23:51:00-06:00",
      "timestamp": "1222321860"
    },
    {
      "post_id": "683848",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\nJP - Yes, I know where the card is listed and was offering this card for tobacco cards (or other vintage).  As for the authenticity, I will guarantee it 100% and like I stated the card was removed from a PSA 3 (MK) holder.  Also, I have been a collector for several years and have bought and sold some very nice items.  I am not going to sit here and compare portfolios with anyone as there is no need and I am sure I would be blown away by most of you.  This is the very reason I got out of trying to deal in modern cards.  You post a card on another forum and either you are offered nothing buy JUNK and/or you get replies like, \"...its not authentic...\", \"...its not worth what you want...\", \"...its in the wrong section...\" and so on. I simply thought there would be more ADULTS when it comes to dealing with vintage and I have always loved vintage more than modern.  If you have no interest in the card, why bother posting.  I am putting a 100% guarantee on the card that it is UNALTERED and AUTHENTIC.  Also, if you read the thread, which obviously you did not, it states different items for which I am looking one of which would be T206s. \n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080925T13:57:00-06:00",
      "timestamp": "1222372620"
    },
    {
      "post_id": "683849",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\nMike - Email replied.  Thank you.\n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080925T13:59:00-06:00",
      "timestamp": "1222372740"
    },
    {
      "post_id": "683850",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: JP\nGot a picture of the PSA holder it used to be in?  I think it must've been a fake holder or a WIWAG cracked case because I'm almost 100% sure this card is a reprint.",
      "post_time": "20080926T13:56:00-06:00",
      "timestamp": "1222458960"
    },
    {
      "post_id": "683851",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\nJP - Do you own a '51 Bowman Mantle?  This card is 100% Authentic and I have no reason to lie about it.  As for the PSA holder, nope, I do not have it, and not sure why it would have been kept.  What a joke, seriously.  Grow up.\n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080926T14:01:00-06:00",
      "timestamp": "1222459260"
    },
    {
      "post_id": "683852",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\nNot mine, but this one looks VERY pixelated also, but I am sure its in a fake holder or something along those lines, right?\n\n[IMG][IMG]http://i24.photobucket.com/albums/c3/jdtcards/51BMantleSGC50016.jpg[/IMG][/IMG]\n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080926T14:21:00-06:00",
      "timestamp": "1222460460"
    },
    {
      "post_id": "683853",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: JP\nDustin,\n\nYou need to relax.  Yes, I do have a 1951 Bowman Mantle, in fact I have four, and I've probably owned 20 different ones over the last 20 years.  If you have been in the card business for awhile, then you should be aware that sometimes counterfeit cards end up in holders.  I have seen countless 1951 Bowman Mickey Mantle's, and I've seen plenty counterfeit ones as well.  It is one of the most commonly counterfeited cards in the industry.  \n\nI am 100% sure that the card you have pictured is a counterfeit, and the dead giveaway is the pixelization.  Not to mention the bleed of the trees on the bottom over the black line.  Get it?  Not 99% sure it is a fake, 100% sure.  You don't need to tell me to \"grow up\"  I'm not acting immaturely.  I'm trying to get you some very vital information.  The card is a fake!  Educate yourself...try [url]http://home.comcast.net/~52mantle/52toppsmantle51b.htm[/url]\n\nA true '51 Bowman Mantle looks nothing like that.  It looks more like...\n\n[IMG]http://www.network54.com/Realm/tmp/1222470369.JPG[/IMG] \n\nAnyone else want to chime in and help clear the air for this guy?",
      "post_time": "20080926T17:18:00-06:00",
      "timestamp": "1222471080"
    },
    {
      "post_id": "683854",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Josh\nThe card looks fake to me. I have a PSA 3 and it looks nothing like the one I have. Dustin..... Would you get the card graded for the buyer?",
      "post_time": "20080926T20:33:00-06:00",
      "timestamp": "1222482780"
    },
    {
      "post_id": "683855",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\n     I have looked the card over and checked it in every way I know possible.  If the card is a fake, its a VERY VERY VERY VERY GOOD fake.  I guess I just need to send it in and have it slabbed, but the card is real.  If a buyer wanted to pay for the grading, then yes, I would have it graded for a buyer.  Also, I have NEVER nor will I EVER sell or trade a card that I even slightly suspect is fake.   \n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080926T22:39:00-06:00",
      "timestamp": "1222490340"
    },
    {
      "post_id": "683856",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\n     I was looking at the SGC 96 and comparing the scans to the one I own and the SGC 50 scan that I added.  The SGC 96 has a line running from the top edge of the bat that seems to run into the name box.  Neither of the other two have this.  Does this conclude that the SGC 96 is also a fake becuase most do not have that line?  I am not trying to be rude in any way at all, I am just pointing out the obivious differences in a lot of these cards.\n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080926T22:50:00-06:00",
      "timestamp": "1222491000"
    },
    {
      "post_id": "683857",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Jason\nLionel Carter don't collect no fakes!!! [IMG]https://www.net54baseball.com/images/happy.gif[/IMG]",
      "post_time": "20080926T23:21:00-06:00",
      "timestamp": "1222492860"
    },
    {
      "post_id": "683858",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\nJason - Yes, I am aware.  Just pointing out obvious differences in the cards.  Either way, I ask any of you to email me concerning the card and give me your opinions.  Planning on sending the card for grading either way.  Thanks.\n\n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080926T23:27:00-06:00",
      "timestamp": "1222493220"
    },
    {
      "post_id": "683859",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: josh\nIf you send the card in and it comes back in a SGC or PSA holder I am interested. I have cash or trade.",
      "post_time": "20080927T14:05:00-06:00",
      "timestamp": "1222545900"
    },
    {
      "post_id": "683860",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Darren\nI think the pixelation is because the colors are out of register. That is what is giving it that effect.\nLooks real to me.",
      "post_time": "20080927T17:57:00-06:00",
      "timestamp": "1222559820"
    },
    {
      "post_id": "683861",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Eric\nAnother explanation for the pixelation could be the scanner.  I know if I make high resolution scans at 300 dph (or whatever it's called) and shrink down the scan to fit a message board posting, I get really bad pixelation.  As long as I keep the setting down, I don't have that problem.",
      "post_time": "20080927T18:27:00-06:00",
      "timestamp": "1222561620"
    },
    {
      "post_id": "683862",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\nExactly.  I would not have bought the card without looking it over with a magnifying glass and all.  The card is real and I have no worries keeping it, selling it, trading it, or grading it.  The printing is sloppy on the card, but there are actually many like this out there.  Card in hand, no pixelation at all, but scanned at a fairly high resolution and a larger size makes the card seem very pixelated - just like the picture above (has been deleted) that I got from eBay, and it was SGC graded.  \n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080927T21:26:00-06:00",
      "timestamp": "1222572360"
    },
    {
      "post_id": "683863",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Lance\nFor $17.00, SGC can end this situation before next weekend. The current scan you have clearly makes it appear as a fake, but you have the opportunity to prove all the neh-sayers wrong. Good luck.",
      "post_time": "20080927T22:43:00-06:00",
      "timestamp": "1222576980"
    },
    {
      "post_id": "683864",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: JP\nI would agree that if the card does not look pixelated in person, then it could most certainly be real.  I have seen scanners that focus on the front of a holder and pixelate the card...never thought of that in this case just because I've seen so many pixelated fake Bowman Mantles.  There is at least one at every card show.",
      "post_time": "20080928T02:59:00-06:00",
      "timestamp": "1222592340"
    },
    {
      "post_id": "683865",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: leon\nI have no dog in the fight except I am a little bit of a referee around here. I just looked at about 15 or so graded 1951 Mantles on ebay. The first 13-14 showed none of the trees going below the black line, as mentioned....And then I saw one in a PSA/DAN AUT holder that had a sig and had the trees below the black line and then I saw this one too...\n\n[url]http://cgi.ebay.com/1951-Bowman-253-Mickey-Mantle-VG-EX-PSA-4_W0QQitemZ200257609419[/url]\n\nI used to own a PSA 6 1951 Mantle but sold it when I got out of the Rookie HOF kick....I am going to say it looks real to me but I have far less experience with this cards than Jp who is posting....If it is offered with a guarantee, and whoever buys it sends it into our friends at (pick your grading company), then I would see no reason for too much worry. I doubt a mistake of this type would be made twice on the same card by any reputable company....take care",
      "post_time": "20080928T09:46:00-06:00",
      "timestamp": "1222616760"
    },
    {
      "post_id": "683866",
      "post_title": "1951 Bowman MICKEY MANTLE Rookie for Trade",
      "post_author_name": "Archive",
      "post_content": "Posted By: Dustin\n     To all that have posted, thanks.  It is good to see that people on here look out for one another.  I will say, at first, I was VERY angry as I had several nice trade offers and as soon as JP posted, I never heard back from any of them.  That is why I got so mad.  I was willing to ship first in the trade and like I stated, giving a 100% guarantee on the card.  It is not that rare of a card and I was amazed at how fast people were willing, without actually holding the card, to give the card the title of being a reprint.  I know for a fact the card is authentic.  I have a very good reputation (maybe not here yet) in the sportscard world and have a lot of people that I deal with.  I have NEVER, nor will I ever, offer a card that is not authentic, I would not even purchase a reproduction.\n     Either way, no harm done, I guess.  Although, if the few of you that may trade offers via email want to revisit this trade, feel free to emai me.\n     Thanks.\n-Dustin\n\nThank you for your time.\nDustin Thompson\njdtcards\ndustinthompson@comcast.net",
      "post_time": "20080928T10:39:00-06:00",
      "timestamp": "1222619940"
    }
  ]
}