{
  "id": "114052",
  "forum_id": "13",
  "title": "***Details on t210 Series 5 group***",
  "author": "shammus",
  "reply_count": 0,
  "view_count": 470,
  "created_date": null,
  "last_reply": "20090712T16:58:14-06:00",
  "posts": [
    {
      "post_id": "735644",
      "post_title": "***Details on t210 Series 5 group***",
      "post_author_name": "shammus",
      "post_content": "I've received several emails/messages about the t210 Series 5 and 7 groups wanting to know if I was going to break up these lots.  My initial plan is to pursue both sets so the bulk of these will stay with me.  However, I figure I'd list them out for everybody just in case I'm able to swing a few trades for cards I need to complete sets I'm close on.  If there's a card that someone really needs, feel free to write and we can always talk about it too.  \n\nConditionwise, most of these cards are very very nice.  No dogs and all are still displayable.  In many cases, the cards are even free from wrinkling altogether.  What holds a lot of the cards back are small bits of paper loss on the back due to being attached to a scrapbook.  \n\nThanks much,\nBrian\n[url]redmaccie@hotmail.com[/url]\n\n\n -- WANTLIST --\n\nt210 Orange Borders - need any.  Pink and yellow borders too :)\nEUNC orange borders - any commons\nd311s (need 15) Burrell, Castleton, Christian, Daley, Delhi, Dillon, Gregory, Kuhn, Lewis, Maggert, Ryan, Stamfield, Steen, Tennant, Wares\n1918 Zeenuts - need any\n1919 Zeenuts (need 11) - Lane (oak), Pinelli (sac), Prough (sac), Vance (sac), Spencer (saltlake), Seaton (SF), Smith, Bill (SF), Snell (SF), Arbuckle (Vern), Check (Vern), Meusel (vern)\nw590 - REALLY, REALLY need a Spencer!!!\n\n\nHere's the large list of t210-5s I received.  One note....no t210-7s in here.  Just the Series 5s for now.\n\n\nSeries 5\nAbercrombie FR/GD - wrinkle across middle, some back damage \nAverett GD - no wrinkling, some back damage\nBigbie FR/GD - wrinkle in corner, some back damage\nBrannon GD/VG - corner chipping, no wrinkling/creasing, damage free on back\nBrazell GD - wrinkle across middle, tiny nick on back\nBullock GD - no wrinkling, some back damage\nCorbett VG - very nice, no wrinkling on front.  No back damage\nCoutts FR/GD - nice VG/EX on front, small areas of damage on back\nCrouch VG - mild corner chipping, no wrinkling, no damage on back\nDerrick GD/VG - vg/ex w/ no wrinkling on front, bits of residue and a nick on back\nEhrhardt FR - VG on front, no wrinkling, some back damage\nFairbanks GD - no wrinkling on front, two small areas of wear on back\nFerrell FR/GD - corner edge/wear on front, no wrinkling, small area of damage on back\nFinn GD - VG+ on front, no wrinkling, tiny spot of damage on back\nFrancisco GD/VG - wrinkle free and nice on front, mild residue on back\nGardin FR/GD - very nice front, no wrinkles, a couple tiny areas of damage on back\nGilmore GD - great catcing pose, mild corner wear on front, mostly clean back\nGorman FR/GD - wrinkle across middle, some back damage\nGuss GD - no wrinkling, some back damage\nHarrington FR - a couple tiny wrinkles, some back damage\nHarris VG - no wrinkling, very mild residue on back\nHartley GD - no wrinkling, tiny spot of damage on back\nHayes VG - no wrinkling, back mostly clean and damage free\nHumphrey FR - corner chipping, one wrinkle, mostly clean and damage free on back\nJackson GD - nice wrinkle free front, tiny spot of damage on back\nJenkins FR - corner/edge chipping, no wrinkling, tiny dots of wear on back\nLaval FR/GD - very nice on front, no wrinkling...tiny areas of damage on back\nLothrop GD - wrinkle free front, tiny spot of damage on back\nMangum GD - wrinkle free front, tiny spot of damage on back\nJ. McCarthy GD - no wrinkling, very nice front, two tiny spots of damage on reverse\nMcFarlin GD - terrific pose, no wrinkling and great looking front.  Mild residue and wear on reverse\nMidkiff PR/FR - still a displayable card but has a couple wrinkles on front with some mild wear on reverse\nMoore FR/GD - faint corner wrinkle, residue and tiny areas of wear on back \nRedfern FR/GD - mild corner wear, residue and tiny areas of wear on back \nReis FR - missing left border, couple spider wrinkles on front, tiny areas of wear on reverse\nSmith GD - VG/EX on front, no wrinkling and mostly sharp corners, couple areas of wear on reverse\nTemplin PR/FR - wrinkling, corner wear, couple scrapes on back\nThrasher FR - corner wear, no wrinkling, a couple scrapes on back\nThrasher VG - EX condition on front, sharp corners, no wrinkles....mild residue on reverse\nWalters FR - wrinkling on front, back mostly clean and damage free\nWehrell VG - a bit of edge chipping, no wrinkling, back mostly clean and damage free\nWilliams FR/GD - mild corner chipping, no wrinkling, some reside/scuffing on back\nWynne FR/GD - no wrinkling, some reside/scuffing on back",
      "post_time": "20090712T16:58:14-06:00",
      "timestamp": "1247439494"
    }
  ]
}