{
  "id": "362908",
  "forum_id": "13",
  "title": "For sale. T205 Gold border set only missing Cy Young",
  "author": "1956 Fan",
  "reply_count": 3,
  "view_count": 1904,
  "created_date": null,
  "last_reply": "20250712T12:49:39-06:00",
  "posts": [
    {
      "post_id": "2526924",
      "post_title": "For sale. T205 Gold border set only missing Cy Young",
      "post_author_name": "1956 Fan",
      "post_content": "All PSA graded I have 205 of the 206 cards in the base set. Just missing Cy Young.  VCP average on the set is right at a 2. You can see pics of each card in the basic set registry #18 Cory & Jason’s Smokeless show. Was asking 32k, but will take 30k since it’s missing Young.  I have had 4 people contact me so far so it will be first come first serve. Will include hard carry case.",
      "post_time": "20250711T19:22:09-06:00",
      "timestamp": "1752283329"
    },
    {
      "post_id": "2526966",
      "post_title": "",
      "post_author_name": "1956 Fan",
      "post_content": "I’ve put together graded sets of 1956 7’s&8’s 1941 Play Ball 5’s and up, 1966,1967 raw. All eventually sold them. This will be my last set I’m doing because people do not know the set like the person putting it together. Somebody doing a T207 set would have a better idea than I would on accurate pricing. No recent sales and VCP comps from 16 years ago are $12. Not accurate.  A friend and I spent 8 days going card by card through every card in the set.  Our average is a PSA 2. Another collector here pointed out that a PSA 2 average is 66k. Now that’s counting 11 cards in the master set.  We  took the highest we could find to lower the price down. Like the Matthewson 1 loss was $1200 (very old VCP) but one sold last year on REA or a similar website for 7000. We took the 7000 on Matthewson average and knocked the average down in the buyers favor on each card to be safe. We very generously priced the 11 master cards at 22k. Which is crazy but took down the average to 44. Then we also took off $ for the PSA 1 HOF cards that were averaged a 2. The 3’s 4’s and 5’s that are in the set as a premium were lightly figured as you can see. 30k out the door is way less than the numbers say. Just wanted everyone to know how much time was spent putting in building this set and how carefully we bought at the best price possible.  The VCP and where we are is a great deal for the buyer. Just wanted to explain. \nThanks guys.",
      "post_time": "20250712T07:51:13-06:00",
      "timestamp": "1752328273"
    },
    {
      "post_id": "2526987",
      "post_title": "",
      "post_author_name": "puckpaul",
      "post_content": "You should auction it.",
      "post_time": "20250712T10:30:30-06:00",
      "timestamp": "1752337830"
    },
    {
      "post_id": "2527003",
      "post_title": "",
      "post_author_name": "1956 Fan",
      "post_content": "[quote name=\"puckpaul\" post=2526987]You should auction it.[/QUOTE]\n\nI’d be a nervous wreck lol",
      "post_time": "20250712T12:49:39-06:00",
      "timestamp": "1752346179"
    }
  ]
}