{
  "id": "98867",
  "forum_id": "13",
  "title": "FS T206 Overall  Cubs Cycle back",
  "author": "Archive",
  "reply_count": 1,
  "view_count": 320,
  "created_date": null,
  "last_reply": "20081212T08:46:00-06:00",
  "posts": [
    {
      "post_id": "684978",
      "post_title": "FS T206 Overall  Cubs Cycle back",
      "post_author_name": "Archive",
      "post_content": "Posted By: whitehse\nOk I have never had a chance to sell anything on here before although I have read the boards for over 4 years now...so if I make a mistake please let me know\n\nI am clearing out parts of my collection and I have always had this card as a &quot;type&quot; card but have decided to sell it for some quick Christmas money.  \n\nThis card presents beautifully and has good eye appeal.  It does have an ever so so slight hairline crease running up the center of the card but this crease can only be seen when held at a angle to a light. This crease does not go the length of the card and you will not be able to see this crease under normal viewing. I do not see where this hairline crease goes through to the back of the card. This card also has a slight crease near the throwing hand but the scan makes it look much worse than it really is\n\nThere is some tape and minor pen marks on the back but otherwise this is a nice card for someone who needs it for his set.  Please see the scans for condition.\n\nI am not sure what to ask so I will leave that up to you guys here to make offers.  Dont worry I am not looking for huge bucks.  Please make me an offer and email me at andy.white63@gmail.com.\n\nThanks for your time and I look forward to reading more entertaining posts on here.  \n\nAndrew\n\n[IMG]http://img.photobucket.com/albums/v215/mchenrycards/t206f001.jpg[/IMG]\n\n[IMG]http://img.photobucket.com/albums/v215/mchenrycards/t206b001.jpg[/IMG]",
      "post_time": "20081125T18:51:00-06:00",
      "timestamp": "1227664260"
    },
    {
      "post_id": "684979",
      "post_title": "FS T206 Overall  Cubs Cycle back",
      "post_author_name": "Archive",
      "post_content": "Posted By: Lee Behrens\nThanks for the excellent transaction,\n\nHappy Holidays,\n\nLee",
      "post_time": "20081212T08:46:00-06:00",
      "timestamp": "1229096760"
    }
  ]
}