{
  "id": "130929",
  "forum_id": "13",
  "title": "FS: Lots of Different T and E Cards",
  "author": "chris",
  "reply_count": 3,
  "view_count": 885,
  "created_date": null,
  "last_reply": "20101219T18:17:35-06:00",
  "posts": [
    {
      "post_id": "855996",
      "post_title": "FS: Lots of Different T and E Cards",
      "post_author_name": "chris",
      "post_content": "Hello, I have several items for sale. Feel free to ask any questions, scans are available. Please forward all requests/questions to [url]bucklercards@yahoo.com[/url]. Checks, Money Orders or Paypal Gift are accepted. Shipping is Fast and Free. Thanks, Chris :)\n\n1907 - 09 Novelty Cutlery ART DEVLIN New York SGC EX 5 $700\n\n1910 - 1911 Turkey Red HAL CHASE New York T3 SGC VGEX 4 $725\n\nTY COBB American Caramel 1915 E106 Batting Detroit SGC Auth $1250\n\n1913 T200 Fatima DETROIT TIGERS Team TY COBB SGC VG 3 $900\n\nT206 Piedmont CHRISTY MATHEWSON Portrait NY Natl SGC 4 $900\n\n1916 Tango Eggs BUCK WEAVER Chicago PSA VGEX 4 $800\n\n1913 T200 Fatima PITTSBURGH NATIONALS Wagner SGC 5 $800\n\nT200 Fatima Cleveland Amer. JOE JACKSON Lajoie SGC VG 3 $775\n\n1909 E92 Dockman & Sons CY YOUNG Cleveland PSA VG 3 $775\n\n1909 T204 Ramly CLARK GRIFFITH Reds HOF SGC VG 3 $775\n\n1910 E93 Standard Carmel TY COBB Detroit Tigers SGC Auth Poor $700\n\nT213 Coupon TY COBB Bat Off HOF Detriot Type 2 PSA 1 $660\n\nT200 Fatima Chicago BlackSox Weaver Cicotte NRMT+ SGC 4 $575\n\nEDDIE ED COLLINS 1909 T204 Ramly Phila. A's SGC 1 $575\n\nT200 Fatima Brooklyn Dodgers Stengle Looks NRMT SGC 4 $475\n\n1907 - 09 Novelty Cutlery AL BRIDWELL New York PSA 2 $485\n\nFRANK HOME RUN BAKER Turkey Red 1911 T3 #78 PSA VG 3 $450\n\nTY COBB 1909 - 1911 Colgan's Colgan Chips Tigers SGC 1 $450\n\n1908 E102 CHIEF BENDER White Hat HOF Philadelphia SGC 5 $470\n\n1909 -11 E90 Amer. Caramel NAP LAJOIE Cleveland SGC 3 $415\n\nT206 Sovereign HUGH DUFFY Chicago 460 Subjects PSA 5 $390\n\nT206 Sovereign CHICK GANDIL Chicago 460 Subjects PSA 4 $360\n\n1906 Real Photo Post Card CHICAGO CUBS by Wagner SGC 1 $400\n\n1911 T205 Honest CHRISTY MATHEWSON Giants SGC Good 2 $400\n\n1909 E95 Philadelphia Caramel ED CICOTTE Boston PSA 3 $385\n\n1913 Fatima T200 Pittsburgh Pirates HONUS WAGNER PSA 2 $400\n\nMORDECAI BROWN Philadelphia Caramel 1910 E96 Cubs SGC 2 $390\n\n1913 T200 Fatima Team BOSTON AMERICANS Speaker PSA 2 $300\n\nT206 Piedmont WILLIE KEELER Portrait New York PSA 4 $300\n\nT206 Sweet Caporal CHRISTY MATHEWSON Portrait NY PSA 1 $275\n\n1909-11 E90-1 American Caramel EDDIE PLANK BVG 1 $275\n\nT206 Piedmont MILLER HUGGINS Cincinnati SHARP PSA 5 $270\n\nT200 Fatima Team Card CHICAGO CUBS PSA VG 3 $250\n\nT200 Fatima Team CHICAGO NATIONALS Cubs PSA 2 $225\n\nT3 Turkey Red ROGER BRESNAHAN St. Louis Cardinals Fair $240\n\nGEORGE DAVIS Chicago 1910 T206 Sweet Caporal SGC VGEX 4 $185\n\nNAP LAJOIE National SGC 8 + Polo Grounds Game PSA 5 $180\n\n1909 E254 Colgan's Chips JOE TINKER Chicago Cubs PSA 3 $180\n\n1909 E254 Colgan's Chips EDDIE COLLINS Philadelphia PSA 2.5 $150\n\n1909 E254 Colgan's Chips FRED CLARKE Pittsburg PSA 4 $125\n\nSHAUGHNESSY Roanoke 1909 T206 Piedmont Back VG $160\n\nHUGHIE JENNINGS Portrait T206 Piedmont PSA VG 3 $150\n\nT206 Piedmont JOHNNY EVERS With Bat Chicago Shirt SGC 3 $150\n\nCHIEF BENDER with Trees 1910 T206 Sweet Caporal SGC 2 $95\n\nT206 Sweet Caporal JOE KELLEY Toronto HOF PSA 3 $90\n\nT206 Sweet Caporal ORVAL OVERALL Portrait Chicago PSA 4 $75\n\nT206 Sweet Caporal KID ELBERFELD Fielding VGEX/EX $75\n\nBOBBY WALLACE Portrait 1909 T206 Piedmont PSA 1 $60\n\n1907 Wolverine News Postcard Schaefer and O'Leary VG $120\n\nBUFFALO BILL 2 Card Lot E49 + E50 Caramel Cards SGC 1.5 $130",
      "post_time": "20101217T12:52:54-06:00",
      "timestamp": "1292615574"
    },
    {
      "post_id": "856000",
      "post_title": "",
      "post_author_name": "T206.org",
      "post_content": "Email sent. Scans for all T206 please. [url]trae@t206.org[/url] thanks!",
      "post_time": "20101217T13:01:35-06:00",
      "timestamp": "1292616095"
    },
    {
      "post_id": "856093",
      "post_title": "",
      "post_author_name": "smtjoy",
      "post_content": "Ill take the 1909 E254 Colgan's Chips FRED CLARKE Pittsburg PSA 4 $125\nplus would like to see scans for a few more.  PM sent",
      "post_time": "20101217T18:14:50-06:00",
      "timestamp": "1292634890"
    },
    {
      "post_id": "856509",
      "post_title": "",
      "post_author_name": "chris",
      "post_content": "List updated and emails sent. Thanks :)",
      "post_time": "20101219T18:17:35-06:00",
      "timestamp": "1292807855"
    }
  ]
}