{
  "id": "113468",
  "forum_id": "13",
  "title": "Willing to trade any of my 61 t209-2s for items on my wantlist....",
  "author": "shammus",
  "reply_count": 0,
  "view_count": 249,
  "created_date": null,
  "last_reply": "20090622T18:32:45-06:00",
  "posts": [
    {
      "post_id": "731300",
      "post_title": "Willing to trade any of my 61 t209-2s for items on my wantlist....",
      "post_author_name": "shammus",
      "post_content": "In an effort to make some progress on some sets that I'm a little further along on than this one, I thought I'd offer some of my t209s up for trade for items on my wantlist.  \n\nLots of nice t209s in my list below.  The keys are the B.E. Thompson and Pressley/Pritchard (horizontal pose) which are possibly the two most desireable poses in the set and tougher cards to find as well.  Many of the others are very nice as well as there's very few dogs in this group.  \n\n--------------------------------------------\n\nHere are the items on my wantlist I'd be willing to trade t209s for.  I'll trade generously in many cases, especially for d311s, 1918 Zeenuts or that w590 Spencer -\n\nw590 - Spencer, Ruth\n\nd311s (need 33) - Agnew, Arrelanes, Berry, Burrell, Byram, Castleton, Chadbourne, Christian, Daley, Danzig, Delhi, Delmas, Dillon, Gregory, Harkness, Heister, Holland, Howard, Kuhn, LaLonge, Lewis, Maggert, Mohler, Murray, O’Rourke, Pearce, Ryan, Stamfield, Steen, Tennant, Thompson, Van Buren, Wares\n\nt210 orange borders - need any\n\neunc orange borders (need 18) - Bergen, Bradley, Chase, Criger, Davis, Devlin, Doolan, Gibson, Laporte, Lord, McConnell and Miller....\n\n1911 Zeenuts (need 11) - Bernard, Lindsay, Melchoir, Peckinpaugh, Pfyl, Rapps, Ryan SF, Seaton, Smith SF, Stinson, Weaver\n\n1918 Zeenuts - need any\n\n1919 Zeenuts (need 11) - Lane (oak), Pinelli (sac), Prough (sac), Vance (sac), Spencer (saltlake), Seaton (SF), Smith, Bill (SF), Snell (SF), Arbuckle (Vern), Check (Vern), Meusel (vern)\n\n-------------------------------------------------\n\nt209s I have -\n\nBausewein, Bonner, Boyle, Bourquin, Brandon, Brent, Clemons, Cooper, Cowan, Cross, Dailey, Derron, Dobson, Drumm, Duvie, Ebinger, Eldridge, Farmer, Fairbanks, Ferrell, Flowers, Foltz, Gorham, Hearne, Hobbs, Irvine, Jackson, (GR), Jackson, (SP), Jenkins, Jobson, Johnson, Keating, Kelley, Lathrop, Lavoia, Luyster, Malcolm, Martin, McHugh, McKeavitt, Midkiff, Morgan, Morrissey, Mullany, Ochs, Phealean, Phoenix, Presley/Pritchard, Priest, Rawe, Schmidt, Shaw, Simmons, Spratt, Stouch, Taxis, BE Thompson, Turner, Vail, Williams, Willis\n\n------------------------------------------------\n\nScans are available upon request.  Not looking to sell any of my t209s right now unless I was totally blown away with an offer.  Thanks in advance,\n\nBrian\n[url]redmaccie@hotmail.com[/url]",
      "post_time": "20090622T18:32:45-06:00",
      "timestamp": "1245717165"
    }
  ]
}