{
  "id": "167118",
  "forum_id": "13",
  "title": "Four T206 Broadleaf 350 cards for trade",
  "author": "mike103",
  "reply_count": 2,
  "view_count": 558,
  "created_date": null,
  "last_reply": "20130415T18:17:11-06:00",
  "posts": [
    {
      "post_id": "1117566",
      "post_title": "Four T206 Broadleaf 350 cards for trade",
      "post_author_name": "mike103",
      "post_content": "I have four T206 Broadleaf cards for trade.  Hoffman (St. Louis) SGC 40 , Marshall SGC 30 , McIntyre (Detroit) SGC 30 and Unglaub SGC 30. All four cards are the only Broadleaf examples graded by SGC and the PSA pop report shows no graded examples of these card’s.\nThese would be a nice addition for someone trying to put together a player back run or a T206 master set. I would like to keep one for my collection and trade three for a larger lot of low grade raw T206’s. I would also consider trading for major HOF’ers or rare cards (Cobb, Young , Demmitt , O’hara etc.) I am trying (and failing) to put together a low grade set so cards with some creasing, back damage and rounded corners are fine with me. PM or e-mail your offers or for scans.  Hopefully we can work out a trade.\nMike",
      "post_time": "20130414T12:55:35-06:00",
      "timestamp": "1365965735"
    },
    {
      "post_id": "1117616",
      "post_title": "",
      "post_author_name": "atx840",
      "post_content": "[quote name=\"mike103\" post=1117566]Hoffman (St. Louis) SGC 40[/QUOTE]\n\nSo close :(\n\nGood luck.",
      "post_time": "20130414T15:31:19-06:00",
      "timestamp": "1365975079"
    },
    {
      "post_id": "1118149",
      "post_title": "",
      "post_author_name": "mike103",
      "post_content": "I would like to apologize to all those that sent pm’s and emails that I haven’t responded to. I was swamped with messages and was not expecting that big of a response. I have some offers that I am considering and will update as things chance. Again sorry to all those I haven’t responded to.\nMike",
      "post_time": "20130415T18:17:11-06:00",
      "timestamp": "1366071431"
    }
  ]
}