{
  "id": "97412",
  "forum_id": "13",
  "title": "Update with group price for the 22 t222s .....heavy discount!!",
  "author": "Archive",
  "reply_count": 1,
  "view_count": 292,
  "created_date": null,
  "last_reply": "20080309T10:57:00-06:00",
  "posts": [
    {
      "post_id": "680808",
      "post_title": "Update with group price for the 22 t222s .....heavy discount!!",
      "post_author_name": "Archive",
      "post_content": "Posted By: Brian McQueen\nHere is a great group of t222s that I'll offer up on a first come, first served basis.  Prices below include shipping.  All are very nice, no beaters here. There are very few cards with significant creasing in this group.  Many only have a mild bend/wrinkle or two.  In addition, there is very little wear or damage on any of the cards. Scans of any of these are available upon request.\n\nI'll also offer discounts for those wanting a few of the cards or the entire group - this would make a nice lot to start a set with if anyone was interested in the entire lot.   Anyone who'd be interested in acquiring this entire group would be just about halfway done with this very difficult set right from the start.\n\nThanks in advance,\nBrian\nredmaccie@hotmail.com \n\n\nt222 Jimmy Austin  (HIGH NUMBER)   Good - toned/faint wrinkling --- $275\nt222 Jack Barry GD - (tiny chip upper right corner); no creases --- $135\nt222 Boardwalk Brown G/VG - small bends --- $160\nt222 George Burns GD - tiny bends in card --- $135\nt222 Bullet Joe Bush VG - a couple faint bends....very nice --- $180\nt222 Al Demaree     G/VG - no significant bends...mild residue on front --- $160\nt222 Art Fletcher VG - a couple very tiny bends --- $180\nt222 Byron Houck VG - measures short but no significant bending --- $85\nt222 Jack Lapp VG - one smaller bend --- $180\nt222 Tommy Leach FR/GD - a couple bends --- SOLD\nt222 Fritz Maisel GD/VG - a couple very small bends --- $160\nt222 Rube Marquard FR - chip upper right corner, a few bends --- $185\nt222 Stuffy McInnis FR/GD - a few bends --- $120\nt222 Red Murray G/VG - a few small bends --- $160\nt222 Rube Oldring G/VG - sharp looking card...one bend at bottom --- $160\nt222 Hub Perdue GD - a few small bends --- $135\nt222 Art Phelan GD - a couple medium-sized bends --- $135\nt222 Wally Schang G/VG - a few small bends --- $160\nt222 Amos Strunk VG - a couple very tiny bends --- $180\nt222 Bill Sweeney G/VG - a couple bends --- $160\nt222 Lefty Tyler VG - a couple very tiny bends --- $180\nt222 Ossie Vitt GD - a few smaller bends --- $135\nt222 Heinie Zimmerman GD - a few bends on card --- $135",
      "post_time": "20080307T21:43:00-06:00",
      "timestamp": "1204951380"
    },
    {
      "post_id": "680809",
      "post_title": "Update with group price for the 22 t222s .....heavy discount!!",
      "post_author_name": "Archive",
      "post_content": "Posted By: Brian McQueen\n\nSo far, the Leach has been sold with the other cards still remaining.  I've been asked a couple times about a group price for everything.  Minus the Leach, the listed individual prices for the remaining 22 cards totals $3495.  If someone were to want the entire group I would knock an additional $500 off the group and sell it for an even $3000 delivered.  \n\nIt's a pretty big discount in my opinion but it does save me the trouble of selling and shipping the 22 cards individually.  Also, I have large numbers of e98s and zeenuts coming in, so I need to make some room [IMG]https://www.net54baseball.com/images/happy.gif[/IMG]\n\nThanks guys,\nBrian\nredmaccie@hotmail.com",
      "post_time": "20080309T10:57:00-06:00",
      "timestamp": "1205081820"
    }
  ]
}