{
  "id": "114260",
  "forum_id": "13",
  "title": "WTT: HUGE tradelist of T205, T206, T207 & E90-1",
  "author": "marcdelpercio",
  "reply_count": 9,
  "view_count": 2286,
  "created_date": null,
  "last_reply": "20090815T10:43:33-06:00",
  "posts": [
    {
      "post_id": "737141",
      "post_title": "WTT: HUGE tradelist of T205, T206, T207 & E90-1",
      "post_author_name": "marcdelpercio",
      "post_content": "Hello.  I have the following T205's, T206's, T207's, e95's and e90-1's available for trade.  I am especially looking for lower grade T207's and/or E90-1's in trade but will consider trades for any pre-war cards I need in ANY condition.  Other sets I am working on include T201, T202, T204, E93, E94, E95, E96, E98 and several others.  Please e-mail with any tradelists or offers, no matter how large or small.  I appreciate offers to buy cards but I am primarily interested in trading at the moment.  Scans are available of any cards upon request.  \n\n\nGRADED T206:\n\nBAKER HOF - SGC 10 - Polar Bear - multiple heavy creases\nBeaumont - SGC A - Piedmont - pen mark on uniform\nCHANCE HOF (yellow portrait) - PSA 2 (MK) -SC- light pencil mark and staining on front\nCharles - GAI 1.5 - SC - light pencil marks\nDougherty (portrait) - GAI 1 - SC - paper loss on front and back\nHunter - GAI 1 - Piedmont - light creasing\nF. Jones (hands at hips) - SGC 10 - heavy crease and spot of paper loss on back\nLake (no ball in hand) - PSA 1(MK) -SC- pencil mark on front \nMARQUARD HOF (portrait) - SGC 10 -Piedmont-  creasing and badly rounded corners\nMARQUARD HOF (portrait) - SGC 30 -Piedmont- light wrinkle, very nice looking card\nMcGann - SGC 10 - Piedmont - heavy creasing\nMoran - SGC 20 - Piedmont - light ink stamp on back\nMullin (throwing) - SGC A - Piedmont - creasing and trimmed corner\nOakes - SGC 10 - Piedmont - light pencil mark and paper loss on back\nO'Leary (hands on knees) - SGC 10 - Piedmont - couple of creases, nice looking overall\nOverall (portrait) - SGC 10 -Sovereign - creasing and rounded corners\nPfeffer - SGC 10 - Piedmont - couple of small nicks of paper loss\nPfeister (seated) - PSA 1 - crease and rounded corners\nSheckard (glove showing) - SGC 10 - Piedmont - creases and a spot of paper loss \nFrank Smith (F. Smith on front) - SGC 20 -SC- very undergraded, nice looking card\nStrang - SGC 10 - Piedmont - complete beater, multiple creases\nWeimer - SCD A - SC - creases and writing/ink stamp on back\n\nRAW T206:\n\nAbstein - p- paper loss and glue residue on back\nAmes (portrait) -p/f- nick of paper loss on front and back\nAmes (hands above head) - p (badly rounded bottom corner)\nAnderson - p/f (light creases and staining) \nArndt - p (multiple creases)\nAtz - p - multiple creases and a tear in the upper corner\nBall (Cleveland) - Polar Bear - p/f - rounded corners and creasing\nBarbeau - g/vg - Tolstoi - tiny speck of paper loss on sleeve\nJ. Barry - Polar Bear - p - creases and missing lower right corner\nS. Barry - f/g - miscut, name partially missing from bottom\nBates - p - nice front, paper loss and glue residue on back\nBecker - p - major paper loss on front\nBENDER (with trees) HOF - p - border is badly trimmed\nBENDER (with trees) HOF - p - paper loss on back and front edges\nBradley (Batting) - American Beauty 460 - p - multiple heavy creases\nBliss - Cycle 350 -p (major creasing, damage and paper loss) \nBliss - vg - light wrinkle on lower edge, nice looking card\nBowerman - vg - glue residue on back, nice looking card\nBowerman - p - spots of paper loss on front\nBradley (portrait) - Old Mill - p - paper loss on back and rough corner\nBridwell (portrait, no cap) g/vg - light horizontal wrinkle, nice looking card\nBurch (batting) -p- total beater, major paper loss and damage\nByrne - g/vg - tiny nick of paper damage on bottom edge, very nice overall\nCamnitz (arms folded) -p- total beater, major creasing\nCarrigan - vg+ - light corner wrinkle, very nice looking card\nChase (white cap) - p - major paper loss and damage\nChase (pink portrait) -p- paper loss on back and glue residue on front and back\nChase (pink portrait) -p- multiple creases\nCHESBRO HOF -p- missing lower left corner and paper loss on back\nJ.J. Clarke -f/g- heavy corner crease and some staining on back\nCriger -f/g- light paper loss on back and some staining/glue residue\nDahlen (Brooklyn) -p- spot of paper loss/damage on front, very sharp otherwise\nDavidson -f- corner wear and one corner crease\nH. Davis (H. Davis on front) -p- heavy creasing and pinhole\nDevlin -p- multiple creases\nDonlin (batting) -f/g- Polar Bear- light damage on 2 corners, very nice looking otherwise\nDooin -p- heavy creasing and rounded corners\nDoolan (fielding) -p- scuffing on front and major paper loss on back \nDoolan (batting) -p- missing bottom left corner and many creases\nDoolin (portrait) -p- scuffing around edges and paper loss on back\nDougherty (portrait) -p- missing piece of lower right corner\nDougherty (fielding) -p- multiple heavy creases and dirt\nDowney (fielding)  -p- scuffing on front and paper loss on back\nJoe Doyle (hands above head) -f- Polar Bear - some creases and tobacco staining\nLarry Doyle (batting) - g/vg- small spot of paper loss on back bottom, very nice looking otherwise\nDUFFY - HOF Polar Bear -p- missing lower right corner\nFerguson  -p/f- multiple light creases and red line drawn on back\nFerris -p- edge wear on front and paper loss on back\nGanzel -p- scuffing on front and some paper loss on back\nGasper -p- scuffing on front and paper loss on back\nGraham -p- edge wear on front and major paper loss on back\nGraham -f/g- small nick of paper loss on front and rounded corners\nHerzog (New York) -p- total beater, major damage and paper loss\nHerzog (New York) -p- multiple creases\nHoffman (St. Louis)  -f- multiple light creases\nHofman (Chicago) -p- scuffing on front and major paper loss on back\nHofman (Chicago) -p- edge damage on front and major paper loss on back\nHofman (Chicago) -p- multiple heavy creases\nHoward (Chicago) -p- beater, missing corner, paper loss, pinhole and writing on back\nHUGGINS (portrait) HOF -p- scuffing on front and paper loss on back\nHulswitt -p/f- edge wear and discoloration on back\nJOHNSON (portrait) HOF -p- scuffing on front and paper loss on back\nJordan (portrait) -f/g- one light crease and very light registration on back\nKarger -f/g- light paper damage on back\nKEELER (with bat) HOF -f- light scuffing on front and some glue residue on back\nKling -p- scuffing on front and paper loss on back\nKruger -p- scuffing on front and paper loss on back\nLeach -p- Polar Bear - missing piece of top right corner\nLennox -g/vg- light vertical crease and light corner wear, very nice looking\nMaloney -p- scuffing on front and paper loss on back\nMARQUARD (hands at thighs) - HOF p/f - multiple creases and light pencil mark on back\nMARQUARD (hands at thighs) - HOF- p- scuffing and staining on front, paper loss/stains on back\nMARQUARD (portrait) HOF -p- scuffing on front and paper loss on back\nMATHEWSON (portrait) HOF -p- spots of paper damage in front center and tape residue on front\nMattern -f/g- paper wrinkles on front and some glue residue on edge\nMcBride -f- light creases and rounded corners\nMcIntyre (Brooklyn) -p- multiple creases\nMcQuillan (with bat) -p- trimmed bottom edge and writing on back, nice front\nMcQuillan (ball in hand) -p- beater, major damage, missing corner\nMerritt -p- scuffing on front and paper loss on back\nMilligan -p- scuffing on front and paper loss on back\nO'Hara (New York) -p/f- light creasing and residue on back\nO'Hara (New York) -p- scuffing on front and paper loss on back\nO'Hara (New York) -p- scuffing on front and paper loss on back\nO'Leary (portrait) -p- ORANGE BACKGROUND - scorched top edge and one corner clipped\nO'Leary (portrait) -p/f- light scuffing on front and discoloration on back\nO'Leary (portrait) -f- edge wear and some discoloration/residue on back\nPattee -p- scuffing on front and paper loss on back \nPERSONS -Old Mill- SL -p- staining around border and writing on back\nPfeister (seated) -p- scuffing on front and paper loss on back\nPickering -p- scuffing on front and paper loss on back\nRandall - p/f (ink spots on back) - $10\nRandall -p- major paper loss on front bottom\nRaymond -p- corner damage and edge wear\nReulbach (glove shows) -p- edge damage on front and paper damage on back\nREVELLE - Old Mill SL -p/f-  narrow lines of paper loss on front \nRhoades (hands at chest) -Cycle 350- p - creases and paper loss on back\nRitchey (\"dove\" on front) -f/g- light scuffing on front \nSchlei (catching) -p- beater, missing lower right corner, paper loss on back\nSeymour (batting) wavy top edge, maybe trimmed but vg otherwise\nSeymour (batting) Sovereign -f- multiple light creases\nShaw (St. Louis) -p- scuffing on front and paper loss on back\nF. Smith (Chicago & Boston) -p/f- some moderate creasing, tough card\nHappy Smith -p- multiple heavy creases\nSpencer -p- scuffing on front and paper loss on back\nStanage - Polar Bear -p- two heavy creases\nStarr -f- creasing and some residue\nStone -p- scuffing on front and paper loss on back\nSweeney (Boston) - p - two rough edges\nSweeney (Boston) - p - beater, major damage and paper loss\nTHEBO - Old Mill - SL -p- scuffing on front and paper loss on back\nTitus -p- beater, major damage, corner missing, paper loss\nWALSH -p/f- HOF - multiple creases\nWilhelm (hands at chest) - p- scuffing on front and paper loss on back\nWilhelm (hands at chest  - p - scuffing on front and paper loss on back\nWilhelm (batting) - g/vg - light corner crease, very nice looking otherwise\nWILLIS (batting) HOF -p- Polar Bear - multiple heavy creases\nCY YOUNG (portrait) -f- light scuffing on front and residue on back \n\n\nGRADED T205:\n\nAustin - GAI 1 - Sovereign - pinhole near top border but nice looking overall\nAbbaticchio - SGC 10 - Polar Bear - some heavy creases and edge wear\nBall - PSA 2 - Polar Bear - heavy corner crease but very nice otherwise\nBarger (full B) - GAI 1.5 - some light creases\nBeck - SGC 10 - Polar Bear - some creasing and a nick of paper loss on front top\nBecker - SGC 20 - one heavy crease and some light ones\nBell - GAI 1.5 - some light creasing and edge wear\nBRESNAHAN (closed mouth) HOF - Polar Bear - PSA 1 - some heavy creasing\nBridwell - Polar Bear - SGC 10 - rounded corners, creases \nCLARKE - HOF - SGC 10 - multiple creases, yellow borders\nCrandall (\"t\" crossed) - SGC 10 - Polar Bear - heavy creases and edge wear\nDevore - SGC 10 - light creases and rounded corners\nDougherty (red sock) - SGC 10 - corner creases, undergraded...looks nice\nDowney - SGC 10 - Cycle - multiple light creases and rounded corners\nDygert - SGC 30 - one diagonal crease, looks very nice overall\nFoxen - SGC 10 - Piedmont 42 - light corner creases and edge wear \nFoxen - PSA 2 - heavy crease near right edge\nGardner - SGC 10 - ex-mt front, spots of paper loss on back\nHerzog - SGC 10 - creasing and pen mark on back\nKonetchy - SGC 20 - tiny nick of paper loss on front bottom border, ex-mt otherwise\nKrause - PSA 2 - light corner creases, undergraded\nLatham ( A. Latham on back) SGC 10 - beautiful front but paste residue on back\nLush - SGC 40 - light corner wear, beautiful card \nMaddox - Sovereign - SGC 10 - Sovereign - multiple creases, beater\nMATHEWSON - SGC 10 -  large spot of paper loss on front center\nMcElveen - SGC 20 - light wrinkles and pen mark on back\nMcGRAW - SGC 10 - Sovereign - multiple light creases and wrinkles\nMeyers - PSA 3 - beautiful front, several tiny dots of paper loss on back\nNeedham - SGC 20 - corner wear and light pencil mark on back\nOlmstead - SGC 20 - light wrinkles, undergraded\nPfeister - SGC 30 - light edge and corner wear, nice looking\nPhillippe - Polar Bear - SGC 30 - two light creases\nReulbach - PSA 2 - light wrinkles, looks very nice overall\nRichie - SGC 20 - very nice front, small dot of paper loss on back\nSharpe - SGC 10 - nice front, spot of paper loss on back\nSmith - SGC 10 - multiple creases\nTitus - SGC 10 - small nick of paper loss on front center\nWALLACE (no cap, 2 lines of stats) - SGC A - major damage and creasing, true beater\nWHEAT - SGC 30 - HOF - light corner wear and some dirt/staining\n\n\nRAW T205:\n\nBergen f/g - Polar Bear - tiny dots of paper loss and light wrinkle\nBROWN - Cycle - HOF - g/vg - light crease and a couple of light wrinkles\nChase (frame ends at shoulders) - vg+  light edge wear and one tiny wrinkle\nCrandall (“t” crossed) - Sovereign -p- total beater,\nEvans - vg - nick of paper loss on top right corner\nEVERS -vg/ex - Polar Bear - very light corner wrinkle and tobacco dots on back, beautiful card\nFletcher -f/g- very nice front, small spot of paper loss on back top border and light wrinkle\nFoxen -g- couple of light creases and some light edge wear\nGray (no stats on back) -g- minor spot of paper loss on top front border \nHauser - g - one horizontal crease and some light edge wear\nHerzog - g/vg- light wrinkles, nice looking card\nHummel - vg+ - light corner wear, very nice looking\nKling - g/vg - corner wear and light indentation on left edge\nKonetchy - vg+ - light edge and corner wear\nKroh - p - heavy creasing and paper loss\nKroh - f/g - Polar Bear - oversized borders, tobacco staining on back\nLush - vg/ex - tiny light wrinkle and very light corner wear\nMattern - p - major damage and paper loss\nMcIntire - ex/mt - very light corner wear, gorgeous card\nMerkle - f - Polar Bear - small ding and creases on right border\nMeyers - f/g - horizontal crease and edge wear\nMurray - p/f - Polar Bear - multiple light creases and small dots of paper loss\nOakes - g - Polar Bear - light wrinkles and edge wear\nPhelps - f - Polar Bear - heavy corner crease and some corner wear\nRucker - f - Polar Bear - miscut, oversized, light creases and dot of paper loss\nScanlan - Polar Bear - g - tiny dot of paper loss on front edge and light corner wear\nSchlei - Polar Bear - top edge is miscut or trimmed, looks vg/ex otherwise\nSharpe - Polar Bear - p - light creasing and multiple dots of paper loss on front\nShean ( Boston) - p/f - corner crease and dot of paper loss on front center\nSnodgrass - p - top edge trimmed, light creasing and corner wear\nWiltse (both ears show) - vg+ - light horizontal wrinkle and light corner wear\n\nRAW T207's:\n\nBecker -vg- light corner and edge wear\nCole - wavy top edge (maybe trimmed) and horizontal crease, otherwise very nice looking\nDoyle - f - horizontal crease and some residue/staining on back\nErwin - p - corner creasing and dirt on back, front image is very nice\nHamilton - f - light wrinkles and tiny dots of paper loss\nLatham - p - creases and a couple of spots of paper loss\nMcBride - p/f - small razor slash on left edge, nice looking otherwise\nOtto Miller - p - BROADLEAF - multiple creases and edge wear, TOUGH card\nO'Toole - p - multiple creases and a pencil marking\nSmith - p/f - couple of creases and small dots of paper damage\nSteinfeldt - p - creasing, rounded corners and dirty/stained back\nWilie - looks ex, borders look narrow but card measures okay\n\nGRADED T207's:\n\nHerzog - BROADLEAF - SGC 30 - one light wrinkle, looks nice - TOUGH card\nMullin (\"D\" shows on cap) - SGC 10 - heavy spots of scuffing on front\n\n\nE90-1's:\n\nBailey - p - multiple creases and edge/corner wear\nBuster Brown - p - multiple creases and nick missing from card on right edge\nDonlin - p - total beater, card torn in half horizontally and multiple creases\nDygert - p - total beater, card taped together and multiple creases and damage\nJ. Sweeney - SGC 10 - multiple light creases and some dirt on back\n\n\nE95's:\n\nKrause - p - missing lower left corner and some creases\nLeach - p - clipped corners and small spots of paper loss on back",
      "post_time": "20090719T23:00:05-06:00",
      "timestamp": "1248066005"
    },
    {
      "post_id": "737150",
      "post_title": "T205",
      "post_author_name": "Tcards-Please",
      "post_content": "Email sent.\n\nr/\nFrank",
      "post_time": "20090720T05:49:31-06:00",
      "timestamp": "1248090571"
    },
    {
      "post_id": "737178",
      "post_title": "Thebo Sl",
      "post_author_name": "D. Broughman",
      "post_content": "Please send scan of Thebo Sl. Thanks! D.         \n[url]broughman@concast.net[/url]",
      "post_time": "20090720T09:43:58-06:00",
      "timestamp": "1248104638"
    },
    {
      "post_id": "737255",
      "post_title": "",
      "post_author_name": "marcdelpercio",
      "post_content": "D. Broughman,\nHello and thanks for your reply.  I am having trouble with your e-mail address.  I'm guessing it is supposed to be \"comcast.net\" rather than \"concast.net\"  Please let me know for sure and I will send you the scans you requested right away.  Thanks again!\n\nMarc",
      "post_time": "20090720T16:49:16-06:00",
      "timestamp": "1248130156"
    },
    {
      "post_id": "737260",
      "post_title": "Yes",
      "post_author_name": "D. Broughman",
      "post_content": "Sorry!\n[url]broughman@comcast.net[/url]",
      "post_time": "20090720T16:55:27-06:00",
      "timestamp": "1248130527"
    },
    {
      "post_id": "737333",
      "post_title": "",
      "post_author_name": "Pup6913",
      "post_content": "email sent",
      "post_time": "20090720T20:31:41-06:00",
      "timestamp": "1248143501"
    },
    {
      "post_id": "737350",
      "post_title": "Marc, can you tell me what the light ink stamp is",
      "post_author_name": "Howe’s Hunter",
      "post_content": "on the T206 Moran SGC 20 with a Piedmont back? Thanks. [url]edmccollum@cox.net[/url]",
      "post_time": "20090720T21:35:22-06:00",
      "timestamp": "1248147322"
    },
    {
      "post_id": "742293",
      "post_title": "still looking to trade - many new cards added",
      "post_author_name": "marcdelpercio",
      "post_content": "Just a friendly bump.  Thanks to everybody who has responded and especially to those that I've traded with.  I am still actively looking to trade.  I have added many new cards to my list including a nice looking and VERY tough SGC 30 Broadleaf T207 Herzog, a T206 F. Smith (Chicago & Boston) and a couple of E95's.  Please e-mail me with any trade offers, no matter how large or small.  Thanks again!",
      "post_time": "20090813T22:15:07-06:00",
      "timestamp": "1250223307"
    },
    {
      "post_id": "742438",
      "post_title": "",
      "post_author_name": "toppcat",
      "post_content": "marc:\n\nCan I please see scans of T206 Marquard Portrait SGC 30 and T206 Smith (F.Smith on front) SGC 20?  Thanks, Dave\n\n[url]dsh46@aol.com[/url]",
      "post_time": "20090814T16:30:24-06:00",
      "timestamp": "1250289024"
    },
    {
      "post_id": "742582",
      "post_title": "scans sent",
      "post_author_name": "marcdelpercio",
      "post_content": "Hi Dave,\nThanks for the reply.  Scans sent.\n\nMarc",
      "post_time": "20090815T10:43:33-06:00",
      "timestamp": "1250354613"
    }
  ]
}