{
  "id": "161864",
  "forum_id": "13",
  "title": "signed T206",
  "author": "theshleps",
  "reply_count": 3,
  "view_count": 425,
  "created_date": null,
  "last_reply": "20130120T18:26:39-06:00",
  "posts": [
    {
      "post_id": "1076265",
      "post_title": "signed T206",
      "post_author_name": "theshleps",
      "post_content": "Some of us are listing signed T206s of common guys for $3000+ on ebay. While there might be a rich guy or two that will actually buy these, I am afraid we are setting a new price for these and those of us that collect them (including the people listing them) will be priced out in the future.\nIt is just weird as in 2012 when these would come up they were a few hundred dollars mostly.\nIs the supply of signed pre war and even pre WWII drying up that much? Are there more collectors out there?\nAny opinions",
      "post_time": "20130120T14:27:00-06:00",
      "timestamp": "1358717220"
    },
    {
      "post_id": "1076266",
      "post_title": "",
      "post_author_name": "HRBAKER",
      "post_content": "You can ask anything you want.  Ebay listing prices on a lot of things bear little resemblance to what most will bring.  Listing and selling are two different things.  Maybe they don't really want to sell them but if someone will pay their price they'll let them go.  I wouldn't worry about listing prices altering the market.\n\nI have this one and the likely real selling price is less than what it is worth to me to have, hence I keep it.\n\n[IMG]http://i152.photobucket.com/albums/s172/hrbaker/AUTOS/automarq.jpg[/IMG]",
      "post_time": "20130120T14:33:13-06:00",
      "timestamp": "1358717593"
    },
    {
      "post_id": "1076330",
      "post_title": "I'm one of those....",
      "post_author_name": "cozmokramer",
      "post_content": "I am one of those that have listed lately.  Out of the 14 signed T206 cards I obtained, 4 were doubles and thus I listed them... yes at high prices.\n\nAsking $3k plus just to see if there was any interest... and 2 of them sold at over $2k each.\n\nI believe once someone else saw that someone was buying at certain prices, they decided to sell a doubles of theirs as well, at a high price.",
      "post_time": "20130120T18:06:32-06:00",
      "timestamp": "1358730392"
    },
    {
      "post_id": "1076335",
      "post_title": "signed T206",
      "post_author_name": "theshleps",
      "post_content": "It is amazing folks paid that much. Congrats. I may have to let go of some of mine someday. Might be tough to purchase more, especially the tougher guys",
      "post_time": "20130120T18:26:39-06:00",
      "timestamp": "1358731599"
    }
  ]
}