{
  "id": "134311",
  "forum_id": "13",
  "title": "Trading P2's?",
  "author": "obcmac",
  "reply_count": 0,
  "view_count": 271,
  "created_date": null,
  "last_reply": "20110312T13:36:48-06:00",
  "posts": [
    {
      "post_id": "877895",
      "post_title": "Trading P2's?",
      "post_author_name": "obcmac",
      "post_content": "I have the following P2's to trade:\nJennings (small) PSA 6\nChance (Large) PSA6\nDuffy (small) PSA 7\nParent PSA 4\n\nLooking for the following (in any grade)...let me know if you have any to trade.\n\n\n1910-1912 Sweet Caporal Pins (P2's)\nAbbatichio 1, Archer SL 3, Baker 7, Barry 10, Beebe 13, Bell SL 14, Bell LL, Bergen 18, Bescher 19, Birmingham 20, Bransfield 1, Bresnahan Closed LL 3,\nBridwell 5, Callahan 9, Camnitz 10 sl, Camnitz LL 11, Carrigan LL 13,\nCobb no D 2, Collins SL 3, Collins LL 4, Crandall 5, Cree 6, \nDahlen 7, Devlin 9, Donovan 11, Doolan LL 15, Downey SL 17, Downey LL 18,\nDoyle LL 20, Duffy LL 3, Dygert 4, Engle SL 7,\nEngle LL 8, Erwin 9, Evans 10, Ferguson 12, Flynn 13, Ford LL 15, \nGibson LL 19, Grant 20, Griffith LL 3, Harmon 5, Hartsel 6, Hauser 7,\nHerzog SL 9, Herzog LL 10,Hoblitzell 11 Hoffman 12, Hooper 13,  \nHuggins LL 15, Jennings LL 18, Johnson LL 20, Karger 2,\nKnight SL 4, Knight LL 5, Kroh 8, Laporte LL 11, Latham 12, Lord LL 19, \nLivingston 20, Maddox 1, Mathewson SL 4, Mathewson LL 5, McGraw LL 10,\nMcIntyre (WS) LL 13, McLean LL 15, Meyers 17, Milan 18, Miller 19, Mitchell ,\nMullen LL 3, Murray SL 6, Murray LL 7, Needham 8, \nOakes LL 10, O'leary 12, Overall 13, Paskert SL 15, Paskert LL 16, Pelty 17,\nPfeister 18, Phelps 19, Quinn 1, Reulbach 2, Rucker SL 5, Rucker LL 6, Scanlon, \nScheckard 9, Schmidt SL 10, Schmidt LL 11, Smith 13, Speaker SL 14, Speaker LL, Stanage, Steinfelt, Stone, Stoval SL 19, \nStreet SL 1, Street LL, Thomas SL, Thomas LL 5, Tinker SL 6, Tinker LL 7, Wagner 11, Wallace no cap, Walsh, Warhop 16, Wheat SL 17, Wheat LL 18, White 19, Wilson (pirates) 1, Wiltse 2, \n\nThanks,\n\nMac",
      "post_time": "20110312T13:36:48-06:00",
      "timestamp": "1299962208"
    }
  ]
}