{
  "id": "120423",
  "forum_id": "13",
  "title": "F/S T206 Cubs subset (new plan sale)",
  "author": "Tao_Moko",
  "reply_count": 3,
  "view_count": 474,
  "created_date": null,
  "last_reply": "20100224T19:25:00-06:00",
  "posts": [
    {
      "post_id": "780173",
      "post_title": "F/S T206 Cubs subset (new plan sale)",
      "post_author_name": "Tao_Moko",
      "post_content": "*******SOLD*********\nI have 45 and at least one of every front with the exception of the Evers/Cubs(blue background) because I can't find it.  There are duplicates with different backs and several with tougher backs (Sov460, Cycle460, AB460, Tolstoi30).  Grades range from pr to vg-ex.  I collect raw but there are a few graded.\n\nI want to sell this as a whole and will not parse out.  That's right, you get the Pfeister with creases whether you want it or not.  Reason for selling is I came back from Afghanistan with a new plan and spending a bunch of money on cards wasn't it.  I've just found myself after four years of being home sliding back into the groove of wastefulness.  Time for me to focus on what matters. \n\nEmail at [url]h8ful21@yahoo.com[/url] if you're interested in buying all.  I'm selling at my cost ($2300) which is either a good deal for you or not.  Will email scans at your request.\n\nSemper Fi\n\nEric",
      "post_time": "20100204T19:44:15-06:00",
      "timestamp": "1265337855"
    },
    {
      "post_id": "780209",
      "post_title": "Welcome home",
      "post_author_name": "scottglevy",
      "post_content": "Thanks for your service and welcome back home.  Good luck with your sale.\n\n-Scott",
      "post_time": "20100204T21:11:08-06:00",
      "timestamp": "1265343068"
    },
    {
      "post_id": "780234",
      "post_title": "Email sent",
      "post_author_name": "Comiskey",
      "post_content": "Email sent",
      "post_time": "20100204T23:07:35-06:00",
      "timestamp": "1265350055"
    },
    {
      "post_id": "785410",
      "post_title": "Sold",
      "post_author_name": "Tao_Moko",
      "post_content": "Thanks to everyone for the kind words.  It was hard to let them and all of my others go over the past several months but there is good to be done and the cards will fund it.\n\nThe buyer wants me to source the Evers (blue background) and Chance (batting) for him as part of the deal.  I'll be looking for those so let me know if you have them for sale.  Approximately $350 for the pair.",
      "post_time": "20100224T19:25:00-06:00",
      "timestamp": "1267064700"
    }
  ]
}