{
  "id": "114748",
  "forum_id": "13",
  "title": "Wanted: T210s",
  "author": "John V",
  "reply_count": 3,
  "view_count": 246,
  "created_date": null,
  "last_reply": "20090905T08:49:48-06:00",
  "posts": [
    {
      "post_id": "740423",
      "post_title": "Wanted: T210s",
      "post_author_name": "John V",
      "post_content": "Since my small-scale jump back into this hobby, after a 25 year hiatus, I've had a ball reading your posts and working on my collections.\n \nAs some of you may know, since I live and work in the Columbia area, I have a particular interest in Series 1 - T210 Columbia players.\n\nPlease check your shoeboxes, vaults or whatever for any of the Columbia cards you would be willing to part with. I'm short the Dwyer, Massing and Wohlleben cards, and have some beaters that could stand to be upgraded.\n\nBy the way, I've completed my microfilm review of \"The State\" newspapers from the 1910 season. (My eyes are regaining focus and uncrossing!)  My goal was to locate names, hometowns, positions and other minor details. Send me an email if you'd like to see my research. \n\nThanks, John",
      "post_time": "20090806T12:36:10-06:00",
      "timestamp": "1249583770"
    },
    {
      "post_id": "740446",
      "post_title": "I appreciate your research",
      "post_author_name": "Potomac Yank",
      "post_content": "Hello John,\nAs a T210 set collector, I appreciate your research.\n\nI looked through my T210 dupes, but unfortunately, I couldn't find any series 1 Columbia's to trade.\nI wish you luck in your Quest.\nI'm sure others in the community will come through.\nI will send you an e-mail for your research information ...  Thank you.\n\nJoe Pelaez",
      "post_time": "20090806T14:29:51-06:00",
      "timestamp": "1249590591"
    },
    {
      "post_id": "747917",
      "post_title": "",
      "post_author_name": "t210scouts",
      "post_content": "email sent. Have one Columbia card.",
      "post_time": "20090905T08:35:52-06:00",
      "timestamp": "1252161352"
    },
    {
      "post_id": "747919",
      "post_title": "Re: Wanted T210s",
      "post_author_name": "rebelsart",
      "post_content": "Hi,\nDavid Levin (gfg.com) recently picked up a collection of the T210 cards and currently has two of the series 1 Columbia players - Jones and Collins.  Here is a link to the web site along with scans:\n\n[url]http://gfg.com/baseball/t210.shtml[/url]\n\nGood luck with your collecting.\nArt M.",
      "post_time": "20090905T08:49:48-06:00",
      "timestamp": "1252162188"
    }
  ]
}