{
  "id": "314161",
  "forum_id": "13",
  "title": "FS: My non-sports tobacco card binder - 300+ cards *sold*",
  "author": "53toppscollector",
  "reply_count": 2,
  "view_count": 405,
  "created_date": null,
  "last_reply": "20220201T16:48:44-06:00",
  "posts": [
    {
      "post_id": "2189680",
      "post_title": "FS: My non-sports tobacco card binder - 300+ cards *sold*",
      "post_author_name": "53toppscollector",
      "post_content": "So this one hurts a bit, but it needs to be done. I am hyper focusing my collecting right now, slimming down to just my T206 collection, and soon a T205 collection. I need to make room and raise some funds. \n\nWhat I am selling here is probably a bit unique for this board, but I figured it was worth a shot before I try and sell it on ebay. I am selling my entire non-sports tobacco collection, including the beautiful binder the cards are currently stored in. Here is a summary of everything included in this lot:\n\n1910 - T30 - Arctic Scenes - 28 Total Cards\n\n28 cards total, including a full basic 25 card set with 3 duplicates. Each card comes with 2 different Hassan backs (Fac 30, Fac 649), so a master set is 50 cards. I'm more than halfway there. Cards range in condition from poor to VG/VG+. \n\n1911 - T77 - Lighthouses - 34 Total Cards\n\n34 cards total here, a basic set is 50 cards, and a master set is 100 cards, as each card comes with either a Fac 30 or Fac 649 Hassan back. According to my spreadsheet, I have both backs for 6 cards, which means there are 28 unique cards out of 50. Condition ranges from PR to VG\n\n1910 - T118 - World's Explorers - 4 cards\n\nI have 4 cards from the T118 set: Stanley, DeLong, Hedin, and Henry Hudson. Condition is GD to VG.\n\n1909 - T29 - Animals - 47 total cards\n\nThe T29 set is broken down into 2 40 card sets, one set has an advertisement on the back, another set has a short description of the animal. According to my sheet, all 47 of my combos are unique in terms of the front/back/factory number. \n\n1910 - T48 - Butterflies - 49 total cards\n\nI collected 49 of the 50 cards in the set. Each card has a Turkey Red back. Most of the backs contain pencil writing that says \"Norton\" in poor writing, which I assume is the person who owned the collection. I picked up a large lot with the same writing on most of the backs, and then collected a few others as I almost completed the full set of 50. The only card I am missing is \"Satyrus Alope\", and I looked for months to find this one and couldn't. These cards are beautiful, with a gold border. Condition is mostly GD to VG, a few better, and as I noted, most of them have pencil writing on the back. \n\n1 stray T218 Champions card - Jerome Keogh\n\n1910 - T44 - Mogul Horoscopes - 11 cards\n\nThis is a massive set of 360 cards, and I have only 11, but these cards are rare. There are tons of front/back combos. For about 6 months, I only saw 1 or 2 of these cards pop up on ebay at a time. It is a rare set. Cards are mostly GD to VG. \n\n1929 Churchman's Sports of Many Lands - 11 cards \n\nThis set contains 25 cards, including the Babe Ruth card and what some people consider the first football card ever. I don't own either of those, but I do own 11 cards from the set, and they are in very nice condition. Id say VGEX or better on all 11. \n\nAs you will see in the pictures below, many of the binder pages have empty spaces, which is where the rest of the cards from the sets would have gone. \n\nIn addition to my binder of cards, I am also going to include a box of cards that contain the T42 (White Border and Gold Border) and T43 Fancy Gold Borders cards. On my spreadsheet, I have 43/50 for the T42 White Borders, and 49/50 on T42 Gold Borders. I also have 25/30 of the T43 Fancy Gold Borders cards. These 3 sets are all pictures of birds. All of these cards are in poor condition and many have back damage, as it looks like they were originally pasted into a scrapbook. They don't fit nicely into a 15 pocket page (too tight), so I never got around to figuring out how to put them into the binder effectively. So they are all in cardsavers. This is another 117 cards. \n\nI will ship both the binder and box of cards in a flat rate box, so you'll get everything noted above, including the Ligthhouse binder with slipcase ($50 value)\n\nAll told, there are a little more than 300 cards included in this collection. I know it will take the right buyer who is interested in something unique. All of these issues are scarce at this point. If you buy them as singles, you'll pay $3 a piece, or more. You will occasionally see lots on ebay, but they aren't plentiful. \n\n*sold*",
      "post_time": "20220125T18:47:33-06:00",
      "timestamp": "1643161653"
    },
    {
      "post_id": "2191359",
      "post_title": "",
      "post_author_name": "53toppscollector",
      "post_content": "price drop",
      "post_time": "20220129T14:13:51-06:00",
      "timestamp": "1643490831"
    },
    {
      "post_id": "2192541",
      "post_title": "",
      "post_author_name": "53toppscollector",
      "post_content": "ive dropped the price. \n\nif i dont get any takers on the whole package, i am going to break the collection up here and auction it off in small batches. i do think this is a really unique opportunity here to pick up a bunch of not so common issues.",
      "post_time": "20220201T16:48:44-06:00",
      "timestamp": "1643759324"
    }
  ]
}