{
  "id": "145731",
  "forum_id": "13",
  "title": "WTB: T206 Ames, Hands At Chest, SGC50 or better",
  "author": "pgellis",
  "reply_count": 3,
  "view_count": 233,
  "created_date": null,
  "last_reply": "20120125T10:59:18-06:00",
  "posts": [
    {
      "post_id": "952782",
      "post_title": "WTB: T206 Ames, Hands At Chest, SGC50 or better",
      "post_author_name": "pgellis",
      "post_content": "I am collecting the T206 set and have 2 large wall display cases that hold 50 graded cards each.  My intention is to display the first 100 T206s (alphabetically) in these cases, so I have been concentrating heavily on the \"first 100\" cards.\n\nI am now down to just 1 more card for the first display case of 50.  I am sick of taking it down off the wall every time I have added a new card to this case over the past couple of years.\n\nAnyways, all I need to finish the \"first 50\" now is a Red Ames, Hands At Chest in SGC50 or better (no PSA please).\n\nAnybody have one for sale so I don't have to take this down off my wall ever again?\n\nThanks for your consideration,\nPhil",
      "post_time": "20120104T07:43:36-06:00",
      "timestamp": "1325688216"
    },
    {
      "post_id": "952945",
      "post_title": "",
      "post_author_name": "atx840",
      "post_content": "Would love to see photos!\n\nI don't have an Ames :(",
      "post_time": "20120104T17:33:28-06:00",
      "timestamp": "1325723608"
    },
    {
      "post_id": "953062",
      "post_title": "",
      "post_author_name": "pgellis",
      "post_content": "Thanks Chris,  I will get some photos up soon.",
      "post_time": "20120105T07:20:40-06:00",
      "timestamp": "1325773240"
    },
    {
      "post_id": "959961",
      "post_title": "",
      "post_author_name": "pgellis",
      "post_content": "3 Week Bump......\n\nAlright, I guess there are no Ames, Hands at Chest in SGC50 (or better) out there for sale, but I am guessing someone might have one in their collection.\n\nSo, I have a nice, crisp $100 bill in my pocket that is burning a hole right now.  I will offer $100 for an Ames, Hands at Chest in SGC50 (more money for a SGC60, etc.).\n\nMy guess is that if you have one in your collection, you have had it for a while and I will also guess that you probably paid around $50 or so for it, so I will offer you a 100% profit on your card.\n\nHopefully someone may be willing to part with one so I don't have to ever take this huge display case down off my wall again.\n\nThanks for your consideration,\nPhil",
      "post_time": "20120125T10:59:18-06:00",
      "timestamp": "1327514358"
    }
  ]
}