{
  "id": "221626",
  "forum_id": "13",
  "title": "FS: 1910-11 T3, e145, e107, 33G Posters",
  "author": "rainier2004",
  "reply_count": 1,
  "view_count": 370,
  "created_date": null,
  "last_reply": "20160430T05:31:27-06:00",
  "posts": [
    {
      "post_id": "1532133",
      "post_title": "FS: 1910-11 T3, e145, e107, 33G Posters",
      "post_author_name": "rainier2004",
      "post_content": "Hello gang:\n\nSo after some time following the birth of my twins, I am doing another run of posters. I am in the process to start a couple new posters, but in the meantime I am running these again, this was the original thread:\n[url]http://www.net54baseball.com/showthread.php?t=197069[/url]\n\nAll the posters are full color printed in CYMK as a 22” x 28” and will fit into any standard frame. The posters run 18 months were 24x30, but I feel the slightly smaller poster displays much better and less bulky and wanted to note the difference. The posters are printed on styrene which is a plastic that is supposed to be more durable in general and specifically to exposure to light over time. \n\nEmail me at [url]stevensuckow@hotmail.com[/url] or pm me here and I will try to respond asap and always within 24 hours. Feel free to ask any questions about the posters to the same email address and thanks for looking.\n\nPosters available:\n1903 e107\n1910-11 T3\n1915 Cracker Jack\n1933 Goudey\n1935 National Chicle\n\nPrice: \nThere is a sliding scale in price, the more you buy the cheaper they get. It goes as follows:\n1st poster - $45 + shipping = $55\n2nd poster - $35 + shipping = $90\n3rd poster - $30 + shipping = $120\n4th poster and each additional poster is $25 at that point and that would also include multiple of the same poster.\n\nShipping: \nAll orders include basic shipping, first class shipping USPS for $10 no matter how many posters are ordered. All posters will start to ship in approximately 3 weeks as I process orders and then print the orders.\n\nPayment:\nI accept anything; pp is easiest and quickest for me. Contact me for an address if you using check or MO, pp can be made at [url]stevensuckow@hotmail.com[/url]. If you are using goods then add another 3% to the total, if using the friends option there will be no additional charge. International orders will need to contact me. Also, I need an address in the payment and what poster you would like plus additional shipping if it applies.\n\nCustom Posters:\nI am now doing custom poster jobs as well and am willing to try and make your vision come to life. This is a bit of work but could do custom posters of your own collection, rarities, combo sets together in one poster. I am open to ideas or even trades.\n\nMy Guarantee:\nI am doing this because I like this work; I like the people I am meeting and the correspondence that is a direct result from my work. I guarantee to treat each person with respect, follow through with all I promise and generally try and take care of each person. If you ever have any concerns or questions please contact me at [url]stevensuckow@hotmail.com[/url]. I also have several references if anyone needs anything. I appreciate everyone who shares a thought and especially those that have shared pictures of my posters hanging in their homes.",
      "post_time": "20160426T18:10:48-06:00",
      "timestamp": "1461715848"
    },
    {
      "post_id": "1533484",
      "post_title": "",
      "post_author_name": "rainier2004",
      "post_content": "Last call gang...",
      "post_time": "20160430T05:31:27-06:00",
      "timestamp": "1462015887"
    }
  ]
}