{
  "id": "305563",
  "forum_id": "13",
  "title": "T200 Fatima FS Pit-Wagner, Cin, Bos AM",
  "author": "ricktmd",
  "reply_count": 5,
  "view_count": 707,
  "created_date": null,
  "last_reply": "20210730T16:41:36-06:00",
  "posts": [
    {
      "post_id": "2126576",
      "post_title": "T200 Fatima FS Pit-Wagner, Cin, Bos AM",
      "post_author_name": "ricktmd",
      "post_content": "Offered here are 3 ungraded 1913 T200 Fatima Team Cards. \nThe Pittsburgh Card has a very nice dark image on the front with good contrast and clarity. Wagner's image is unobstructed . There is a slight crease which is more of a photo crack through Hendrix next to Wagner which does not go through to the back. The back has some black staining which is also present on the front border. I am not sure how this would grade. Possibly an A because of the staining or maybe higher. I can only say it is authentic.\n\nThe Cincinnati card with Joe Tinker has a great front with no visible creases I can see with excellent contrast and clarity. On the back there is a small piece of paper loss in the bottom border likely from album removal and a second small piece of paper loss over the word name\n\nThe Boston AL card is quite nice with a crisp and clean image with great clarity. There is a crease next to Carrigan top to bottom which is apparent on the back as well It does not touch Joe Wood or Tris Speaker in this nice example . The back is mostly clean.\n\nAll 3 are authentic Fatima T200 cards. I cannot say they will grade higher than authentic although I have no way to know how a TPG would judge these three. Thanks for looking\n\nPittsburgh $sold\nBoston AL $sold\nCin           $sold\n\nPlease add 8.00 for shipping in a flat rate box. Paypal f & f preferred",
      "post_time": "20210725T11:11:31-06:00",
      "timestamp": "1627233091"
    },
    {
      "post_id": "2126672",
      "post_title": "",
      "post_author_name": "Aquarian Sports Cards",
      "post_content": "solid prices. If I didn't have so much tied up in grading I'd be all over them.",
      "post_time": "20210725T15:12:12-06:00",
      "timestamp": "1627247532"
    },
    {
      "post_id": "2126702",
      "post_title": "pirates",
      "post_author_name": "bigfish",
      "post_content": "Hey Rick,\n\nI will buy the pirate team card.",
      "post_time": "20210725T16:56:34-06:00",
      "timestamp": "1627253794"
    },
    {
      "post_id": "2126710",
      "post_title": "Boston",
      "post_author_name": "Jeff_cvc",
      "post_content": "I’ll take Boston",
      "post_time": "20210725T17:12:01-06:00",
      "timestamp": "1627254721"
    },
    {
      "post_id": "2127315",
      "post_title": "",
      "post_author_name": "ricktmd",
      "post_content": "2 Sold Cincinnati discounted",
      "post_time": "20210727T08:01:38-06:00",
      "timestamp": "1627394498"
    },
    {
      "post_id": "2128669",
      "post_title": "",
      "post_author_name": "ricktmd",
      "post_content": "Cin 249.00. On ebay now . May be the last chance to snag it",
      "post_time": "20210730T16:41:36-06:00",
      "timestamp": "1627684896"
    }
  ]
}