{
  "id": "98272",
  "forum_id": "13",
  "title": "WTT:  T206 low grade for same",
  "author": "Archive",
  "reply_count": 2,
  "view_count": 466,
  "created_date": null,
  "last_reply": "20080816T04:58:00-06:00",
  "posts": [
    {
      "post_id": "683219",
      "post_title": "WTT:  T206 low grade for same",
      "post_author_name": "Archive",
      "post_content": "Posted By: Chuck P\nBelow is a list of commons with common backs that I need.  I have about 20 dups in the P to G range to trade for them.  LMK what you have from this list and what you need.\n\nAlso willing to trade my 50's and 60's stars/HOFers in decent shape for your T206 beaters if you are so inclined.\n\nThanks for looking,\n\nChuck\n\nI need the following common Piedmonts...Abbaticchio (blue sleeves), Adkins, Alperman, Bradley (w/ bat), Bridwell (portrait, with cap), Burchell, Camnitz (arms at side), Conroy (fielding), H. Davis (Phil., Davis on front), H. Davis (Phil., H. Davis on front), Devore, Donlin (w/ bat), Donohue, Donovan (portrait), Dougherty(portrait), Joe Doyle (hands above head), Dunn, Elberfeld (Wash. - fielding), Freeman, Graham, (St L), Jordan (Brooklyn, batting), Karger, Kleinow(Boston), Kleinow(NY catching), Kling, Lake (St. L, ball in hand), Latham, Leifield (batting), Liebhardt, Lobert, Lumley, Lundgren (KC), McBride, McLean, McQuillan w/ bat), Merkle (portrait), Merritt, Milligan, Moran (Providence), Murphy batting, O'Hara (New York), Payne, Pfeffer,  Pfeister (throwing), Pickering, Powell, Purtell, Raymond, Reulbach (glove showing, Reulbach (no glove showing), Rhoades (right arm extended), Rhodes, Schlafly, Schlei (portrait), Schmidt (throwing), Schulte (front view), Scott, Seymour (throwing), Seymour (portrait), Shannon, Snodgrass (catching), Snodgrass (batting), Steinfeldt (portrait), Titus, Wagner (bat on right shoulder), Doc White (Chicago, portrait), Willetts and Wiltse (portrait w/ cap)\n \n \n \n        I need the following common Sweet Caporals .... Adkins, Ames (portrait), Anderson, Arellanes, Ball (Cleveland), Ball (New York), Barbeau, Barry (Philadelphia), Batch, Beaumont, Bergen (batting), Bernhard, Bescher (hands in air), Bradley (portrait), Brain, Brashear, Bridwell (portrait, with cap), Burch (batting), Burch (fielding), Burchell, Camnitz (arms folded), Campbell, Carr, Carrigan, Casey, Cassidy, Charles, Cicotte, Clymer, Crandall (portrait-no cap), Cree, Dahlen (Boston), Dahlen (Brooklyn), Davidson, H. Davis (Phil., Davis on front), Dineen, Donlin (w/ bat), Donohue, Dougherty(arm in air), Downey (fielding), Downs,  Larry Doyle (w/ bat), Durham, Dygert,  Elberfeld (Wash. - fielding), Evans, Ewing, Fiene (portrait), Freeman, Fromme, Gandil, Ganley, Ganzel, Gray, Grimshaw, Hall, Hannifan, Hayden, Herzog (Boston), Hinchman (Cleveland), Hinchman (Toledo), Hoblitzel, Howard (Chicago), F. Jones (portrait), T Jones (St Louis), Jordan (Brooklyn, batting), Karger, Kissinger, Knight(portrait), Krause (portrait), Kroh, Leifield (pitching), Lobert, Lord, Magee w/ bat, Maloney, Manning (pitching), Mattern, McCormick, McElveen, McIntyre (Detroit), Merkle (throwing), Milan, Mitchell (Cin.), Mitchell (Tor.), Moeller, Moran (Chicago), Moriarty, Mullen, Mullin w/ bat, Murphy throwing, Murray portrait, Myers (batting), Myers (fielding), Nattress, Nichols (batting), Niles, Obrien, Oldring (fielding), Overall (hand face level),Overall (portrait), parent, Paskert, Pastorious, Pfeister (seated), Pfeister (throwing), Phelps, Poland, Powell, Quillen, Randall, Raymond, Rucker (throwing), Rudolph, Schaeffer (wash.), Schlafly, Schmidt (portrait), Shaw (prov.), Shaw (St. Louis), Sheckard (glove showing), Sheckard (no glove showing), Smith (Chicago all versions), Snodgrass (catching), Spencer, Stahl (no glove shows), Steinfelt w bat, Stovall batting, Strang, Street (catching), Street (portrait), Lee Tannehill (Chicago L. Tannehill on front, Thielman, Thomas, Titus, Turner, Wagner (bat on left shoulder), Wagner (bat on right shoulder), Doc White (Chicago, pitching), Wilhelm (hands at chest), Willett, Willetts, Williams, Wilson, Wiltse (pitching),Wright and Zimmerman.\n\nI need a 150 Series of the following commons....... Crandall (Portrait, No Cap), Karger, Kling, and Merkle (Portrait).\n\nI need a 350 Series of the following commons....... Abbaticchio (Blue Sleeves), Adkins, Ames (Hands above Head),Ames (Hands at Chest),Ames (Portrait), Ball NY, Beaumont, Bowerman,Bradley (Portrait),Bradley (With Bat),Bridwell (Portrait, No Cap), Burchell, Clarke (Cleveland), Conroy (Fielding),Conroy (With Bat),Covaleski, Crandall (Portrait, No Cap), Criger, Dahlen (Boston Nat'l), Davis (Davis on Front), Delehanty (Washington), Donlin (Seated), Donlin (With Bat), Donovan (Portrait), Dooin, Doolin (Doolan),Dougherty (Arm in Air), Doyle (Throwing), Durham, Elberfeld (Portrait, New York), Ewing, Freeman, Ganley, Gibson,Gilbert,Goode, Hahn, Hinchman (Cleveland), Jordan (Brooklyn, Batting), Jordan (Brooklyn, Portrait), Karger, Lake (New York), Latham, Leach (Portrait), Leifield (Batting), Lindaman, Lobert, Magee (Portrait), McQuillan (With Bat), Meyers, Moran (Chicago), Mullin (Throwing), Mullin (With Bat), Nichols (Hands on Knees), O'Leary (Portrait), Overall (Hands at Waist), Overall (Portrait), Pastorius, Pfeister (Throwing), Powell, Rhodes, Ritchey, Rucker (Portrait),\nSchaeffer (Detroit),Schaeffer (Washington),Schlafly, Schmidt (Throwing), Schulte (front view), Seymour (batting) Shaw (St. Louis),\nSheckard (No Glove Showing), Smith F. (Chicago, F. Smith), Snodgrass (Catching),Spade,Spencer,Stahl (No Glove Shows), Steinfeldt (Portrait), Sheckard (No Glove Showing), Smith F. (Chicago, F. Smith), Snodgrass (Catching),Spade,Spencer,Stahl (No Glove Shows), Steinfeldt (Portrait), Stovall (Portrait), Tannehill (L. Tannehill on Front), Titus, Wagner (Bat on Left Shoulder), Wagner (Bat on Right Shoulder), Weimer, White, Doc (Pitching) White, Doc (Portrait), Willetts, Williams, Wiltse (Pitching) and Wiltse (Portrait, No Cap)\n\nI need a 350/460 Series of the following commons ..............Bridwell (Portrait, With Cap),Burch (Fielding),Davis (Davis on Front),Donlin (With Bat),Fiene (Portrait),Fiene (Throwing),Jordan (Brooklyn, Batting),Lake (St. Louis, No Ball),Magee (With Bat),Manning (Pitching),Overall (Hands face Level),Pfeister (Throwing),Rucker (Throwing),Snodgrass (Catching),Steinfeldt (With Bat),Street (Catching),Wagner (Bat on Right Shoulder),Wilhelm (Batting) and Willetts.",
      "post_time": "20080730T11:13:00-06:00",
      "timestamp": "1217437980"
    },
    {
      "post_id": "683220",
      "post_title": "WTT:  T206 low grade for same",
      "post_author_name": "Archive",
      "post_content": "Posted By: Robert Reiss\nI have a SC Ganzel and a Pied Shannon.  Both are trimmed.  Would you be interested?  Thanks, Bob",
      "post_time": "20080730T16:27:00-06:00",
      "timestamp": "1217456820"
    },
    {
      "post_id": "683221",
      "post_title": "WTT:  T206 low grade for same",
      "post_author_name": "Archive",
      "post_content": "Posted By: Chuck P\nI updated the list in the original post and added a list by series.  Need plenty of the more common backs other than P and SC too !!!!\n\nThanks for looking..... is 2000 out of the realm of possibility?\n\nChuck",
      "post_time": "20080816T04:58:00-06:00",
      "timestamp": "1218884280"
    }
  ]
}