{
  "id": "202024",
  "forum_id": "13",
  "title": "SOLD: T205 Broad Leaf, miscut back",
  "author": "Rob D.",
  "reply_count": 1,
  "view_count": 351,
  "created_date": null,
  "last_reply": "20150221T14:07:28-06:00",
  "posts": [
    {
      "post_id": "1383152",
      "post_title": "SOLD: T205 Broad Leaf, miscut back",
      "post_author_name": "Rob D.",
      "post_content": "Rather than tell you how incredibly rare a T205 with a Broad Leaf back is, or how T205s with miscut backs aren't understood by collectors and are woefully underpriced :eek::eek::eek:, or how SGC was shockingly harsh when assigning grades and these cards easily are candidates for a one-grade -- heck, make it a two-grade! -- bump, I think I'll just provide scans, prices and payment information.\n\nI also will choose to not insult your intelligence by pricing these for hundreds of dollars more than I can expect to sell them for, then bump the thread every few days with a \"price reduction.\"\n\nI am thanking you now for the numerous emails I will receive on these (which means I won't be bumping the thread tomorrow to thank you for the numerous emails I've received).\n\nBroad Leaf George Bell, SGC 60/5: SOLD\n\nPiedmont Ed Reulbach with miscut reverse, SGC 20/1.5: SOLD\n\nPrices are delivered within the United States.\n\nPayPal is fine. No need to \"gift\" your payment. (Check, cash, money order also OK and preferred).\n\nA commitment to buy takes precedence over an ongoing negotiation. :rolleyes: \n\n[URL=\"wolfie51sb@aol.com\"]Feel free to email any questions.[/URL]\n\nThanks,\n\nRob\n\n[URL=\"wolfie51sb@aol.com\"]wolfie51sb at aol dot com[/URL]\n\n[IMG]http://photos.imageevent.com/ineedanap/otherphotos/2-t205s.jpg[/IMG]",
      "post_time": "20150221T13:59:40-06:00",
      "timestamp": "1424552380"
    },
    {
      "post_id": "1383155",
      "post_title": "",
      "post_author_name": "Econteachert205",
      "post_content": "Awesome cards, miscut side is chief Meyers fwiw.",
      "post_time": "20150221T14:07:28-06:00",
      "timestamp": "1424552848"
    }
  ]
}