{
  "id": "121830",
  "forum_id": "13",
  "title": "FS:  1909 Obak Christian (altered)  -- $35 -- SOLD",
  "author": "Anthony S.",
  "reply_count": 4,
  "view_count": 519,
  "created_date": null,
  "last_reply": "20100317T16:13:44-06:00",
  "posts": [
    {
      "post_id": "790993",
      "post_title": "FS:  1909 Obak Christian (altered)  -- $35 -- SOLD",
      "post_author_name": "Anthony S.",
      "post_content": "1909 Obak Christian (altered)   $35 -- SOLD\n\nPLEASE NOTE:  This card will NOT grade.  It has been altered, ie bleached.\n\nHere's the provenance:\n\nI received this card in trade from a fellow board member, Jim Hatch, last year.  At some point during its existence, a previous owner, probably a juvenile delinquent, had colored in the player's entire uniform with black permanent ink.  The result was absurd, but funny.  The main problem was that the black ink had also smudged other parts of the card, which made it look pretty crummy. \n\nSo when I received a graded 1909 Obak Christian from the recent B-L auction two days ago, I decided to experiment and see if I could clean up the smudged version.  Turns out I could.  It has been bleached, quickly and haphazardly I might add, for purely aesthetic reasons (which you can see from the \"Before\" photo) and not to deceive.  That's why I'm providing the detailed provenance.  So if you collect raw cards, and want an affordable card from a tough set, this might be a card for you.  I should add, if I see this card offered for re-sale with no mention of it's history and alteration, I will make an issue out of it.\n\nmy email:  [url]boboinnes33@gmail.com[/url]",
      "post_time": "20100317T14:52:30-06:00",
      "timestamp": "1268859150"
    },
    {
      "post_id": "790997",
      "post_title": "",
      "post_author_name": "Mikehealer",
      "post_content": "I would be interested in the Johnny Cash version.",
      "post_time": "20100317T14:58:22-06:00",
      "timestamp": "1268859502"
    },
    {
      "post_id": "790999",
      "post_title": "",
      "post_author_name": "Anthony S.",
      "post_content": "It can be returned to the Johnny Cash version in about 2 minutes with a magic marker.  And if done carefully, with less smudging.",
      "post_time": "20100317T15:03:02-06:00",
      "timestamp": "1268859782"
    },
    {
      "post_id": "791012",
      "post_title": "",
      "post_author_name": "shammus",
      "post_content": "I could use the bleached version for my obak set.  It will be a part of my set so I definitely won't be reselling it.  I'll take it if not spoken for...\n\nBrian",
      "post_time": "20100317T16:07:06-06:00",
      "timestamp": "1268863626"
    },
    {
      "post_id": "791016",
      "post_title": "",
      "post_author_name": "Anthony S.",
      "post_content": "It's all yours, Brian.  Exactly the type of buyer I was hoping for.  I'll send you an email.",
      "post_time": "20100317T16:13:44-06:00",
      "timestamp": "1268864024"
    }
  ]
}