{
  "id": "159518",
  "forum_id": "13",
  "title": "WTB: T207 Recruit class Anon 3 or Napoleon back",
  "author": "Seiklis",
  "reply_count": 3,
  "view_count": 1131,
  "created_date": null,
  "last_reply": "20121201T10:06:20-06:00",
  "posts": [
    {
      "post_id": "1057152",
      "post_title": "WTB: T207 Recruit class Anon 3 or Napoleon back",
      "post_author_name": "Seiklis",
      "post_content": "Looking for any Recruit class T207 Cleveland player with an Anon 3 or Napoleon back. \n\nAny of the following would also apply\nArt Wilson (Napoleon)\nErnest Wilie (Napoleon)\nBob Higgins (Anon 3 or Napoleon)\n\nIf you have any of the cards for sale please reply, pm or e-mail me at [URL=\"XxSeiklis_GrockxX@hotmail.com\"]XxSeiklis_GrockxX@hotmail.com[/URL]\n\nThanks",
      "post_time": "20121129T13:13:49-06:00",
      "timestamp": "1354220029"
    },
    {
      "post_id": "1057398",
      "post_title": "T207's",
      "post_author_name": "Bridwell",
      "post_content": "Interesting want list.  Always fun to find more T207 collectors.\n\nAnon 3 Recruit-series backs are quite scarce.  From the information I have, there are only 49 players known.  Easterly and George are the 2 known Cleveland players.  There was a recent Heritage auction lot of 95 different Anon 3 players, with all 49 known Recruit-series cards and 46 of the Broadleaf-series cards, out of 50 known.  \n\nWilie and Art Wilson are not known with an Anon 3 back.  Higgins is, though.",
      "post_time": "20121129T22:39:53-06:00",
      "timestamp": "1354253993"
    },
    {
      "post_id": "1057490",
      "post_title": "",
      "post_author_name": "Seiklis",
      "post_content": "Ah thanks, I wasn't sure who had Anon 3 backs among the Cleveland players, figures it's none of the easier Recruit class though only 3 of them possibly existing does surprise me\n\nI lucked into a Anon 25 for Broadleaf so hopefully I can luck into an Anon 3",
      "post_time": "20121130T09:02:20-06:00",
      "timestamp": "1354291340"
    },
    {
      "post_id": "1057850",
      "post_title": "T207 Cleveland",
      "post_author_name": "frohme",
      "post_content": "Hi Jack,\n\nI can help you out with at least one of the cards.  Images below (apologies for the size).\n\nVean Gregg - Anon Factory 3 (Broadleaf class) - SGC 20 $110\nLefty George - Anon Factory 3 - (Recruit class) - raw ($135)\n\nEchoing Ron's comments ... though the Recruit class cards are in general significantly easier to find than the Broadleaf class cards, that not entirely true with the Anon-factory 3 backs.  It's a tough back for the Recruits - easily as difficult as Napoleon, apparently.\n\nDon't have a spare Napoleon, though or I'd be glad to help out.\n\n(oops - re-read that you have BL covered - ignore the Gregg.)",
      "post_time": "20121201T10:06:20-06:00",
      "timestamp": "1354381580"
    }
  ]
}