{
  "id": "121274",
  "forum_id": "13",
  "title": "Trading PSA HOFers**",
  "author": "familytoad",
  "reply_count": 4,
  "view_count": 510,
  "created_date": null,
  "last_reply": "20100302T23:03:07-06:00",
  "posts": [
    {
      "post_id": "786495",
      "post_title": "Trading PSA HOFers**",
      "post_author_name": "familytoad",
      "post_content": "Folks, before sending these 9 cards in for crossover to SGC, I thought I would try a wild idea...many of us prefer PSA cards. I much prefer SGC but have acquired a few really nice PSA cards that I want SGC versions of.\n\nMy proposition is to see if someone out there wants to do a straight swap.\nThis would mean your equivalent SGC graded example of a card below for mine.\nPlayer for player, card for card. If you have a slighty higher graded SGC card and need me to add some cash...we might be able to do that too...I'm not looking to downgrade much though.\n\nNote: these cards are NOT for sale. If I get no takers they will be heading to Parsippany next week.\n\nT206 Hughie Jennings (one hand) PSA 2 (Sweet Caporal)\nT206 Hugh Duffy PSA 2 (Polar Bear)\n1938 Goudey Hank Greenberg #277 PSA 2 \nE94 Close Candy Sam Crawford (Green) PSA 1\nR306 Butter Cream Hack Wilson PSA 5\nE93 Standard Caramel Chief Bender PSA 1\nT206 Cy Young (portrait) PSA 1 (Piedmont)\nE90-1 Nap Lajoie GAI 2\n1906 Fan Craze Joe McGinnity PSA 7\n1915 Cracker Jack Sam Crawford PSA 3\n\nI can also provide back scans, replying to your email requests for them. Here are 5 scans to get you started...",
      "post_time": "20100228T19:30:04-06:00",
      "timestamp": "1267410604"
    },
    {
      "post_id": "786504",
      "post_title": "5 more scans-PSA/GAI trading",
      "post_author_name": "familytoad",
      "post_content": "Here are the rest of the front scans...again looking only for the equivalent SGC version...",
      "post_time": "20100228T20:04:48-06:00",
      "timestamp": "1267412688"
    },
    {
      "post_id": "786508",
      "post_title": "",
      "post_author_name": "Pup6913",
      "post_content": "Hey Brian good luck on those trades.  I think even the PSA guys would not want to trade a SGC example for a PSA one:D  Hope they all cross well for you.  Show'em when you get them back.",
      "post_time": "20100228T20:10:59-06:00",
      "timestamp": "1267413059"
    },
    {
      "post_id": "786731",
      "post_title": "",
      "post_author_name": "Bosox Blair",
      "post_content": "Hi Brian,\n\nNot sure if you saw, but SGC had a half-price crossover special for the month of February...hope you didn't miss out on it!\n\nCheers,\nBlair",
      "post_time": "20100301T18:27:09-06:00",
      "timestamp": "1267493229"
    },
    {
      "post_id": "787067",
      "post_title": "Thanks Blair",
      "post_author_name": "familytoad",
      "post_content": "Blair,\nYeah, I dipped my toes into the crossover special and did nicely with my York Caramel set.\nI should have done more but my \"organization\" ain't too organized and I need to strategize what I'm after...which changes every time some one of you posts on the new pickup thread or shows some neat scans that I get envious of. The addiction is in full bloom now that spring training has begun.:o\n\nBack to the relevance of this thread, not much action yet, so keep coming with your ideas...while I want to get SGC versions, I could upgrade with yours and pay the difference on these cards...open to suggestions.",
      "post_time": "20100302T23:03:07-06:00",
      "timestamp": "1267596187"
    }
  ]
}