{
  "id": "143424",
  "forum_id": "13",
  "title": "WTT: T206 Cobb (red portrait) G/VG and T205 Cobb G",
  "author": "marcdelpercio",
  "reply_count": 4,
  "view_count": 908,
  "created_date": null,
  "last_reply": "20120204T06:58:33-06:00",
  "posts": [
    {
      "post_id": "937399",
      "post_title": "WTT: T206 Cobb (red portrait) G/VG and T205 Cobb G",
      "post_author_name": "marcdelpercio",
      "post_content": "Hello.  I am looking to trade either/both of these nice Cobbs.  Scans have been provided to show condition.  \n\nThe T206 has an extremely light mark above his head near the border and a very light scratch on the jersey near the bottom border.  Both of these marks are difficult to see in person with the naked eye.  The back has the obvious purple ink stamp of a castle but is otherwise clean.\n\nThe T205 has the noticeabe chipping along the bottom border and some other light edge and corner wear.  Also a couple of very light wrinkles on the right edge and upper left corner.  The back also has some light staining but is otherwise clean.\n\nI would like to trade these for similarly valued Cobb cards or other top-tier HOF'ers from any caramel or tobacco (other than T205 or T206) sets.  I would also consider trades for any tough type cards or 19th century stuff.\n\nI'm NOT looking to sell these right now...only considering trades.  Thanks for looking and please send me a PM or e-mail to [url]marcdelpercio2000@yahoo.com[/url] with questions or any trade offers.",
      "post_time": "20111105T11:45:32-06:00",
      "timestamp": "1320515132"
    },
    {
      "post_id": "958601",
      "post_title": "",
      "post_author_name": "marcdelpercio",
      "post_content": "Friendly bump on this post.  Both of these Cobbs are still available.  I'd like to trade either/both for similarly valued top-tier HOF'ers or other tough type cards.  I collect just about everything so please feel free to send me a PM or e-mail to [url]marcdelpercio2000@yahoo.com[/url] with any offers.  Thanks for looking!",
      "post_time": "20120121T13:20:32-06:00",
      "timestamp": "1327177232"
    },
    {
      "post_id": "958712",
      "post_title": "",
      "post_author_name": "ScottR81",
      "post_content": "How much Would you want for just the red Cobb?",
      "post_time": "20120121T20:19:10-06:00",
      "timestamp": "1327202350"
    },
    {
      "post_id": "958813",
      "post_title": "",
      "post_author_name": "marcdelpercio",
      "post_content": "Scott,\nThanks for the reply.  As noted, I'm only looking to trade these right now and am open to any offers.  I'd prefer to trade for similar top-tier HOF'ers or tough type cards in an equivalent value range.  I collect just about everything, although I don't need any T205 or T206, so please feel free to contact me with any trade offers.  Thanks again for the interest!",
      "post_time": "20120122T09:33:31-06:00",
      "timestamp": "1327250011"
    },
    {
      "post_id": "963699",
      "post_title": "",
      "post_author_name": "dougscats",
      "post_content": "Email being sent.\n\nDoug",
      "post_time": "20120204T06:58:33-06:00",
      "timestamp": "1328363913"
    }
  ]
}