{
  "id": "131126",
  "forum_id": "13",
  "title": "Free to ethical home",
  "author": "bbcard1",
  "reply_count": 5,
  "view_count": 472,
  "created_date": null,
  "last_reply": "20101224T08:38:08-06:00",
  "posts": [
    {
      "post_id": "857389",
      "post_title": "Free to ethical home",
      "post_author_name": "bbcard1",
      "post_content": "I have a few SGC cases....maybe 10 or so anyway...that I have taken cards out of. The all came out pretty neatly without much damage to the holders...I know some folks like the looks of them (they are T cards and include the black insert).  if you'll reimburse the postage, I'll be glad to send them to you after the holidays. a little airplane glue and I think you would be in business.  Would be ideal to display rougher t206s that do not have enough value to submit.\n\nAs some of you know, I prefer my cards ungraded.",
      "post_time": "20101223T20:14:46-06:00",
      "timestamp": "1293160486"
    },
    {
      "post_id": "857393",
      "post_title": "",
      "post_author_name": "dougscats",
      "post_content": "How did you get the cards out of the holders?\nThanks.",
      "post_time": "20101223T20:34:14-06:00",
      "timestamp": "1293161654"
    },
    {
      "post_id": "857398",
      "post_title": "",
      "post_author_name": "bbcard1",
      "post_content": "Small flathead screwdriver along the seams. torque gently but firmly. You may have to try a couple of places, but eventually, it will crack neatly along the heat seal...once it starts, you just keep working around the seam torquing every couple of inches. On a few of them, I had to go back over the seams with la larger screwdriver.  I have heard of people using more aggressive measures, but that would seem dangerous to the card.  I doubt they would ever pass muster if closely examined because you can see small indentions if you look at the sides, but I also have little doubt that if I wanted to make them come out clean I could do so.  I ended up picking up some As and 1s in my set ...and a handful of 2s which I got for the same price as I would have gotten raw cards, so I busted them out and am much happier than i would have been had they stayed in.\n\nHolders have been claimed.",
      "post_time": "20101223T21:02:32-06:00",
      "timestamp": "1293163352"
    },
    {
      "post_id": "857400",
      "post_title": "",
      "post_author_name": "tiger8mush",
      "post_content": "Ditto what bbcard1 said with respect to opening an SGC case.  small-medium flat head screwdriver, insert into a seam, twist gently till you hear a slight sound of plastic giving, and continue to do this along the seam.  I popped a T206 out tonight and it took literally a minute and the case looked fine.\n\nthe BVG large Supplement-size holders are a PITA, on the other hand!\n\nRob\n:)",
      "post_time": "20101223T21:16:46-06:00",
      "timestamp": "1293164206"
    },
    {
      "post_id": "857434",
      "post_title": "",
      "post_author_name": "dougscats",
      "post_content": "Thanks for the good info, bbcard1 and Rob; I'll try it.\nI too prefer my cards ungraded, for display purposes and for the sake of simply being able to touch them.\n\nDoug",
      "post_time": "20101224T07:51:38-06:00",
      "timestamp": "1293202298"
    },
    {
      "post_id": "857442",
      "post_title": "",
      "post_author_name": "cozmokramer",
      "post_content": "when i sell raw cards on ebay these are great to use in packing to tape a card saver or top loader to in order to prevent any bending in a bubble envelope!",
      "post_time": "20101224T08:38:08-06:00",
      "timestamp": "1293205088"
    }
  ]
}