{
  "id": "126269",
  "forum_id": "13",
  "title": "T205 Set condition/backs at National",
  "author": "Steve_NY",
  "reply_count": 0,
  "view_count": 474,
  "created_date": null,
  "last_reply": "20100802T20:28:33-06:00",
  "posts": [
    {
      "post_id": "826957",
      "post_title": "T205 Set condition/backs at National",
      "post_author_name": "Steve_NY",
      "post_content": "I reviewed my T205 set and can offer the following to everyone who e-mailed or called me last week:\n\n1- I valued the set last night at just about $40,000, without considering backs or variations\n\n2- The set comes with both Dougherty's\n\n3- The backs are high in Piedmont's and Sweet Caps\n--there are 3 American Beauty cards - Ty Cobb, Shean, Titus\n--there are 2 Cycle backs -- Delahanty, Olmstead\n--there is one Broad Leaf which is near mint and is Payne\n--There are 5-6 Sovereigns including Huggins, Harmon, Jennings, Lush and Rucker\n--There are over 30 Polar Bear backs\n--There are a number of Piedmont factory 42 backs with HOFs\n--There are many Hassan and Honest Long Cut backs\n\n4- Overall condition ranges from VG - Ex - Near Mint; it's a mixed set that \ndisplays beautifully. With all of the tough cards and conditions, grading would add tens of thousands to the value. (I do not grade any cards -- I move items at reasonable prices and move on to the next item. After I move this set, I am buying a T206 set missing three of the big four)\n\n5- The Broad Leaf Payne in near mint and the American beauty Cobb with chipping on the right side add significant value to the set.\n\n6-The set can be seen at my booth at the National -- 125P seven booths to the left of the main entrance.\n\n*********\n\nCome see my display of 100s of T205's and T 206's and other T's including\nT3, T201, T202, T210, T200, T220 and others.\n\nContact me on 914-522-3853 (CELL) to discuss.\n\nSteve Sabow\nBooth 125P\nBaltimore National",
      "post_time": "20100802T20:28:33-06:00",
      "timestamp": "1280802513"
    }
  ]
}