{
  "id": "192168",
  "forum_id": "13",
  "title": "Waterline repair - Sell the T205's! Updated",
  "author": "Mdmtx",
  "reply_count": 9,
  "view_count": 829,
  "created_date": null,
  "last_reply": "20140816T08:29:19-06:00",
  "posts": [
    {
      "post_id": "1308424",
      "post_title": "Waterline repair - Sell the T205's! Updated",
      "post_author_name": "Mdmtx",
      "post_content": "I hate to sell these, I was hoping to work on a set, but life has gotten in the way with a water leak under the drive way. Water leak is repaired, but drive is not. I would prefer to sell the whole group of 15 for $330.00(individually I am asking 354.00). However, I have priced each card individually. Would prefer paypal F & F, but will accept check or money order as well. If these sell as one group I will pay shipping. If they sell otherwise, allow 3.50 per package for shipping. The cards will ship in tobacco top loaders and soft sleeves. I hate to see these go!!! Get a great jump start to a T205 set.\n\nFred Clarke (HOF) Red sweet cap back nice shape with mild paper loss on reverse. 110.00 Nicest card in the group!!\n\nChief Bender (HOF) Some chipping and creases, but presents nicely. Polar Bear back with some small spots of dirt or residue. 65.00\n\nTopsy Hartsel Nice front with some chipping and a couple of spots of paper loss. Has a Piedmont factory 25 back with 25% or so paper loss. 20.00\n[IMG]http://i57.tinypic.com/21l7vkn.jpg[/IMG]\nFreddy Parent Very Nice Front. Small amounts of chipping. Has a Piedmont factory 25 back with 15% or so paper loss 22.00\n\nThomas Leach nice presentable card with light creases and some chipping. Has a piedmont back with 30% or so paper loss. 22.00\n\nWilliam Bergen off cut top to bottom. Piedmont 25 back creasing and chipping. 20.00\n\nEdward Phelps creasing and chipping. Piedmont 25 back with minor paper loss 17.00\n\n[IMG][IMG]http://i59.tinypic.com/351b91y.jpg[/IMG][/IMG]\nCharles Phillippe crease chipping and small paper loss on front. Piedmont 25 back with small amount of paper loss. 17.00\n\nAmbrose McConnell off center left to right. Rounding, creases and chipping. Displays well. I think he has a Piedmont back. About 50% paper loss 10.00\n\nJohnny Kling nice front with chipping and crease. Piedmont back with 40% or so paper loss. $12.00\n\nTom Needham heavy creasing with rounding and chipping. Piedmont back with 15% or so paper loss. 10.00\n\nMike Mitchell with creasing, chipping and rounding. Has Piedmont back. Pencil marks on back at bottom. 30% or so paper loss. 10.00\n[IMG][IMG]http://i58.tinypic.com/f3dphj.jpg[/IMG][/IMG]\n\nJames Sheckard off center, chipping and rounding with missing bottom left corner. other than bottom left corner, the card displays well. Has an Honest Long Cut back. 10.00 \n\nIra Thomas with heavy creasing and rounding. Sweet Cap 42 back with minor paper loss. 10.00\n[IMG][IMG]http://i62.tinypic.com/9bd36a.jpg[/IMG][/IMG]",
      "post_time": "20140810T12:26:11-06:00",
      "timestamp": "1407695171"
    },
    {
      "post_id": "1308998",
      "post_title": "",
      "post_author_name": "Mdmtx",
      "post_content": "I am confused at the lack of response. Do I have these priced too high?  I would appreciate any insight that can be offered. \n\nMark",
      "post_time": "20140811T17:57:16-06:00",
      "timestamp": "1407801436"
    },
    {
      "post_id": "1309009",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "The problem is the paper loss...most people who love the t205 set have problems with paper loss on the back that affects the writing...it is a defining characteristic of the t205 set so people often do not want t205s like this...myself included...I prefer creased and crushed t205s but avoid paper loss at all costs.\n\njoshua",
      "post_time": "20140811T18:14:12-06:00",
      "timestamp": "1407802452"
    },
    {
      "post_id": "1309010",
      "post_title": "",
      "post_author_name": "bbcard1",
      "post_content": "Check the closed listings on ebay. I am not in the market, so I have no dog in the fight, but I think you'll get a better feel for what T205s are going and they are a bit higher than the current market.  While I will always have a very warm spot for T205s, they aren't the most popular of the T card issues, though still widely collected.",
      "post_time": "20140811T18:14:31-06:00",
      "timestamp": "1407802471"
    },
    {
      "post_id": "1309011",
      "post_title": "",
      "post_author_name": "Mdmtx",
      "post_content": "Thanks for the input guys. I will do a little more research and make some adjustments.",
      "post_time": "20140811T18:19:40-06:00",
      "timestamp": "1407802780"
    },
    {
      "post_id": "1309025",
      "post_title": "",
      "post_author_name": "Mdmtx",
      "post_content": "Prices dropped!!",
      "post_time": "20140811T18:44:58-06:00",
      "timestamp": "1407804298"
    },
    {
      "post_id": "1309695",
      "post_title": "",
      "post_author_name": "EvilKing00",
      "post_content": "pm sent",
      "post_time": "20140813T12:52:12-06:00",
      "timestamp": "1407955932"
    },
    {
      "post_id": "1309852",
      "post_title": "",
      "post_author_name": "Wite3",
      "post_content": "pm sent a few days ago...",
      "post_time": "20140813T18:17:47-06:00",
      "timestamp": "1407975467"
    },
    {
      "post_id": "1309945",
      "post_title": "",
      "post_author_name": "Mdmtx",
      "post_content": "I am out of town for work until late Friday. I will get back to the messages in the order they were received this weekend. Sorry for the delay. \n\nMark",
      "post_time": "20140813T21:09:28-06:00",
      "timestamp": "1407985768"
    },
    {
      "post_id": "1310775",
      "post_title": "Updated",
      "post_author_name": "Mdmtx",
      "post_content": "Several sold, list updated.",
      "post_time": "20140816T08:29:19-06:00",
      "timestamp": "1408199359"
    }
  ]
}