{
  "id": "173419",
  "forum_id": "13",
  "title": "1912 S110 Baseball Silk Pillowcase with Cobb, Johnson & Mathewson, etc. SOLD",
  "author": "canjond",
  "reply_count": 2,
  "view_count": 399,
  "created_date": null,
  "last_reply": "20130803T10:13:40-06:00",
  "posts": [
    {
      "post_id": "1166049",
      "post_title": "1912 S110 Baseball Silk Pillowcase with Cobb, Johnson & Mathewson, etc. SOLD",
      "post_author_name": "canjond",
      "post_content": "Up for sale is a budget-friendly large-sized, very scarce tobacco premium of Home Run Baker, Ty Cobb, Christy Mathewson, Walter Johnson and Tris Speaker.  Note that this S110 is the extremely scarce Johnson variation, as the majority of S110s feature O'Toole instead of Johnson.\n\nThe silk was intended to act as a decorative outward-facing surface for a pillow, and was only available by mail-in offer as the highest level premium from Helmar and Turkey Red via coupon exchange (over 100 coupons).\n\nAs can be seen in the photo, the silk does display fading (presumably from washing) and some very minor toning.  The fading is the worst around Baker's name (still 110% readable), and the toning is actually not all that evident at all.  In fact, there is only a slight bit between Johnson and the bats, and it appears to be a small water stain that could clean out nicely if one chooses to do so.  There is also evidence of 4 tack holes - one in each corner, presumably where the silk was once tacked to a wall.  Honestly, the silk is visually much much nicer than my iPhone photo presents it to be.  I will add better images as soon as possible.  \n\nWith a nice Johnson-variation S110 commanding $6k, this one is a budget bargain at $SOLD.\n\n[URL=http://s82.photobucket.com/user/jon_canfield/media/S110Johnson_zps1a32901c.jpg.html][IMG]http://i82.photobucket.com/albums/j263/jon_canfield/S110Johnson_zps1a32901c.jpg[/IMG][/URL]",
      "post_time": "20130803T08:11:00-06:00",
      "timestamp": "1375539060"
    },
    {
      "post_id": "1166070",
      "post_title": "",
      "post_author_name": "gnaz01",
      "post_content": "email sent.",
      "post_time": "20130803T09:07:09-06:00",
      "timestamp": "1375542429"
    },
    {
      "post_id": "1166098",
      "post_title": "",
      "post_author_name": "canjond",
      "post_content": "Greg-\n\nHope you're well.  I emailed you back.\n\n- Jon",
      "post_time": "20130803T10:13:40-06:00",
      "timestamp": "1375546420"
    }
  ]
}