{
  "id": "243364",
  "forum_id": "13",
  "title": "FS: T207 Mike Donlin!",
  "author": "timn1",
  "reply_count": 2,
  "view_count": 502,
  "created_date": null,
  "last_reply": "20170809T10:37:55-06:00",
  "posts": [
    {
      "post_id": "1688499",
      "post_title": "FS: T207 Mike Donlin!",
      "post_author_name": "timn1",
      "post_content": "SOLD!\n\nUpdate for the sake of accuracy: it was just gently pointed out to me that I had been reading the PSA Pop reports wrongly, so the numbers below are a bit off.  But Donlin is still among the top 5 fewest graded, and many less than the Lowdermilk, Lewis, and Miller.  \n______________________________________________________________\n\n\"Irving Lowdermilk\" and whoever notwithstanding, Mike Donlin is probably the greatest rarity of the T207 set.  \n\nCheck the pop reports.  PSA has graded 6 Donlins.  The next lowest number for any player is 9 (Butcher, Houser, Tyler).  Only 7 Irv Lewises without emblem have been graded, but 19 Irv Lewises overall.  For the sake of comparison, probably the most common card in the set is Walter Johnson, of which 115 have been graded by PSA!\n\nSGC is more complicated to add up since they are broken out by different backs, but 23 total Donlins are listed, as opposed to 28 Lowdermilks, 25 total Irv Lewises, and 108 Walter Johnsons.  \n\nSo anyway, the good news that I've got an extra Donlin with a nice readable Cycle back.  The bad news is that the front of the card has a little problem.  \n\n\n\n\nIt's hard to know how to value this card.  Please make an offer if interested.",
      "post_time": "20170808T10:44:09-06:00",
      "timestamp": "1502210649"
    },
    {
      "post_id": "1688544",
      "post_title": "T207 Donlin",
      "post_author_name": "timn1",
      "post_content": "I'm going to bump this once since the next post is clearly in the wrong section.",
      "post_time": "20170808T13:20:31-06:00",
      "timestamp": "1502220031"
    },
    {
      "post_id": "1688936",
      "post_title": "Donlin sold",
      "post_author_name": "timn1",
      "post_content": "Thanks BST!",
      "post_time": "20170809T10:37:55-06:00",
      "timestamp": "1502296675"
    }
  ]
}