{
  "id": "141900",
  "forum_id": "13",
  "title": "Advice/Authentication T206's HOF+ Others Full pics link inside...",
  "author": "Sean1125",
  "reply_count": 4,
  "view_count": 548,
  "created_date": null,
  "last_reply": "20110923T19:51:42-06:00",
  "posts": [
    {
      "post_id": "926556",
      "post_title": "Advice/Authentication T206's HOF+ Others Full pics link inside...",
      "post_author_name": "Sean1125",
      "post_content": "I have the opportunity to purchase these cards, but obviously I need to be extremely cautious moving on because I don't know much about tobacco cards or how to authenticate them. I've dealt with the guy before for some 50's-70's stars and he gave me the opportunity to purchase these cards.\n\nMy main question here would be authentication, the prices are pretty fair if the cards grade out, but obviously \"if it is too good to be true it probably is\"\n\nSome of them had paper loss on their back, and they come from a long time collector in arizona but my concerns are what they are. \n\nLet me know what you think.\n\nThanks.\n\nAll the pictures that I have been provided with can be located here...\n\n[L=Photobucket]http://s1122.photobucket.com/albums/l540/sean11251/Peyton%20Manning/[/L]",
      "post_time": "20110920T18:28:17-06:00",
      "timestamp": "1316564897"
    },
    {
      "post_id": "926566",
      "post_title": "",
      "post_author_name": "aquarius31",
      "post_content": "Hi Sean,\nI would recommend that you post this thread on the Main Pre WWII forum instead of B/S/T.\n\nThose cards look great and from the scans they definitely look legitimate (I think front/back combos also look good). The only thing that's hard to tell is whether some of them have some trimming...somewhat skeptical of sharp edges. You should also reference the very useful link on top of the Net54 pages titled \"Detecting Card Alterations and Reprints.\"\n\nAgain, would recommend you post on main forum so those who have more knowledge can chime in.\n\nGeorge",
      "post_time": "20110920T19:08:51-06:00",
      "timestamp": "1316567331"
    },
    {
      "post_id": "926571",
      "post_title": "look good to me",
      "post_author_name": "t206hound",
      "post_content": "The cards do look good to me, but every one of them appears to have scrapbook/glue residue on the back.  Doesn't detract from the appearance of the front, but from a technical grade perspective it is significant.",
      "post_time": "20110920T19:20:44-06:00",
      "timestamp": "1316568044"
    },
    {
      "post_id": "926627",
      "post_title": "",
      "post_author_name": "Jaybird",
      "post_content": "They are all legit to my eyes but I agree that the glue residue will knock them way down.  How much is uncertain but if I were buying these, I wouldn't rate them any higher than \"2\" for purchasing.  Maybe even lower.  So, if you value them as \"2\" then you should be fine.  If you buy them as \"4\" or \"5\", you're going to be disappointed if you ever try to grade or resell.  \n\nThe Chance and the MAthewson have paperloss on the back as well which brings them to at most a \"2\".  The Wajo Portrait has some weird discoloration above his head in the yellow area.  They all appear to have some major flaw to me.  \n\nI would ask this question.  Does this seller sell all of his other cards raw or graded.  If he sells his other cards graded, why aren't these graded?  To me these seem like cards that were in holders graded \"2\" or lower and he broke them out because they do have much better eye appeal than 2s.  But, you should just know what you're getting into.\n\nYou can PM me privately if you want to discuss further.  I'm not interested in any of the cards so you don't need to worry about that.\n\nGood luck.",
      "post_time": "20110921T06:41:36-06:00",
      "timestamp": "1316608896"
    },
    {
      "post_id": "927184",
      "post_title": "cards",
      "post_author_name": "Sean1125",
      "post_content": "I just wanted to provide an update, he is going to put several of the cards on consignment with me, his asking prices are pretty high but I kinda figure at the next show (tomorrow) it will help attract people to my table because they are beautiful cards on the front.\n\nIf anyone was interested in the cards shoot me a PM and I can get in contact with the buyer for you and field him your offer.\n\nSean",
      "post_time": "20110923T19:51:42-06:00",
      "timestamp": "1316829102"
    }
  ]
}