{
  "id": "121606",
  "forum_id": "13",
  "title": "Anyone want to Trade T206's?",
  "author": "WillowGrove",
  "reply_count": 0,
  "view_count": 204,
  "created_date": null,
  "last_reply": "20100310T20:15:47-06:00",
  "posts": [
    {
      "post_id": "789304",
      "post_title": "Anyone want to Trade T206's?",
      "post_author_name": "WillowGrove",
      "post_content": "I'm finally doing something I've looked forward to doing for years - I'm trying to complete my t206 set by trading my dupes to fellow collectors in return for the cards I need.\n\nMy want list that I put into excel earlier tonight was transfered from a handwritten list I wrote about 25 years ago.   So as I've mentioned before in my posts - I am in fact re-engaging with the hobby.  (that phrase is a running joke with my new bride)\n\nI'm sorry the list couldn't be uploaded in excel - but there are 4 columns - card number, name, team, and pose.  in some cases I didn't list the team and the pose was not applicable.  I hope you can follow it.\n\nI have not yet put the cards I have to trade in a list - but I have about 50 HOFers and 100 commons and will gladly review your want list.  Condition is mostly gd-vg with some clean vg-ex.  \n\nI'm looking for non-graded gd-vg or better cards in return.\n\nHope I can help you complete your set as well as complete mine.\n\nAnd no - I don't have the biggie's.  :)\n\nthis is my 3rd month on this site - and I love it.  great group.   thanks \n\nCard No.NameTeamPose\n14BarryPhil ALna\n37BridwellPortrait\n84DahlenBost, NLna\n89Demmitt St. Louis, ALna\n100DooinPhil, NLna\n101DoolanFielding\n110Doyle Throwing\n130FieneChic. ALPortrait\n155HinchmanClevelandna\n176F. JonesChic. ALPortrait\n182Karger\n194KonetchyWaiting Low Ball\n218LundgrenChic. NL\n**229MathewsonPortrait\n244McLean\n309SchaferDet.\n338SteinfeldPortrait\n350TannehillChic AL(not L. Tannehill)\n**387YoungPitching, front view\n\nMINOR LEAGUERS\n\n395BargerRoch.\n421DunnBalt\n426HallBalt\n428HannifanJC\n457PuttmanLouisville\n463SchlaflyNewark",
      "post_time": "20100310T20:15:47-06:00",
      "timestamp": "1268277347"
    }
  ]
}