{
  "id": "121208",
  "forum_id": "13",
  "title": "T206's Wanted",
  "author": "BBT206",
  "reply_count": 3,
  "view_count": 355,
  "created_date": null,
  "last_reply": "20100303T16:24:21-06:00",
  "posts": [
    {
      "post_id": "785970",
      "post_title": "T206's Wanted",
      "post_author_name": "BBT206",
      "post_content": "I am looking for the following T206's with different backs.   Email me at [url]b.brownbaseball@verizon.net[/url] if you can help me out.  Thanks, Bill\n\nO'Leary (Portrait)  SC 150 Fac 649, Sovereign 350, EPDG, Hindu\nWagner (Bat on Left Shoulder)  Sovereign 150, Sovereign 350, EPDG, Hindu\nWilhelm (Hands at Chest) Sovereign 150, Sovereign 350, EPDG\n\nDelehanty (Louisville) Cycle 350, EPDG, Polar Bear, Tolstoi\nFiene (Throwing) American Beauty 350, Cycle 350, EPDG, Polar Bear, Tolstoi\nGraham (St. Louis)  Sweet Caporal 350, Carolina Brights, Old Mill\n\nBradley (With Bat) American Beauty 350, American Beauty 460, Cycle 460, EPDG, Old Mill, Polar Bear, Tolstoi\nConroy (With Bat) Sovereign 350, American Beauty 460, Cycle 460, EPDG, Old Milll, Polar Bear, Tolstoi\nLake (St. Louis, No Ball) American Beauty 350, Cycle 460, EPDG, Polar Bear, Tolstoi\nPelty (Vertical) Sovereign 350, Cycle 460, EPDG, Polar\nWagner (Bat on Right Shoulder) American Beauty 350, American Beauty 460, Cycle 460, EPDG, Polar Bear\n\nBall (Cleveland)  American Beauty 460, Cycle 460, Old Mill, Polar Bear, Tolstoi\nDevore Cycle 460, EPDG, Old Mill, Polar Bear\nSheckard (Glove Showing) Cycle 460, EPDG, Old Mill, Polar Bear",
      "post_time": "20100226T18:32:45-06:00",
      "timestamp": "1267234365"
    },
    {
      "post_id": "785976",
      "post_title": "T206 Cards",
      "post_author_name": "bbsports",
      "post_content": "Hi- What different backs do you mean?",
      "post_time": "20100226T19:06:28-06:00",
      "timestamp": "1267236388"
    },
    {
      "post_id": "787239",
      "post_title": "T206 Backs Needed",
      "post_author_name": "BBT206",
      "post_content": "Just updated the list of backs that I need.  Hope you can help.  Thanks, Bill",
      "post_time": "20100303T15:04:36-06:00",
      "timestamp": "1267653876"
    },
    {
      "post_id": "787258",
      "post_title": "",
      "post_author_name": "RayBShotz",
      "post_content": "Bill - Graded or raw? What grade level are you looking for?\nRay",
      "post_time": "20100303T16:24:21-06:00",
      "timestamp": "1267658661"
    }
  ]
}