{
  "id": "330618",
  "forum_id": "13",
  "title": "The Scammer Is Back",
  "author": "1956 Fan",
  "reply_count": 3,
  "view_count": 627,
  "created_date": null,
  "last_reply": "20230123T09:25:33-06:00",
  "posts": [
    {
      "post_id": "2306629",
      "post_title": "The Scammer Is Back",
      "post_author_name": "1956 Fan",
      "post_content": "Most of you remember a guy last year who would contact you whenever you post a WTB listing. He would contact you and ask you to email him because he was too busy to get on the internet. Made no sense right? His email was the same. [url]jjamesajerry@gmail.com[/url]   I've seen him use Jerry James and James Jerry. He took a picture of a card I was looking for off ebay and sent it to my email. What an idiot. The card is listed on ebay for $750 and I told him the last one sold for $350 so I'd pay that. He immediately accepted. Knowing he was a well known scammer I had some fun with him and told him I would drive to pick up the card in person and pay cash. He did not want to do that and he would ONLY take Paypal FF as a payment method. Nothing else. \nI asked him to coin the card (knowing he didn't have it) and he kept telling me to send payment and he would coin it when he got home. Never did and now is ghosting. Not shocked, but I am going to send him and email letting him know that he is busted yet again. He continues to create new user names. His latest is stevenbarkley024\n\nMods may want to block. He has hit up several in this group trying to pull the same scam.",
      "post_time": "20230121T19:02:13-06:00",
      "timestamp": "1674352933"
    },
    {
      "post_id": "2306675",
      "post_title": "",
      "post_author_name": "Leon",
      "post_content": "Thanks for the heads up. He is now banned. I am unaware of any others being scammed by him, unless it's one that happened some months back.  \n.",
      "post_time": "20230121T22:53:01-06:00",
      "timestamp": "1674366781"
    },
    {
      "post_id": "2307024",
      "post_title": "",
      "post_author_name": "1956 Fan",
      "post_content": "[quote name=\"Leon\" post=2306675]Thanks for the heads up. He is now banned. I am unaware of any others being scammed by him, unless it's one that happened some months back.  \n.[/QUOTE]\n\nThank you sir. Yeah it was back in July. He tried to scam Ben several months ago. Check out the picture",
      "post_time": "20230123T01:02:50-06:00",
      "timestamp": "1674460970"
    },
    {
      "post_id": "2307095",
      "post_title": "",
      "post_author_name": "1956 Fan",
      "post_content": "He also does cut and paste to try to coin cards. Just avoid this guy all together.",
      "post_time": "20230123T09:25:33-06:00",
      "timestamp": "1674491133"
    }
  ]
}