{
  "id": "257466",
  "forum_id": "13",
  "title": "Deleted",
  "author": "Rhotchkiss",
  "reply_count": 12,
  "view_count": 806,
  "created_date": null,
  "last_reply": "20180716T17:57:50-06:00",
  "posts": [
    {
      "post_id": "1794683",
      "post_title": "Deleted",
      "post_author_name": "Rhotchkiss",
      "post_content": "Listing removed",
      "post_time": "20180713T20:01:32-06:00",
      "timestamp": "1531533692"
    },
    {
      "post_id": "1794697",
      "post_title": "",
      "post_author_name": "Leon",
      "post_content": "There was a group of around 96 sold in auction, all in SGC holders and in lone lot, some years ago. A board member won them.  Almost all, if not all, had numerical grades. There were lots of very high grades ones (most of them, if I recall correctly). I think they are the only ones I have seen with a number on them. That is where the one you mentioned came from, if there is one.",
      "post_time": "20180713T20:39:50-06:00",
      "timestamp": "1531535990"
    },
    {
      "post_id": "1794701",
      "post_title": "",
      "post_author_name": "Rhotchkiss",
      "post_content": "Right.  There was once a near complete set that was found and I think sold for a lot of money.  I believe the REA description mentions it.  And you  are right, that is probably the Heine Wagner graded 86 on the SGC report.  Man would I love to see that set!",
      "post_time": "20180713T20:49:43-06:00",
      "timestamp": "1531536583"
    },
    {
      "post_id": "1794712",
      "post_title": "",
      "post_author_name": "Brian Van Horn",
      "post_content": "As I recall, Masson won the set or near set for just under $1 million at the 2007 National in Cleveland.",
      "post_time": "20180713T21:46:10-06:00",
      "timestamp": "1531539970"
    },
    {
      "post_id": "1794725",
      "post_title": "Wow",
      "post_author_name": "823dek",
      "post_content": "nice card...if ya wanted to sell off a bunch of stuff ferme I'd be interested but with needing new cabinets in the kitchen... I would be on the firing squad..every penny worth it (THE CARD)",
      "post_time": "20180713T23:01:41-06:00",
      "timestamp": "1531544501"
    },
    {
      "post_id": "1794733",
      "post_title": "",
      "post_author_name": "Sean",
      "post_content": "[quote name=\"Brian Van Horn\" post=1794712]As I recall, Masson won the set or near set for just under $1 million at the 2007 National in Cleveland.[/QUOTE]\n\nYes, $960,000 for 96 cards, including both versions of Bobby Byrne. He was only missing Danny Murphy to complete the set. I'm pretty sure that it was a Mastronet auction.",
      "post_time": "20180714T03:28:11-06:00",
      "timestamp": "1531560491"
    },
    {
      "post_id": "1794807",
      "post_title": "",
      "post_author_name": "Kawika",
      "post_content": "The Pirate cards were indeed sold by the Mastro crew at a live auction concurrent with the 2008 National. The event was held at the ESPN Zone, a bigtime sports bar in downtown Chicago. What a grand evening that was. We rode in from Rosemont on a chartered bus. I shared a seat with dear old Jim Blumenthal. We checked out each other's collections on our iPhones like a couple of 12 year old kids; the last card in his electronic deck was a T206 Wagner. God rest ya, Jim. Sat with Blumie, Sarno and Prize-ner, wimped out on the one item I really, really wanted (a 1912 Pach Bros team picture of the NYG), and watched in stupid awe as Richard M sat back in his chair and lifted his index finger a quarter-inch or so to indicate another increment toward the stratosphere. He was the picture of assuredness, the Cool Hand Luke of the hobby on that night. Not everyone can spend seven figures on baseball cards. I was impressed.\n\nSome of you who have been around N54 for a while might remember the blog I posted of my week in Chicago. It's buried somewhere in the archives along with the Bruces. Here is a link to my photos at ImageEvent for those who are interested. Might put you in the mood for the upcoming event in Cleveland. \n\n[url]http://imageevent.com/kawika_o_ka_pakipika/sportscardsetc/baseballtravels/thechicagonational[/url] pw = crazy08\nETA: I'll probably take off the guest password in a week or so. Don't want the whole world knowing I collect baseball cards. Some folks will see me holding a T206 Wagner and think I own one and I'll need a bodyguard.\n\nI was bummed bigly to flame out on the Pach Bros team portrait but wouldn't you know it, the same photo came up in a Goodwin auction a year or so later. I won it for a quarter of what it fetched in Chicago and I'm still loving it.\n\nGood luck to the OP. Hope the reminiscences of a geriatric collector aren't taken as a derailment of your BST endeavour. That's a damn fine looking exemplar of a super-rare card. If I were doing a back run I'd be all over it.\n\n[IMG]http://photos.imageevent.com/kawika_o_ka_pakipika/sportscardsetc/mischidden/miscellany2/huge/DSC06340.JPG[/IMG]",
      "post_time": "20180714T11:30:43-06:00",
      "timestamp": "1531589443"
    },
    {
      "post_id": "1794811",
      "post_title": "",
      "post_author_name": "Sean",
      "post_content": "Great story David. It deserves its own thread so that the whole Board will see it.   :)",
      "post_time": "20180714T11:45:40-06:00",
      "timestamp": "1531590340"
    },
    {
      "post_id": "1794815",
      "post_title": "",
      "post_author_name": "Kawika",
      "post_content": "Thanks, Sean. I got reminiscing and forgot that I was in a BST thread. At least the OP will get a bump or two from the derailment.",
      "post_time": "20180714T12:03:35-06:00",
      "timestamp": "1531591415"
    },
    {
      "post_id": "1794823",
      "post_title": "",
      "post_author_name": "Rhotchkiss",
      "post_content": "I don’t mind David, it’s all good publicity.",
      "post_time": "20180714T12:36:37-06:00",
      "timestamp": "1531593397"
    },
    {
      "post_id": "1794862",
      "post_title": "",
      "post_author_name": "asoriano",
      "post_content": "[quote name=\"Kawika\" post=1794807]\n\nSome of you who have been around N54 for a while might remember the blog I posted of my week in Chicago. It's buried somewhere in the archives along with the Bruces. Here is a link to my photos at ImageEvent for those who are interested. Might put you in the mood for the upcoming event in Cleveland. \n\n/IMG][/QUOTE]\n\nDefinitely a trip down memory lane. Thanks for posting, Ka-vee-ka. :)",
      "post_time": "20180714T15:45:42-06:00",
      "timestamp": "1531604742"
    },
    {
      "post_id": "1795000",
      "post_title": "",
      "post_author_name": "MVSNYC",
      "post_content": "Ryan- good luck with sale.\n\nDavid- hope you’re well...that was a truly memorable event, and evening...glad to have shared it with you, Jim B, and Jeff.\n\nAnd super glad you finally did get your 1912 Giants photo.",
      "post_time": "20180715T08:24:00-06:00",
      "timestamp": "1531664640"
    },
    {
      "post_id": "1795448",
      "post_title": "",
      "post_author_name": "rjackson44",
      "post_content": "Looking at this card made me happy ,,terrific glws",
      "post_time": "20180716T17:57:50-06:00",
      "timestamp": "1531785470"
    }
  ]
}