{
  "id": "132959",
  "forum_id": "13",
  "title": "Update: Chief Bender Signed T206 W/ Out Trees.",
  "author": "blackmamba",
  "reply_count": 66,
  "view_count": 6018,
  "created_date": null,
  "last_reply": "20110216T17:47:26-06:00",
  "posts": [
    {
      "post_id": "868924",
      "post_title": "Update: Chief Bender Signed T206 W/ Out Trees.",
      "post_author_name": "blackmamba",
      "post_content": "Hey,\n\nI have a Chief Bender Signed T206. It does come with JSA LOA. I have lost several of your guys emails that were interested in this card. Sorry I have not got back with you. Anyways, The card is professional framed. I was told cost $100 alone. As you can see in the picture it is rough. I am looking for offers on this. I have several offers on the table including a auction site. Please no low balling. I do have legit offer well above $1,000. \n\nYou can email me or pm me. Email works best since im not always on here. Thanks Brandon\n\n[IMG]http://i886.photobucket.com/albums/ac67/kobelover24memorbilia/042-1.jpg[/IMG]\n[IMG]http://i886.photobucket.com/albums/ac67/kobelover24memorbilia/043-1.jpg[/IMG]\n\nHere is the COA/LOA. I will accept offers right now.\n[IMG]http://i886.photobucket.com/albums/ac67/kobelover24memorbilia/151.jpg[/IMG]",
      "post_time": "20110204T17:32:44-06:00",
      "timestamp": "1296865964"
    },
    {
      "post_id": "868927",
      "post_title": "",
      "post_author_name": "Pup6913",
      "post_content": "pm sent",
      "post_time": "20110204T17:41:38-06:00",
      "timestamp": "1296866498"
    },
    {
      "post_id": "868942",
      "post_title": "",
      "post_author_name": "shimozukawa",
      "post_content": ".",
      "post_time": "20110204T19:04:48-06:00",
      "timestamp": "1296871488"
    },
    {
      "post_id": "868948",
      "post_title": "Better yet...",
      "post_author_name": "T206Collector",
      "post_content": "How about a scan or pic of that LOA....",
      "post_time": "20110204T19:20:52-06:00",
      "timestamp": "1296872452"
    },
    {
      "post_id": "868951",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "Hey guys. The LOA is in the mail i should have it in by next week. I have not been getting any mail because of the snow storm that hit hard in Oklahoma. I will post a scan when i get it. The reason why i dont have it is the lady i got it from forgot to mail it in with the item. Sorry about that. Thanks Brandon",
      "post_time": "20110204T19:27:56-06:00",
      "timestamp": "1296872876"
    },
    {
      "post_id": "868972",
      "post_title": "",
      "post_author_name": "4815162342",
      "post_content": "Why would you sell it without the LOA in hand?",
      "post_time": "20110204T20:42:05-06:00",
      "timestamp": "1296877325"
    },
    {
      "post_id": "868974",
      "post_title": "",
      "post_author_name": "B O'Brien",
      "post_content": "Did one of these offers came from the buyer that backed out on the big lot on ebay too?\nSucky luck on those!\nBob",
      "post_time": "20110204T20:45:34-06:00",
      "timestamp": "1296877534"
    },
    {
      "post_id": "868976",
      "post_title": "",
      "post_author_name": "Pup6913",
      "post_content": "[quote name=\"blackmamba\" post=868951]Hey guys. The LOA is in the mail i should have it in by next week. I have not been getting any mail because of the snow storm that hit hard in Oklahoma. I will post a scan when i get it. The reason why i dont have it is the lady i got it from forgot to mail it in with the item. Sorry about that. Thanks Brandon[/QUOTE]\n\n\n:(  Sad.  I got 18\" and still got mail everyday.   OK needs to be a bit better on snow removal huh.  On the good side at least the cards worth $30-40 if the lady never mails the LOA.  Hope you get it soon;)",
      "post_time": "20110204T20:56:01-06:00",
      "timestamp": "1296878161"
    },
    {
      "post_id": "869004",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"Pup6913\" post=868976]:(  Sad.  I got 18\" and still got mail everyday.   OK needs to be a bit better on snow removal huh.  On the good side at least the cards worth $30-40 if the lady never mails the LOA.  Hope you get it soon;)[/QUOTE]\n\nWe have 21 inches as of today also with ice. My housing edition is so bad. No one can leave there house. You have been real negative on pm's, always making this card sound like it is worth like $1. It is really disrespectful to me. You need to stay off my thread. I would appreciate it. I expect no reply. Thank you.",
      "post_time": "20110204T23:04:14-06:00",
      "timestamp": "1296885854"
    },
    {
      "post_id": "869005",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"4815162342\" post=868972]Why would you sell it without the LOA in hand?[/QUOTE]\n\nJust looking for offers. I am not going to make a move till it is in hand. Thanks Brandon",
      "post_time": "20110204T23:06:00-06:00",
      "timestamp": "1296885960"
    },
    {
      "post_id": "869007",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"B O'Brien\" post=868974]Did one of these offers came from the buyer that backed out on the big lot on ebay too?\nSucky luck on those!\nBob[/QUOTE]\nLol, no. I actual sold my items t206hound. I have a legit offer. Thank you!",
      "post_time": "20110204T23:08:09-06:00",
      "timestamp": "1296886089"
    },
    {
      "post_id": "869009",
      "post_title": "",
      "post_author_name": "shimozukawa",
      "post_content": ".",
      "post_time": "20110205T01:47:08-06:00",
      "timestamp": "1296895628"
    },
    {
      "post_id": "869021",
      "post_title": "",
      "post_author_name": "Pup6913",
      "post_content": "[quote name=\"blackmamba\" post=869004]We have 21 inches as of today also with ice. My housing edition is so bad. No one can leave there house. You have been real negative on pm's, always making this card sound like it is worth like $1. It is really disrespectful to me. You need to stay off my thread. I would appreciate it. I expect no reply. Thank you.[/QUOTE]\n\nBrandon I have no issue posting the PM's you and I had back and forth.  Any board members want to see then I will be happy to forward them to you BTW.  The fact that I spent about an hr discussing the card and giving you links to others to help you determine a real price is not negative but more on the helpful side right:confused:  I made an offer of $250-$400 did I not.  And I also told you that since this was not my area of collection it was no big deal to me.  I told you that an offer of 2k for the card was great and you should take it and run, because IMO the card is not worth that in its condition.  If the ADVICE and HELP I gave you is negative then I am sure you need to find another board where the ignorance of the collected hobby is at your level.  You haven't been here that long and seem to be a flake already.  Don't forget to trample more toes on your way out:cool:",
      "post_time": "20110205T05:58:11-06:00",
      "timestamp": "1296910691"
    },
    {
      "post_id": "869037",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"shimozukawa\" post=869009]Seems pretty obvious to me that he thinks it's worth a LOT more than $1... closer to 30-40 times that!\n\nAnd, for the record, the reason I asked about the LOA is you still haven't responded to the listing where you tried to sell the autopen Jordan for $100.[/QUOTE]\n\nHey lol, yea that guy is something. Just little things get under my skin. He's just disrespectful trying to get this card really cheap to resell. I don't roll with that. I give him the benefit of the doubt for sending me links but he is trying to get this card for a steal and saying that it's worth $250-400. When I told him I have an offer of $2,000. He was implieing it was bs. I'm done with drama and won't respond back to him.\n\nAnyways, I'm sorry If I have not gotten back to you buddy. I have been busy. I don't usually come on here. I check my emails frequently. Shoot me a email or a pm and I will get back to you. Sorry about that. Thanks",
      "post_time": "20110205T08:12:12-06:00",
      "timestamp": "1296918732"
    },
    {
      "post_id": "869058",
      "post_title": "",
      "post_author_name": "ChiefBenderForever",
      "post_content": "My guess is that the condition isn't a real factor in this type of card and all that really matters is that the auto is real.  While waiting for the LOA you should put the scan in the memorabilia section of the board and see what the auto experts over there think of the sig, they will be able to give some great feedback.",
      "post_time": "20110205T09:18:32-06:00",
      "timestamp": "1296922712"
    },
    {
      "post_id": "869065",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"JohnnyHarmonica\" post=869058]My guess is that the condition isn't a real factor in this type of card and all that really matters is that the auto is real.  While waiting for the LOA you should put the scan in the memorabilia section of the board and see what the auto experts over there think of the sig, they will be able to give some great feedback.[/QUOTE]\n\nHey, I did a couple weeks back. Had several emails and they said it looks real. We also compared it too his wife autograph (not even close). It has JSA. There is nothing to worry about on this one guys. Thanks for the info. Brandon",
      "post_time": "20110205T09:31:35-06:00",
      "timestamp": "1296923495"
    },
    {
      "post_id": "869070",
      "post_title": "Interested",
      "post_author_name": "usernamealreadytaken",
      "post_content": "...in the card. Maybe you can link to your post in the memorabilia section?",
      "post_time": "20110205T09:47:19-06:00",
      "timestamp": "1296924439"
    },
    {
      "post_id": "869074",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"usernamealreadytaken\" post=869070]...in the card. Maybe you can link to your post in the memorabilia section?[/QUOTE]\n\nHey, The link is below. There is not that much info given there. I was told to bring the card on here and try to sell it, but not on the memorabilia forum. I have learned i will not post anything intill i have the JSA in hand but i had several people waiting for a picture so i uploaded on here. Sorry for rattling you guys up. There is nothing to worry about. I have done deals on here and have over 100 feedback on other forums, also almost 700 positive feedback on ebay. Thanks Brandon\n\n[url]http://www.net54baseball.com/showthread.php?t=132269[/url]",
      "post_time": "20110205T09:53:57-06:00",
      "timestamp": "1296924837"
    },
    {
      "post_id": "869095",
      "post_title": "ok",
      "post_author_name": "usernamealreadytaken",
      "post_content": "Johnny asked: \"While waiting for the LOA you should put the scan in the memorabilia section of the board and see what the auto experts over there think of the sig, they will be able to give some great feedback.\" \n\nYou wrote: Hey, I did a couple weeks back. Had several emails and they said it looks real.\"\n\nI don't see that you posted any picture(of the card) in the memorabilia section? Don't you have pictures (of the LOA), links, scans, etc. from your purchase of this card? Eager to make strong offer, but disappointed I cannot based on what you have posted...",
      "post_time": "20110205T10:48:25-06:00",
      "timestamp": "1296928105"
    },
    {
      "post_id": "869099",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"usernamealreadytaken\" post=869095]Johnny asked: \"While waiting for the LOA you should put the scan in the memorabilia section of the board and see what the auto experts over there think of the sig, they will be able to give some great feedback.\" \n\nYou wrote: Hey, I did a couple weeks back. Had several emails and they said it looks real.\"\n\nI don't see that you posted any picture(of the card) in the memorabilia section? Don't you have pictures (of the LOA), links, scans, etc. from your purchase of this card? Eager to make strong offer, but disappointed I cannot based on what you have posted...[/QUOTE]\n\nI have no scans of the JSA LOA right now. I had emails and sent them pictures of the card. They said it look real, i said it is real. Comes with JSA LOA. Everyone needs to be patient right now with me. This snow storm really messed up mailing service in Tulsa. Once i have it, i will post the LOA on here for everyone to see. Thank you. I will get back to you all. Brandon.",
      "post_time": "20110205T11:00:06-06:00",
      "timestamp": "1296928806"
    },
    {
      "post_id": "869143",
      "post_title": "",
      "post_author_name": "MooseWithFleas",
      "post_content": "I find it interesting that Bender signed the card \"Chief\" when he had a known dislike for that moniker.",
      "post_time": "20110205T14:26:33-06:00",
      "timestamp": "1296941193"
    },
    {
      "post_id": "869157",
      "post_title": "",
      "post_author_name": "Pup6913",
      "post_content": "Brandon I do not like being called a liar or cheat so I am posting those horrible PM's.  I will not allow you to mislead and make a butt of me for you own cover.  Who has ever bought something like this with a LOA, with out getting a pic or the cert numbers.  You obviously got it from online hence the need to mail the COA.  So you must have gotten a scan of the card as well as seen the LOA or the cert numbers before buying right:confused:  So enough already.  I am not the only person that questions you and your validity.\n\n\nHere are the pm's  I have for your enjoyment gentlemen:\n\n\nQuote:\nOriginally Posted by Pup6913\nQuote:\nOriginally Posted by blackmamba\nQuote:\nOriginally Posted by Pup6913\nwhat are you asking for the card. Are you looking to trade and cash for the bender T206 auto\n\nI have an offer of $2,000. Looking for offers. I do not collect card anymore. Thanks\n\nIf you have an offer of 2K you better take it. At that price it is way out of what I have seen some autoed T206s in that condition sell for with harder to get autos. Since I do not pursue these its not that big of a deal for me. Best of luck on the sale.\n\nAndrew\n\nHey Andrew, I was thinking the same thing but i have several experts telling me that i should not sell it for that. Just wait. Signed T206 are rare and this could be the only one that exist. Thanks Brandon\n\nJust did a quick search. There was a lot of 8 autoed common t206's sold for about $2600 with a bender no trees 3 yrs back. A cobb green portrait in vg-ex for $3800, and another lot of 6 extremely rare HOF'ers for $6900. That card is probably worth about $250-$400 tops. Just my opinion based on market sales. Condition is everything. I would like to make an offer but no where near the 2k mark.\n\nHmmm, where are you getting this info? I have seen a Ty cobb red portrait went for $30k and some commons go for $500-800 range. Where did you find that Chief Bender at??? Thanks\n\nIt was heritage and mastro and some others.\n\nGot the link of the Bender and Cobb? Thanks\n\n\nThing is anyone can tell you to price a card like that but none of them made an offer did they?? Should be a sign that its to high. I have learned that lesson many times. I have the only ray brubaker auto known in the hobby on a 1920's zeenut a few yrs before he died and its only worth about $30-50.\n\nI am sorry it was 3 cheif meyers and 2 hoblitzells and a few others all in vg-ex to exmt. \n[url]http://www.huntauctions.com/online/i...=630&lot_qual=[/url]\n\nand here is that beautiful cobb\n[url]http://www.huntauctions.com/online/i...664&lot_qual=a[/url]\n\nThank you. That Cobb went for a great deal.! Anyways I might take the $2,000 but might wait a little bit to see if anyone can beat it. Thanks\n\nI have 4 Legit offers. $1200, 2 $1500 offers and $2000. Those arn't what someone told me to price them at. I do know what your talking about though. I am not in that position right now.",
      "post_time": "20110205T14:56:14-06:00",
      "timestamp": "1296942974"
    },
    {
      "post_id": "869164",
      "post_title": "",
      "post_author_name": "Pup6913",
      "post_content": "And just for giggles some pics of benders autos.",
      "post_time": "20110205T15:08:24-06:00",
      "timestamp": "1296943704"
    },
    {
      "post_id": "869193",
      "post_title": "",
      "post_author_name": "David R",
      "post_content": "[quote name=\"Pup6913\" post=869164]And just for giggles some pics of benders autos.[/QUOTE]\n\nI am no autograph expert but to me at least the \"h\" and \"f\" in Chief in your examples look different than the ones on the card.",
      "post_time": "20110205T16:15:58-06:00",
      "timestamp": "1296947758"
    },
    {
      "post_id": "869195",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"David R\" post=869193]I am no autograph expert but to me at least the \"h\" and \"f\" in Chief in your examples look different than the ones on the card.[/QUOTE]\n\nIt was probably hard to signed on a little card. Every autograph is different. I can assure you it is real. it has JSA LOA, it will be scan asap. Thanks",
      "post_time": "20110205T16:21:38-06:00",
      "timestamp": "1296948098"
    },
    {
      "post_id": "869199",
      "post_title": "",
      "post_author_name": "richieb315",
      "post_content": "Check your mailbox...Can you please post it.\n[url]http://www.youtube.com/watch?v=1PtHyPME4cw[/url]",
      "post_time": "20110205T16:27:50-06:00",
      "timestamp": "1296948470"
    },
    {
      "post_id": "869203",
      "post_title": "",
      "post_author_name": "shimozukawa",
      "post_content": ".",
      "post_time": "20110205T16:33:04-06:00",
      "timestamp": "1296948784"
    },
    {
      "post_id": "869208",
      "post_title": "",
      "post_author_name": "terjung",
      "post_content": "I'm no autograph expert, but the on-card signature has enough differences from ones that are posted to give one pause.  (i.e. the loops touching on \"C\", the apparent pause in the \"C\" prior to making the first loop, the beginning stroke of the \"B\", etc.)   Interesting to note that there are no quotation marks around the \"Chief\" in your example.\n\nSuffice it to say that attaining that LOA from a respected source is going to be important for you.  Good luck!  I hope for your sake that it's real.",
      "post_time": "20110205T16:39:03-06:00",
      "timestamp": "1296949143"
    },
    {
      "post_id": "869209",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"shimozukawa\" post=869203]So, basically, JSA authenticated a Bender that wasn't signed by Bender's hand? I mean, I would assume that if his \"C\" loops usually didn't touch, and his \"B\" usually started at the top, then the T206 was signed by Bender after he... went on a bender?\n\nAnother thing about this card that has me wondering...\n\nThe Bender w/ no trees is a relatively rare card, so why wouldn't the \"old lady\" have the card authenticated along with the autograph? I mean, this is the logic I would assume for someone who knew nothing about the hobby...\n\n\"Wow! Dad left me a T206. Didn't those nuns just sell one for a million dollars??? I should try to sell mine! It has to be worth even more than that, because it's signed!!!\"\n\nThen someone would tell her that it needs to be authenticated. I'm pretty sure at this point, they wouldn't specifically say you need an LOA for James Spence. More than likely, if the dealer she went to had scruples, they'd explain about the autograph AND the card needing to have authentication to realize maximum value.\n\nI mean, does BGS/BVG make tier requirements according to book value of a MINT specimen or of the condition the card is actually in?\n\nIf it's the latter, it would have cost, what, an extra $25-$50 to have the card authenticated too... why just stop at the LOA? The entire concept of mounting/framing the card seems misdirected. After all, if the idea was to display it, she could have gotten it encapsulated, then put into a nice display case/box.\n\nJust my thoughts...[/QUOTE]\nYou have your right to your opinion. I know all the details though. I dont know if your trying to say that it is fake or not. I don't understand some of what you wrote. \n\nI believe the Bender with trees is the rare one. Correct me if im wrong. I will have you guys talk about this. I wont say anything unless i get a serious question about this card.  \n\nI will post the JSA when i get it. Can everyone be patient? I'm trying. lol I just want to prove it to you guys. I appreciate it. Thanks Brandon\n\nKeep it coming!",
      "post_time": "20110205T16:42:30-06:00",
      "timestamp": "1296949350"
    },
    {
      "post_id": "869211",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"terjung\" post=869208]I'm no autograph expert, but the on-card signature has enough differences from ones that are posted to give one pause.  (i.e. the loops touching on \"C\", the apparent pause in the \"C\" prior to making the first loop, the beginning stroke of the \"B\", etc.)   Interesting to note that there are no quotation marks around the \"Chief\" in your example.\n\nSuffice it to say that attaining that LOA from a respected source is going to be important for you.  Good luck!  I hope for your sake that it's real.[/QUOTE]\nHey, I do see what you are talking about. Just because the signature is not perfect does not make it fake. He did not always put \" \". It does have JSA, i regret posting this on here with out scans of it. I just had so much interested, and they wanted a picture. So i uploaded it on here. \n\nThank you. Brandon",
      "post_time": "20110205T16:48:41-06:00",
      "timestamp": "1296949721"
    },
    {
      "post_id": "869214",
      "post_title": "Brandon",
      "post_author_name": "Leon",
      "post_content": "Hi Brandon,\nCan you please PM me when you get a chance?\nthanks\nleon",
      "post_time": "20110205T16:53:21-06:00",
      "timestamp": "1296950001"
    },
    {
      "post_id": "869216",
      "post_title": "",
      "post_author_name": "novakjr",
      "post_content": "Are we even sure that by JSA the old lady was even referring to James Spence?  Maybe she had her neighbor Joe Salmons look at it, and write her a letter?  Maybe she's actually sending and old \"Justice Society of America\" comic? \n\nMamba, I'd suggest not trying to argue without having that LOA in your hand first.  You honestly shouldn't even have listed it without it.  And if you don't get it, I'd suggest sending it in for authentication, and not to GAI... Maybe even pull this thread, until you get it.",
      "post_time": "20110205T17:02:29-06:00",
      "timestamp": "1296950549"
    },
    {
      "post_id": "869224",
      "post_title": "",
      "post_author_name": "shimozukawa",
      "post_content": ".",
      "post_time": "20110205T17:37:53-06:00",
      "timestamp": "1296952673"
    },
    {
      "post_id": "869245",
      "post_title": "Brandon",
      "post_author_name": "Comiskey",
      "post_content": "Just so everybody knows, I bought 6 American beauty t206's from Brandon about a month ago and the transaction was flawless. And, he sold me great cards too!!\n\nJeff",
      "post_time": "20110205T18:30:05-06:00",
      "timestamp": "1296955805"
    },
    {
      "post_id": "869248",
      "post_title": "",
      "post_author_name": "ChiefBenderForever",
      "post_content": "Once authenticated 1500-2000+ would take about 20 minutes I would think.",
      "post_time": "20110205T18:42:58-06:00",
      "timestamp": "1296956578"
    },
    {
      "post_id": "869250",
      "post_title": "",
      "post_author_name": "shimozukawa",
      "post_content": ".",
      "post_time": "20110205T18:47:19-06:00",
      "timestamp": "1296956839"
    },
    {
      "post_id": "869254",
      "post_title": "",
      "post_author_name": "CMIZ5290",
      "post_content": "I agree with johnny. Alot of hostility on this particular post, however.",
      "post_time": "20110205T19:07:13-06:00",
      "timestamp": "1296958033"
    },
    {
      "post_id": "869255",
      "post_title": "",
      "post_author_name": "CMIZ5290",
      "post_content": "Also, there was a comment about why bender signed his nick name \"chief\". I have seen many psa authenticated balls with his signature just like that.",
      "post_time": "20110205T19:09:00-06:00",
      "timestamp": "1296958140"
    },
    {
      "post_id": "869304",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"Comiskey\" post=869245]Just so everybody knows, I bought 6 American beauty t206's from Brandon about a month ago and the transaction was flawless. And, he sold me great cards too!!\n\nJeff[/QUOTE]\n\nThank you Jeff! Glad you liked the cards!\n\nBest regards, Brandon",
      "post_time": "20110205T22:47:31-06:00",
      "timestamp": "1296971251"
    },
    {
      "post_id": "869305",
      "post_title": "",
      "post_author_name": "blackmamba",
      "post_content": "[quote name=\"shimozukawa\" post=869224]You're probably right about the rarity of the card. That would imply that the only thing of value being sold is the signature. If that's the case, an authenticated Bender index card goes for, what... $500? I think it would behoove you to follow Andrew's advice and sell it to whoever offered you $2000 before they decide to buy someone else's for less than half that.\n\nI still don't understand why _you_ would buy the card without having asked for a scan of the LOA (or at the VERY LEAST, the LOA number). I suggest submitting the card to BGS for encapsulation. Since you already have an LOA from, I'll assume, James Spence, you won't be required to pay for authentication once again. Just for the grading/authentication fee from BVG.[/QUOTE]\nI did have her send me a picture of the LOA. I did not save the email (stupid on my part). I'll keep in touch with you guys. Thanks",
      "post_time": "20110205T22:48:44-06:00",
      "timestamp": "1296971324"
    },
    {
      "post_id": "869355",
      "post_title": "",
      "post_author_name": "Jim VB",
      "post_content": "Tough week to be named Brandon or Brendan!",
      "post_time": "20110206T08:37:47-06:00",
      "timestamp": "1297006667"
    },
    {
      "post_id": "869763",
      "post_title": "",
      "post_author_name": "shimozukawa",
      "post_content": ".",
      "post_time": "20110207T17:27:12-06:00",
      "timestamp": "1297124832"
    },
    {
      "post_id": "869776",
      "post_title": "",
      "post_author_name": "CMIZ5290",
      "post_content": "SHIMO- YOU ARE UNBELIEVABLE! WHEN IS ENOUGH, ENOUGH? YOU WERE ALSO THE ONE THAT SEVERAL MONTHS AGO QUESTIONED ME SELLING A PSA 9MC 1953 TOPPS MANTLE! YOU DIDN'T EVEN KNOW THAT IT WAS ALREADY GRADED! I SAID IN MY COMMENTS OF THE CARD THAT IT HAD ALL THE CHARACTERISTICS OF A STRAIGHT PSA 9, BUT YOU COULD SAVE $70K IN PRICE BECAUSE OF THE QUALIFIER.  YOU REPLIED TO ME, WHY GIVE UP $70k? JUST GET THE CARD GRADED! DOES THAT RING A BELL?? GET ON WITH LIFE",
      "post_time": "20110207T17:48:08-06:00",
      "timestamp": "1297126088"
    },
    {
      "post_id": "869808",
      "post_title": "",
      "post_author_name": "shimozukawa",
      "post_content": ".",
      "post_time": "20110207T19:14:08-06:00",
      "timestamp": "1297131248"
    },
    {
      "post_id": "869857",
      "post_title": "",
      "post_author_name": "Jaybird",
      "post_content": "I have to agree that Shimo is on a bit of a witch hunt.  I understand that one of the great things about this forum is that we call people to task and point out the vagaries of the hobby.\n\nHowever, this is a bit over the top.  Let's just either wait for Brandon to respond or let it die.  \n\nI also find it more than a bit unnerving that Shimo is doing the nitpicking considering that he never responded to the question of his numerous bid retractions on ebay which is certainly a questionable practice.  I've been on ebay for 10 years and don't think I've ever retracted a bid.  I feel like I'm seeing rocks hurled from the proverbial glass house.",
      "post_time": "20110207T23:06:31-06:00",
      "timestamp": "1297145191"
    },
    {
      "post_id": "869859",
      "post_title": "",
      "post_author_name": "lharri3600",
      "post_content": "Ouch!!\n\n[quote name=\"jaybird\" post=869857]i have to agree that shimo is on a bit of a witch hunt.  I understand that one of the great things about this forum is that we call people to task and point out the vagaries of the hobby.\n\nHowever, this is a bit over the top.  Let's just either wait for brandon to respond or let it die.  \n\nI also find it more than a bit unnerving that shimo is doing the nitpicking considering that he never responded to the question of his numerous bid retractions on ebay which is certainly a questionable practice.  I've been on ebay for 10 years and don't think i've ever retracted a bid.  I feel like i'm seeing rocks hurled from the proverbial glass house.[/quote]",
      "post_time": "20110207T23:37:56-06:00",
      "timestamp": "1297147076"
    },
    {
      "post_id": "869861",
      "post_title": "",
      "post_author_name": "shimozukawa",
      "post_content": ".",
      "post_time": "20110208T00:43:24-06:00",
      "timestamp": "1297151004"
    },
    {
      "post_id": "869908",
      "post_title": "",
      "post_author_name": "terjung",
      "post_content": "[quote name=\"shimozukawa\" post=869861]\nAs for the witch hunt, Brandon and I are discussing it via PMs. He said he's not going to respond in this thread anymore, so I see no point to posting anymore in it either.[/QUOTE]\n\nDoes that mean that he has no JSA LOA for the Bender card?",
      "post_time": "20110208T08:49:54-06:00",
      "timestamp": "1297180194"
    },
    {
      "post_id": "869911",
      "post_title": "",
      "post_author_name": "kcohen",
      "post_content": "I've been wondering at what point, if any, some of this side noise constitutes interference with a potential BST transaction.",
      "post_time": "20110208T08:51:14-06:00",
      "timestamp": "1297180274"
    },
    {
      "post_id": "869918",
      "post_title": "",
      "post_author_name": "Robextend",
      "post_content": "This all could have been avoided if nothing was posted on the B/S/T until the LOA was in hand.",
      "post_time": "20110208T09:13:54-06:00",
      "timestamp": "1297181634"
    }
  ]
}