{
  "id": "112431",
  "forum_id": "13",
  "title": "SOLD -- T212-3 Buck Weaver VG/EX",
  "author": "three25hits",
  "reply_count": 7,
  "view_count": 693,
  "created_date": null,
  "last_reply": "20090527T21:45:24-06:00",
  "posts": [
    {
      "post_id": "724600",
      "post_title": "SOLD -- T212-3 Buck Weaver VG/EX",
      "post_author_name": "three25hits",
      "post_content": "I acquired this card from Leon in Cleveland 2004*. The MK is due to a factory mark on the back, typical of the issue. What you see is what you get.\n \nHappy to answer any questions. \n \n\n \n* edited to correct Cleveland's year (was '04 not '05)...\n \n[IMG]http://home.insightbb.com/~scantland/ebayaboutme/psa4weaver.jpeg[/IMG]",
      "post_time": "20090518T19:07:55-06:00",
      "timestamp": "1242695275"
    },
    {
      "post_id": "724796",
      "post_title": "",
      "post_author_name": "Jacklitsch",
      "post_content": "Curious as to how you think this may cross over to SGC. Sure looks good for the assigned grade.",
      "post_time": "20090520T05:20:42-06:00",
      "timestamp": "1242818442"
    },
    {
      "post_id": "724878",
      "post_title": "",
      "post_author_name": "three25hits",
      "post_content": "[quote name=\"Jacklitsch\" post=724796]Curious as to how you think this may cross over to SGC. Sure looks good for the assigned grade.[/QUOTE]\n\nSteve,\n\nI had SGC look at the card at the Chicago National in '05.  At the time, they were treating the factory stamp as ink, and it would only cross to a VG 3 at that point.\n\nAs you, tbob, leon, scott (any of the obak collectors), know -- SGC has moved their policy and I am unsure if its yet clarified.\n\nI have Obaks graded Nr/Mt by SGC with a factory stamp.  I also have EX and better Obaks in VG 3 SGC slabs.  I also have a few cards in SGC slabs of EX or higher with no mention of the factory stamp -- and yet there is a stamp (to me, this is the most frustrating).  I haven't made a submission in four years, so I have about 60 cards total for review once clarity is given by the guys in NJ.  Unfortunately, you can't by an SGC Obak without a back scan as the label/guidelines have moved so frequently over the years...\n\nTo specifically answer your question, this Weaver is VG/EX.  If SGC labels the card \"Stamped Back\" and then assigns a technical grade independent, it should cross easily (possibly a bump, as I have seen SGC 5 Obaks in similar condition but its probably best in a 4 holder).  If the current whim is to downgrade due to the factory stamp, it will only cross to a VG 3.\n\n\nBrian",
      "post_time": "20090520T12:26:12-06:00",
      "timestamp": "1242843972"
    },
    {
      "post_id": "724882",
      "post_title": "current policy",
      "post_author_name": "Leon",
      "post_content": "I can't speak for SGC but their new policy seems to take factory stamps into consideration and NOT downgrade them for it. I would call Michael over there and get him to let you speak with one of the graders about it. My feeling is they should not downgrade it due to a factory stamp.....however, my feeling and a quarter won't buy you anything anymore....:eek:\n \n[IMG]http://luckeycards.com/pd310stinson.jpg[/IMG]",
      "post_time": "20090520T12:39:47-06:00",
      "timestamp": "1242844787"
    },
    {
      "post_id": "724886",
      "post_title": "",
      "post_author_name": "three25hits",
      "post_content": "Leon, great card.  My D310 Weaver also has the Aldon stamp.\n\nI know this is the case for some cards, and I agree with the grade/label on your card.  I hope it is policy going forward.  I just haven't gotten around to giving them a call for clarification.  I generally buy & hold, and don't submit often.\n\nAs a buyer, one has to be prepared for all scenarios.\n\nBrian",
      "post_time": "20090520T12:53:50-06:00",
      "timestamp": "1242845630"
    },
    {
      "post_id": "724974",
      "post_title": "",
      "post_author_name": "three25hits",
      "post_content": "Just heard from someone at SGC -- here is the message\n\n\n\n[QUOTE]The factory stamp now does not affect the grade, so you can have an SGC 84 (Stamped Back)[/QUOTE]\n\n\n\nI will be sending SGC a large submission shortly due to this clarification.  Thanks for the prompt & personal response from SGC.\n\nAlso, I believe this Weaver will cross to an SGC VG/EX (Stamped Back) unless I totally missed something...\n\nBrian",
      "post_time": "20090520T19:34:41-06:00",
      "timestamp": "1242869681"
    },
    {
      "post_id": "725034",
      "post_title": "",
      "post_author_name": "dstudeba",
      "post_content": "They will also now put Aldon Candy Company on D310s like Leon's above.\n\n[IMG]http://www.baseballcardresource.com/img/11D310/slabs/11D310_Sheehan_SGC30_A.jpg[/IMG][IMG]http://www.baseballcardresource.com/img/11D310/slabs/11D310_Sheehan_SGC30_B.jpg[/IMG]",
      "post_time": "20090521T08:39:08-06:00",
      "timestamp": "1242916748"
    },
    {
      "post_id": "726124",
      "post_title": "",
      "post_author_name": "three25hits",
      "post_content": "Card is sold -- I didn't see a way to edit the title of the thread.\n\nThanks",
      "post_time": "20090527T21:45:24-06:00",
      "timestamp": "1243482324"
    }
  ]
}