{
  "id": "123800",
  "forum_id": "13",
  "title": "FS T206 HOFers Johnson Portrait and Waddell Throwing",
  "author": "Edwolf1963",
  "reply_count": 2,
  "view_count": 780,
  "created_date": null,
  "last_reply": "20100519T17:19:29-06:00",
  "posts": [
    {
      "post_id": "808197",
      "post_title": "FS T206 HOFers Johnson Portrait and Waddell Throwing",
      "post_author_name": "Edwolf1963",
      "post_content": "FS - T206 Walter Johnson Portrait (Yellow Background).  Piedmont 150 back, beautiful image of face and uniform, deep yellow background!  SGC10 grade bcse someone erased his name at the bottom and wrote in \"W. Johnson\" and \"P\" after Washington.  Minor surface wrinkling at the top you have to hold at an angle to see.  Back is relatively clean, centered - small amt of paper loss on left border.  $240.\n\nRube Waddell Portrait - Sovereign 350 back.  Nice image, well centered both front and back (see scans), very faint surface wrinkle on the back you can only see under magnifying glass.  $185. **SOLD**\n\nRube Waddell Throwing - Piedmont 150 back.  Another great image and well-centered both front and back.  Small surface wrinkle at top, again - hard to see unless you hold at angle or under magnification. $125.\n\nAll prices are delivered, PayPal \"Payment Owed\", Check or MO.  Email or post reply first.\n\nThank you for viewing/considering!",
      "post_time": "20100515T11:31:47-06:00",
      "timestamp": "1273944707"
    },
    {
      "post_id": "808425",
      "post_title": "Added Waddell Cards",
      "post_author_name": "Edwolf1963",
      "post_content": "**Bump** to reflect one and only price change on Walter Johnson card.  Added Rube Waddell cards (Throwing and Portrait) as well.",
      "post_time": "20100516T10:50:43-06:00",
      "timestamp": "1274028643"
    },
    {
      "post_id": "809740",
      "post_title": "Price reduction on Waddell Throwing, Portrait Sold",
      "post_author_name": "Edwolf1963",
      "post_content": "**Bump** to reflect price reduction on Waddell Throwing, Waddell Portrait sold.",
      "post_time": "20100519T17:19:29-06:00",
      "timestamp": "1274311169"
    }
  ]
}