{
  "id": "232018",
  "forum_id": "13",
  "title": "Looking for a T207 Ferry Anonymous back",
  "author": "Luke",
  "reply_count": 3,
  "view_count": 265,
  "created_date": null,
  "last_reply": "20161204T19:57:28-06:00",
  "posts": [
    {
      "post_id": "1607469",
      "post_title": "Looking for a T207 Ferry Anonymous back",
      "post_author_name": "Luke",
      "post_content": "Need this card to complete my little back run.  Can buy or have a lot of similar cool T207s or T206s to trade.",
      "post_time": "20161203T21:06:08-06:00",
      "timestamp": "1480824368"
    },
    {
      "post_id": "1607650",
      "post_title": "The Ferryman",
      "post_author_name": "frohme",
      "post_content": "Hey Luke,\n\nNo such beast in T207 - Ferry isn't known with that back.  Is with blank back, but not with Anon.\n\n--\nMike",
      "post_time": "20161204T16:50:40-06:00",
      "timestamp": "1480895440"
    },
    {
      "post_id": "1607664",
      "post_title": "",
      "post_author_name": "Luke",
      "post_content": "Well, that would mean I'm done.  Kind of anticlimactic.  I was under the impression that all Recruit series cards were possible with an Anon back.  Is this wrong, or would you expect an Anon Ferry to exist out there somewhere (or at least to have been printed)?",
      "post_time": "20161204T17:33:22-06:00",
      "timestamp": "1480898002"
    },
    {
      "post_id": "1607718",
      "post_title": "The Anon Recruits",
      "post_author_name": "frohme",
      "post_content": "Hey Luke,\n\nFor some time, the idea that all 150 Recruits are possible with the Anon (Factory 3) back has been falling away.  In 2004, based on his survey and analysis as published in VCBC #37,38, Tim Newcomb hypothesized that only 50 Recruit-class cards would be found with that back.\n\nAs of today, only 49 have been cataloged:\n\nBoston Amer: Carrigan, Cicotte, Engle, Hageman, Hall, Hooper, Lewis, Nunamaker, Speaker, Thomas, Wagner, Wood\nBoston Nat: Gowdy, Kling, McDonald, Perdue, Spratt\nBrooklyn Nat: Higgins, Knetzer, Northen, Rucker, Schardt, Tooley\nChicago Amer: Block, Bodie, Collins, Lord, McIntyre, Scott, Sullivan, Zeider\nCinn Nat: Fromme, Mitchell, Smith\nCleveland Amer: Easterly, George\nPhila Nat: Graham\nPittsburg Nat: Leach, Leifield, McKechnie\nSt Louis Amer: Hallinan, Hamilton, Hogan, Stovall, Wallace\nSt Louis Nat: Steele, Wingo\nWashington Amer: Henry, Morgan\n\nChicago Nat: (none)\nDetroit Amer: (none)\nNew York Nat: (none)\nNew York Amer: (none)\nPhila Amer: (none)\n\nVarious theories have been made of which would/might be the 50th... as of yet, none has surfaced.  A collection containing all 49 (and all 50 of the Broadleaf-class cards) sold at auction in late 2012.\n\nWhen looking at which cards might be in or out as candidates for the missing man - for many of the teams, the answer seems startingly clear... the Recruits which show up with the Anon 3 back are printed with the same color and insignia scheme as the Broadleaf class cards - the others (and the ones for which T207 gets its ugly/drab reputation) are not.\n\nSome teams are obvious: \n  * Boston (both), Pittsburg, Washington have clear color differences\n  * Some are more subtle ... e.g. Chi-Amer has the Sox logo for most... Clev has the small (black) 'C'...\n  * Some are just puzzling, and \n  * Brooklyn really is the odd man out/trend breaker (Rucker, Schardt vs Higgins, Knetzer, Northen, Tooley).\n\n\nYou can look at [URL=\"http://imageevent.com/gspinf/t207brownbackground/t207byteam\"]T207 grouped by team[/URL] to see some of the above.\n\nNot sure anyone has delved into this before, but there are clear differences between the groups of cards, not only color scheme but quality of both artwork and printing.  As if there might nave been either multiple generations (not just print runs) or even multiple lithographers.\n\n--\nMike",
      "post_time": "20161204T19:57:28-06:00",
      "timestamp": "1480906648"
    }
  ]
}