{
  "id": "162500",
  "forum_id": "13",
  "title": "Signed T205/T206",
  "author": "margoaepi",
  "reply_count": 12,
  "view_count": 966,
  "created_date": null,
  "last_reply": "20130203T21:51:36-06:00",
  "posts": [
    {
      "post_id": "1080967",
      "post_title": "Signed T205/T206",
      "post_author_name": "margoaepi",
      "post_content": "I have a signed T205 Ed Walsh and a signed T206 Rube Marquard (with both arms showing).  The cards can be seen here:\n\n[url]http://www.flickr.com/photos/margoaepi/8192336727/in/set-72157632032860080[/url]\n\n[url]http://www.flickr.com/photos/margoaepi/8192337849/in/set-72157632032860080[/url]\n\nI am generally not a seller of anything and have no idea what I would even want for these, but given the recent prices that signed tobacco cards have been generating, I thought I'd see if anyone was interested and what their offers would be.  Feel free to email me at [url]joshmargolin@gmail.com[/url].  In the interests of full disclosure, I should add that I may decide not to part with these at all.\n\nI would consider a trade, but it would have to be for 1 or 2 cards rather than a lot of bits and pieces.  Since I have been asked, I would be interested in trading for a worthwhile Jennings or Cobb item.  I would also like a T227 Baker, and am in the market for a nice T205 Young/Johnson/Bresnahan Mouth Open/Joss.  I am kind of an all over the place collector though, so I will happily look at whatever you have to offer.  Cash is king however.\n\nThanks all.",
      "post_time": "20130130T09:32:30-06:00",
      "timestamp": "1359563550"
    },
    {
      "post_id": "1081239",
      "post_title": "",
      "post_author_name": "benderbroeth",
      "post_content": "Pm sent",
      "post_time": "20130130T19:03:24-06:00",
      "timestamp": "1359597804"
    },
    {
      "post_id": "1081245",
      "post_title": "",
      "post_author_name": "HRBAKER",
      "post_content": "Josh,\nBeautiful cards, you should have a lot of interest.\nGood luck.",
      "post_time": "20130130T19:14:44-06:00",
      "timestamp": "1359598484"
    },
    {
      "post_id": "1081247",
      "post_title": "",
      "post_author_name": "margoaepi",
      "post_content": "[quote name=\"HRBAKER\" post=1081245]Josh,\nBeautiful cards, you should have a lot of interest.\nGood luck.[/QUOTE]\n\nThanks Jeff.  Not sure if I want to get rid of them, but we'll see . . .",
      "post_time": "20130130T19:16:42-06:00",
      "timestamp": "1359598602"
    },
    {
      "post_id": "1082966",
      "post_title": "",
      "post_author_name": "margoaepi",
      "post_content": "Just a little Super Bowl bump.",
      "post_time": "20130203T08:42:44-06:00",
      "timestamp": "1359906164"
    },
    {
      "post_id": "1083052",
      "post_title": "price",
      "post_author_name": "thehoodedcoder",
      "post_content": "if you are not getting the interest you want, that says there may be a price problem.\n\nmy offer still stands.\n\nkevin",
      "post_time": "20130203T11:31:44-06:00",
      "timestamp": "1359916304"
    },
    {
      "post_id": "1083063",
      "post_title": "",
      "post_author_name": "EvilKing00",
      "post_content": "what are the asking prices? i didnt see any",
      "post_time": "20130203T11:49:53-06:00",
      "timestamp": "1359917393"
    },
    {
      "post_id": "1083083",
      "post_title": "",
      "post_author_name": "margoaepi",
      "post_content": "[quote name=\"thehoodedcoder\" post=1083052]if you are not getting the interest you want, that says there may be a price problem.\n\nmy offer still stands.\n\nkevin[/QUOTE]\n\nKevin, thank you for your continued interest.  A few items:\n\n(1) As I made clear in my initial post, I am not even sure I am willing to sell and am testing the waters.  I have received several substantial offers for both cards and am thinking them over (thank you to all who have reached out with cash/trade offers).  While I think them over, I wanted to bump the post to make sure there wasn't someone who missed it.  I appreciate your concern over my 'pricing problem', but I think my economics are just fine.\n\n(2) I am certainly not one to call people out when they post a 1960's card in the pre-war section, but one thing that drives me nuts is when someone negatively posts on someone else's BST thread.  Of course you are welcome to point out fraud, but that is clearly not your intent.  You made your offer, I declined, there is no reason to make a negative comment on my thread.  Live and learn I hope, but I suspect probably not.",
      "post_time": "20130203T12:16:58-06:00",
      "timestamp": "1359919018"
    },
    {
      "post_id": "1083088",
      "post_title": "ball park",
      "post_author_name": "thehoodedcoder",
      "post_content": "wasn't a negative post. you keep bumping for a sale. im mentioning why you seem to have to keep bumping it.\n\nkevin",
      "post_time": "20130203T12:20:04-06:00",
      "timestamp": "1359919204"
    },
    {
      "post_id": "1083094",
      "post_title": "",
      "post_author_name": "margoaepi",
      "post_content": "I bumped once. Again, thanks for your analysis, but I can handle this on my own.",
      "post_time": "20130203T12:29:19-06:00",
      "timestamp": "1359919759"
    },
    {
      "post_id": "1083100",
      "post_title": "",
      "post_author_name": "chaddurbin",
      "post_content": "i think these are great, i was floored when josh first showed the walsh.  these seems to have really taken off, last year everyone was shocked when a common like marquard got up to 1k, and a couple years back you can get other guys for $200-$300.  \n\npaul have done a good job in bringing awareness and hoarding the market enough to drive up the prices on these.  also a bit of good timing with the signed rookie market have taken off.",
      "post_time": "20130203T12:38:30-06:00",
      "timestamp": "1359920310"
    },
    {
      "post_id": "1083127",
      "post_title": "",
      "post_author_name": "freakhappy",
      "post_content": "Nothing wrong with keeping the same price and bumping at the same time.  \n\nAlso, it takes time to sell some items...the right buyer has to see it first!\n\nGood luck on the sale, Josh!",
      "post_time": "20130203T13:35:27-06:00",
      "timestamp": "1359923727"
    },
    {
      "post_id": "1083349",
      "post_title": "",
      "post_author_name": "T206Collector",
      "post_content": "[quote name=\"chaddurbin\" post=1083100]paul have done a good job in bringing awareness and hoarding the market enough to drive up the prices on these.[/QUOTE]\n\n...except that it is now impossible to find a good price to buy these at!  It is nice to sell a few dupes at remarkable prices, but that these just aren't available any more is disappointing.  2012 was the first year since I started collecting these about 10 years ago that I didn't add a new signed pose to my T206 collection.  i'm stuck at 39, and may be there for quite some time....",
      "post_time": "20130203T21:51:36-06:00",
      "timestamp": "1359953496"
    }
  ]
}