{
  "id": "145724",
  "forum_id": "13",
  "title": "WTB/WTTF: T207 Birmingham and McCarthy",
  "author": "marcdelpercio",
  "reply_count": 3,
  "view_count": 236,
  "created_date": null,
  "last_reply": "20120519T14:40:34-06:00",
  "posts": [
    {
      "post_id": "952721",
      "post_title": "WTB/WTTF: T207 Birmingham and McCarthy",
      "post_author_name": "marcdelpercio",
      "post_content": "Been awhile since my last attempt so I will give it another shot.  I'm still looking for the final two cards to complete my T207 set.  I'm willing to buy for an even semi-reasonable price (yes, I know there has been a PSA 2 McCarthy on ebay for the past year for 3-4x the market value...not quite that desperate...yet) and I have a bunch of high quality trade material as well.  I would consider any condition, even a total beater.  These two shouldn't be this tough...but...you know those T207's.  Please send me a PM or e-mail to [url]marcdelpercio2000@yahoo.com[/url] if you have either of these available.  Thanks for looking!",
      "post_time": "20120103T20:49:42-06:00",
      "timestamp": "1325648982"
    },
    {
      "post_id": "952776",
      "post_title": "",
      "post_author_name": "AddieJoss",
      "post_content": "I believe I have a PDA 4 or 5 Birmingham.  I will confirm and let you know for sure this evening.  Are you willing to just pay SMR?  \nThanks,\nCory",
      "post_time": "20120104T06:16:01-06:00",
      "timestamp": "1325682961"
    },
    {
      "post_id": "953027",
      "post_title": "",
      "post_author_name": "marcdelpercio",
      "post_content": "Hi Cory,\nThanks for the response.  I don't really follow the SMR pricing but I am very familiar with the market values on the T207 set and am certainly willing to pay a reasonable price for the card.  Please send scans and an asking price to [url]marcdelpercio2000@yahoo.com[/url] if interested.  Thanks again!",
      "post_time": "20120104T21:41:19-06:00",
      "timestamp": "1325738479"
    },
    {
      "post_id": "995113",
      "post_title": "",
      "post_author_name": "marcdelpercio",
      "post_content": "Still looking for both of these cards.  I know there were a couple that were part of large lots in the recent REA auction, so if the winning bidder is looking to turn those around quickly, I'm your man.  I have plenty of quality trade bait and am willing to buy for any reasonable price as well.  Thanks!",
      "post_time": "20120519T14:40:34-06:00",
      "timestamp": "1337460034"
    }
  ]
}