{
  "id": "225563",
  "forum_id": "13",
  "title": "WTB/WTTF (FS) Ungraded T218s",
  "author": "david_l",
  "reply_count": 3,
  "view_count": 257,
  "created_date": null,
  "last_reply": "20160724T19:26:18-06:00",
  "posts": [
    {
      "post_id": "1562396",
      "post_title": "WTB/WTTF (FS) Ungraded T218s",
      "post_author_name": "david_l",
      "post_content": "Greetings,\n\nI'm trying to finish my T218 set and was hoping some of you could help. I'm looking for ungraded/non-slabbed cards from P to VG+ condition. As long as I can read to backs and see the image, I'll be happy. I don't care about the tobacco brand or the factory number.\n\nI also have bunch of T218 duplicates if anybody needs any. I can send you a list of what I have or you can message me. None have been professionally graded.\n\nI'm also interested in Ogdens Pugilists and the Hassan Arctic (T30) sets if anyone has any extra of those ungraded.\n\nI'm a new member on these boards but I have lots of good references on other hobbyist boards that I can point to. I'm willing to work with established members here. \n\nI may have a few non-T218 cards to trade for some of the more valuable T218 cards if needed.\n\n\nNeeded:\nThomas Hueston (billiards)\nAbe Attell (boxing)\nKnock-Out Brown (boxing)\nFrankie Conley (boxing)\nAl Delmont (boxing)\nBattling Hurley (boxing)\n\nWant to upgrade:\nLee R. Johns (bowling)\nPercy Sellen (track)",
      "post_time": "20160716T13:12:31-06:00",
      "timestamp": "1468696351"
    },
    {
      "post_id": "1564882",
      "post_title": "WTB/WTTF (FS) Ungraded T218s",
      "post_author_name": "Marslife",
      "post_content": "Hey David, \n\nnice job on the T218's tough set to finish there a so many of them!\n\nI have a few T30 dupes if u want to swap?\n\ndupes: #2;19;20;22;24 (numbers from Forbes book).\n\nTTYL!\n\nCliff",
      "post_time": "20160723T14:45:53-06:00",
      "timestamp": "1469306753"
    },
    {
      "post_id": "1564958",
      "post_title": "",
      "post_author_name": "Aquarian Sports Cards",
      "post_content": "Pretty sure I have some of what you need, but it does grade higher than your stated range. LMK if I should dig them out. They are probably EX or thereabouts.",
      "post_time": "20160723T19:27:32-06:00",
      "timestamp": "1469323652"
    },
    {
      "post_id": "1565212",
      "post_title": "",
      "post_author_name": "david_l",
      "post_content": "Thanks all, I've gotten quite a few of the T218 cards I needed in the last week so I'm getting pretty close to finally completing this set. I don't think I need any higher grade cards right now.\n\n@marslife I hadn't heard of that Forbes book which is surprising because it looks great.\n\nI don't have any T30 dupes but if you want to trade for some T218s let me know ; )",
      "post_time": "20160724T19:26:18-06:00",
      "timestamp": "1469409978"
    }
  ]
}