{
  "id": "144520",
  "forum_id": "13",
  "title": "Scrapbook -  Auction closed",
  "author": "asphaltman",
  "reply_count": 16,
  "view_count": 1537,
  "created_date": null,
  "last_reply": "20111207T13:54:53-06:00",
  "posts": [
    {
      "post_id": "944377",
      "post_title": "Scrapbook -  Auction closed",
      "post_author_name": "asphaltman",
      "post_content": "-  Scrapbook T206 lot-  Best Offer\n\n\n- I am selling these for the owner.  However, he will have the final say if he's happy with the best price offered for the cards.\n\n- Because of logistics and the owner being up in age, don't expect to have these cards for three or four weeks.  Not much I can do about that.  \n\n- Before I got involved, he had one page of cards sent to a paper conservator to remove the cards without losing the backs.  So, that page I have not seen first hand, just the picture he took (which is the last one on the second post, with one of the Cobb Red's and the Marquard portrait).   Obviously I'd expect the cards on this page to be cleanly freed, but I do not know what methods a conservator uses...keep that in mind.\n\n- There are currently nine cards that had already come out of the pages on their own or perhaps with a little help.  Two of these are the Mathewsons.  One of these does have slight paperloss on the back that is difficult to see from the picture.\n\n- There are two Cobb red portraits, and again one is on the page that was sent to the conservator to remove.  I'd suspect it will be removed fine,  but as the buyer sight unseen,  you should probably suspect it isn't removed fine.\n\n-  This lot is being sold as is.  There are some decent looking cards, and some that look their age.   There is glue that is evident on some of the fronts I see.  That may soak off, from someone with much more experience than me.  As far as the backs...who knows.  I would suspect someone who is good at soaking these would have some fun.  \n\n- Again, sold as is means sold as is.  I don't want someone having buyer remorse or telling me these cards aren't in as good as condition as someone thought.   I tried to provide decent pictures other than the last pic on the last page of course that I didn't have access to.  But I don't want to bother this man who's in his 80's and have to worry with getting someone's money back and deal with sending cards back to him.   So again, SOLD AS IS.\n\n- As far as what history I know,  the owner is in his mid 80's.  From what I gathered someone in his family found them in a closet or attic space amongst a pile of other stuff.   The owner wasn't aware of them beforehand.  But he believes either his father or his grandfather would have put this together.  \n\n- I am accepting best offers.  Please don't email asking how much the owner would sell it for.   Also, please don't email about breaking up the cards,  he wants them to stay together.  \n\n- Please check the pictures carefully.  2 Cobbs, 2 Mattys, 1 Cy Young, 1 Walter Johnson, 1 Chance, 1 Flick, 1 Speaker, 2 Marquards,  couple Southern Leaguers -  \n\n- If interested, please send an offer by email.  It's fine if you want to send a private message here letting me know you've sent an email...but please send an actual email with your offer.  I'll end up forwarding the owner the best offer in the end for him to consider.   \n\n-  Again please understand even if the owner accepts an offer,  it's likely I won't have these in hand to send to you until after the holidays.  So no, I don't need payment right away.  But please keep in mind if you're making an offer that when the holidays would be over I don't want to have to worry with someone wanting to make payments at that point.  \n\n-  I'll accept offers until sometime mid-week.   I don't mind telling someone their offer is low so that they can move on to something else or decide on raising their offer.   I won't however tell anyone what the current high offer is.  That's just not fair to the person with the current best offer.  \n\nMy email is [url]cardstokeep@aol.com[/url]\n\n-  Please ask any questions necessary.   \n\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_7.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_8.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_9.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_12.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_14.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_1.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_17.jpg[/IMG]",
      "post_time": "20111203T21:24:53-06:00",
      "timestamp": "1322972693"
    },
    {
      "post_id": "944379",
      "post_title": "",
      "post_author_name": "asphaltman",
      "post_content": "[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_16.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_15.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_10.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_5.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_6.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_3.jpg[/IMG]\n[IMG]http://i691.photobucket.com/albums/vv276/cardstokeep/T206%20Scrapbook/T206_18.jpg[/IMG]",
      "post_time": "20111203T21:28:02-06:00",
      "timestamp": "1322972882"
    },
    {
      "post_id": "944381",
      "post_title": "offer",
      "post_author_name": "thescooper",
      "post_content": "pm sent",
      "post_time": "20111203T21:34:43-06:00",
      "timestamp": "1322973283"
    },
    {
      "post_id": "944382",
      "post_title": "",
      "post_author_name": "ruth-gehrig",
      "post_content": "PM sent and Offer sent to email.\nThanks,\nMichael",
      "post_time": "20111203T21:43:48-06:00",
      "timestamp": "1322973828"
    },
    {
      "post_id": "944384",
      "post_title": "offer",
      "post_author_name": "thescooper",
      "post_content": "second pm sent",
      "post_time": "20111203T21:49:26-06:00",
      "timestamp": "1322974166"
    },
    {
      "post_id": "944387",
      "post_title": "",
      "post_author_name": "3-2-count",
      "post_content": "Great item Dave. Question, just to confirm. All cards already removed shown are included as well correct?",
      "post_time": "20111203T22:03:26-06:00",
      "timestamp": "1322975006"
    },
    {
      "post_id": "944389",
      "post_title": "",
      "post_author_name": "asphaltman",
      "post_content": "[quote name=\"3-2-count\" post=944387]Great item Dave. Question, just to confirm. All cards already removed shown are included as well correct?[/QUOTE]\n\n\n\nHey Tony.  Yes, the nine cards shown that had already either come out or been took out are included.    That checklist the owner has that I posted should come up to 114.  \n\nTo try to be less confusing on the last picture on the second post,  what the owner has told me is the paper conservator has the page in hand but hasn't done anything with it yet due to a backlog he has.  So even though those cards will be included, I don't know if they'll stilll be attached to that page or not.\n\nBut yes....I think I've counted right at 114.  I did it a few times.",
      "post_time": "20111203T22:12:06-06:00",
      "timestamp": "1322975526"
    },
    {
      "post_id": "944394",
      "post_title": "",
      "post_author_name": "3-2-count",
      "post_content": "Thank you Dave..",
      "post_time": "20111203T22:26:34-06:00",
      "timestamp": "1322976394"
    },
    {
      "post_id": "944430",
      "post_title": "",
      "post_author_name": "scottglevy",
      "post_content": "Cool Find!  I love stuff like this.\n\nPM sent.\nS",
      "post_time": "20111204T07:44:24-06:00",
      "timestamp": "1323009864"
    },
    {
      "post_id": "944455",
      "post_title": "",
      "post_author_name": "bcbgcbrcb",
      "post_content": "Wow, that's an incredible amount of activity on a BST item in a very short period of time. Seems like more people on this board collect T206's than anything else.",
      "post_time": "20111204T09:21:28-06:00",
      "timestamp": "1323015688"
    },
    {
      "post_id": "944564",
      "post_title": "",
      "post_author_name": "asphaltman",
      "post_content": "Thanks for all the offers.  I don't want to rat out the high bidder's number - but let's just say bidding at this point is over 3k.  I'm getting a bunch of low dollar bids so hopefully this at least keeps anyone from not knowing if they should offer or not.\n\n\nThanks so much for the interest.  And again please ask any questions you may need.",
      "post_time": "20111204T17:24:49-06:00",
      "timestamp": "1323044689"
    },
    {
      "post_id": "944584",
      "post_title": "",
      "post_author_name": "bbcard1",
      "post_content": "I don't want to get in the fray, but will be a willing buyer for some that may not come out all that well.",
      "post_time": "20111204T18:18:09-06:00",
      "timestamp": "1323047889"
    },
    {
      "post_id": "945053",
      "post_title": "",
      "post_author_name": "asphaltman",
      "post_content": "Offers will be taken up until Wednesday evening,  6PM EST.  \n\n\nThanks -",
      "post_time": "20111206T05:24:48-06:00",
      "timestamp": "1323174288"
    },
    {
      "post_id": "945390",
      "post_title": "The Backs?",
      "post_author_name": "smokelessjoe",
      "post_content": "Hey Dave,   Do we have any idea where the scrapbook originated?   If so, that could sway my mind as to other back possibilites besides Piedmont and Sweet Caporal? \n \nAlso interesting that all nine of the loose card are 350 subjects only.   Could this have been put together in just 1910, and if so what other brands does that automatically rule in or rule out?\n\nI like how the cards were place in nice straight rows!\n\nThank you for any input.",
      "post_time": "20111207T08:03:52-06:00",
      "timestamp": "1323270232"
    },
    {
      "post_id": "945401",
      "post_title": "",
      "post_author_name": "asphaltman",
      "post_content": "The family has been in the Atlanta area since the early 1900's.   The scrapbook would have been put together in Georgia.\n\n\nAs far as the 350 subjects being the only ones showing as far as the loose cards,  that was brought to my attention early on and I don't have an answer as to how that would work.  I don't know if you put the album together in 1910 if predominately what you would have bought would have been 350 subjects or if you should still have a portion of 150 subjects mixed in...i'm not sure.  There are T206 experts that probably know much more about that than I do.",
      "post_time": "20111207T08:17:42-06:00",
      "timestamp": "1323271062"
    },
    {
      "post_id": "945495",
      "post_title": "",
      "post_author_name": "scottglevy",
      "post_content": "I wouldn't automatically conclude that it is a 350 subjects only distribution (much more likely to be a 150/350, 350 and 350/460 distribution).  But if you had reason enough to believe this to be true....the following backs are possible in a 350 only series:\n\nAmerican Beauty Frame\nBroad Leaf\nCarolina Brights\nCycle\nDrum \nEPDG\nOld Mill\nPiedmont\nPolar Bear\nSovereign\nSC Fact 25\nSC Fact 30\nTolstoi\n\nI would love to hear the findings from the eventual winner.\n\nBest Regards,\nScott",
      "post_time": "20111207T12:40:47-06:00",
      "timestamp": "1323286847"
    },
    {
      "post_id": "945511",
      "post_title": "",
      "post_author_name": "christopher.herman",
      "post_content": "[quote name=\"scottglevy\" post=945495]\nI would love to hear the findings from the eventual winner.[/QUOTE]\n\n+1",
      "post_time": "20111207T13:54:53-06:00",
      "timestamp": "1323291293"
    }
  ]
}