{
  "id": "323099",
  "forum_id": "13",
  "title": "8-B18 Blankets. HOF, Yellow, Purple, Catcher Pose",
  "author": "ricktmd",
  "reply_count": 2,
  "view_count": 294,
  "created_date": null,
  "last_reply": "20220814T11:52:06-06:00",
  "posts": [
    {
      "post_id": "2249364",
      "post_title": "8-B18 Blankets. HOF, Yellow, Purple, Catcher Pose",
      "post_author_name": "ricktmd",
      "post_content": "Offered here is what is left from a larger lot I came across plus a few others.\nFirst is a rare error blanket of Wheat (too bad its not a t206). The blanket is nice on the front but the back has a significant printing error \n2nd is sold. Nice blanket slightly light printing but readable in day light on both his name and pennants \n3rd is Sold with slightly light printing but his name is readable in daylight . The pennants are faint\n4th is Peckinpaugh. This one is nice with great clarity and color. Slightly light printing but readable\n5th is Graney Yellow Pennants. Always a tough find like most with yellow pennants . This one has great color and clarity and nice brown borders. It has a few darker spots in the white border. Tough great blanket\n6th sold. This one is really nice with a light stain on the front and evidence of tax stamp on the back \n7th O Miller. Tough catchers pose . This one is high grade with great color and clarity of his name. Pennants are a bit faint\n8th issold with Purple base Paths. This one is nice as well with great color, clarity , 4 nice brown borders . It does have a stain from the tax stamp on the back that shows light a slight dirty spot on the front. Open to offers on the lot or a group of more than 1. Individually\nWheat Error $72.00\nKeating       sold\nStengel HOF sold\nPeckinpaugh  sold\nGraney Yellow Pennants sold\nConnolly .     Sold\nO Miller         $25.00\nHamilton        sold",
      "post_time": "20220805T15:14:12-06:00",
      "timestamp": "1659734052"
    },
    {
      "post_id": "2249954",
      "post_title": "",
      "post_author_name": "ricktmd",
      "post_content": "Sunday discount on several. Bump",
      "post_time": "20220807T11:45:33-06:00",
      "timestamp": "1659894333"
    },
    {
      "post_id": "2252714",
      "post_title": "",
      "post_author_name": "ricktmd",
      "post_content": "2 sold. Plus additional discounts",
      "post_time": "20220814T11:52:06-06:00",
      "timestamp": "1660499526"
    }
  ]
}