{
  "id": "289116",
  "forum_id": "13",
  "title": "***SOLD*** FS: Raw T207 – George Moriarty, Broadleaf back ***SOLD***",
  "author": "HexsHeroes",
  "reply_count": 2,
  "view_count": 267,
  "created_date": null,
  "last_reply": "20200916T22:16:17-06:00",
  "posts": [
    {
      "post_id": "2017894",
      "post_title": "***SOLD*** FS: Raw T207 – George Moriarty, Broadleaf back ***SOLD***",
      "post_author_name": "HexsHeroes",
      "post_content": "Raw T207 Brown Background – George Moriarty, with Broadleaf back.\n\n\n(update)  Upon closer review, I found this card had a second crease, above Moriarity's right ear.  \n\nI also realized that interested members might not have noticed, or gauged the extent, of the first crease, at the bottom, crossing through the \"M\" in AMER.  I want to be transparent regarding the issues with this card.  I have posted a second image that better displays the two creases.  And I have dropped my asking price.  \n\nOne of the pitfalls of straying away from frequently viewing ones cards is that we either forget the flaws, or never realize how poorly we examined them upon purchasing them.  Regardless, I want the next owner to have no unpleasant surprises when they purchase this item.  Especially since I do not accept returns.  Trying to be both honest and transparent.\n\nWas $210, NOW $135 ***SOLD***  and I cover shipping via U.S.P.S. Priority Mail.  I would prefer payment via Paypal Family & Friends, but would accept check or money order (which must clear before I ship).\n\nFirst person to contact me that they'll take it, and pays for it, gets it.  \n\nThanks\nVincent\n.\n.",
      "post_time": "20200915T18:10:19-06:00",
      "timestamp": "1600215019"
    },
    {
      "post_id": "2017904",
      "post_title": "",
      "post_author_name": "jjp3rd",
      "post_content": "Nice card\n\n\nSent from my iPhone using Tapatalk",
      "post_time": "20200915T18:42:59-06:00",
      "timestamp": "1600216979"
    },
    {
      "post_id": "2018245",
      "post_title": "",
      "post_author_name": "Jeff_cvc",
      "post_content": "Your transparency is appreciated. I’ll take it.",
      "post_time": "20200916T22:16:17-06:00",
      "timestamp": "1600316177"
    }
  ]
}